{smcl}
{txt}{sf}{ul off}

{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. cap noi {c -(}
. 
. use  "/Users/schaffne/Dropbox/EXPERIMENTS/OET/oetaug2010_pitstoplevel_v5.dta"
. 
. describe, short

{txt}Contains data from {res}/Users/schaffne/Dropbox/EXPERIMENTS/OET/oetaug2010_pitstoplevel_v5.dta
{txt}  obs:{res}         4,299                          
{txt} vars:{res}           166                          4 Oct 2010 12:35
{txt} size:{res}     2,295,666                          
{txt}Sorted by:  
{com}. 
. local N = r(N)
. local variables = r(k)
. 
. di "@N `N'"
{res}@N 4299
{com}. di "@variables `variables'"
{res}@variables 166
{com}. 
. datasignature
  {res}4299:166(93180):3708857484:2059411229
{com}. local datasig = "`r(datasignature)'"
. 
. di "@datasignature `datasig'"
{res}@datasignature 4299:166(93180):3708857484:2059411229
{com}. 
. cap noi xtset
{err}panel variable not set; use {bf:xtset} {it:varname} ...
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
.     di "@panelvar `r(panelvar)'"
. {c )-}
. 
. notes _dta
{res}{com}. 
. qui {c -(}
. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====id=====

{res}id:  timestamp (in ms since 1.1.1970)           {txt}Number of Observations
{hline 37}       {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #   #             {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #   #             {txt}Positive       {res} 4299         -       4299
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299         -       4299
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1.28e+12       1.28e+12                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 10}id {c |}{res}      4299    1.28e+12    1.05e+08   1.28e+12   1.28e+12
@mean  1.28e+12
@sd  1.05e+08
@min  1.28e+12
@max  1.28e+12
@example0 1.283e+12
@histh 1.247e-08, 1.649e-09, 1.082e-08, 1.376e-08, 1.099e-08, 1.911e-09, 1.283e-08, 1.273e-08, 5.973e-10, 1.247e-08, 1.247e-08
@histw 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12
@type double
@label timestamp (in ms since 1.1.1970)
@class other
@N_unique .
@N 4299
 
_@NOTES

id:
{txt}{p 2 6}
1.
"timestamp (in ms since 1.1.1970)"
{p_end}
{res} 
=====finalpayout=====

finalpayout:  Payout of this race (which ma     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  594       594          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 3672       198       3474
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4266       792       3474
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 100.2                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}finalpayout {c |}{res}      4266    14.89241     19.9247          0      100.2
@mean    14.892
@sd    19.925
@min     0.000
@max   100.200
@example0 16.004999
@histh .13037217, .03183506, .0272872, .03335102, .01212764, .01819147, .01212764, .00909573, .00757978, .00757978, .0136436, .00606382, .00303191, .00757978, .00454787, .00454787, .00303191, .00303191, .00151596, .00303191, .00151596, .00303191, .00151596, .00151596, .00151596, .00454787, .00151596, .00454787
@histw 1.3916667, 4.1749997, 6.958333, 9.7416668, 12.525, 15.308332, 18.091665, 20.875, 23.658333, 26.441666, 29.224998, 32.008331, 34.791664, 37.574997, 40.358334, 43.141666, 45.924999, 48.708332, 51.491665, 54.274998, 57.058331, 59.841663, 62.625, 65.408333, 70.974998, 79.324997, 82.10833, 98.808327
@type float
@label Payout of this race (which may or may not have been selected to be paid out)
@class other
@N_unique .
@N 4266
 
_@NOTES

finalpayout:
{txt}{p 2 6}
1.
"Payout of this race (which may or may not have been selected to be paid out)"
{p_end}
{res} 
=====place=====

place:  Place of own car at the end of the      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     5                      4299
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}place {c |}{res}      4299    2.270761     1.40719          1          5
@mean     2.271
@sd     1.407
@min         1
@max         5
@values 1, 2, 3, 4, 5
@names "1", "2", "3", "4", "5"
@freq 1827, 975, 513, 474, 510
@type byte
@label Place of own car at the end of the race
@class category
@N_unique 5
@N 4299
 
_@NOTES

place:
{txt}{p 2 6}
1.
"Place of own car at the end of the race"
{p_end}
{res} 
=====winner=====

winner:  Which car won the race? 1 through      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4299      4299          -
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     5                      4299
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}winner {c |}{res}      4299    2.935101    1.177074          1          5
@mean     2.935
@sd     1.177
@min         1
@max         5
@values 1, 2, 3, 4, 5
@names "1", "2", "3", "4", "5"
@freq 642, 675, 1827, 630, 525
@type byte
@label Which car won the race? 1 through 5
@class category
@N_unique 5
@N 4299
 
_@NOTES

winner:
{txt}{p 2 6}
1.
"Which car won the race? 1 through 5"
{p_end}
{res} 
=====currentseed=====

currentseed:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative       {res} 2211      2211          -
{txt}{c |}  {res}#               #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res} 2088      2088          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}-2.14e+09      2.15e+09                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}currentseed {c |}{res}      4299   -3.40e+07    1.30e+09  -2.14e+09   2.15e+09
@mean -3.40e+07
@sd  1.30e+09
@min -2.14e+09
@max  2.15e+09
@example0 -1.004e+09
@histh 2.109e-10, 2.460e-10, 3.866e-10, 1.406e-10, 3.163e-10, 2.811e-10, 4.217e-10, 2.811e-10, 2.109e-10, 3.456e-10, 1.406e-10, 2.109e-10, 1.054e-10, 1.054e-10, 3.163e-10, 1.757e-10, 2.811e-10, 1.406e-10, 1.757e-10, 2.109e-10, 2.109e-10, 1.757e-10, 2.460e-10, 1.406e-10, 2.460e-10, 2.109e-10, 1.757e-10, 2.460e-10, 1.757e-10, 3.163e-10, 2.460e-10, 3.514e-10, 1.054e-10, 1.406e-10, 3.514e-10, 3.514e-10
@histw -2.084e+09, -1.965e+09, -1.846e+09, -1.727e+09, -1.608e+09, -1.489e+09, -1.370e+09, -1.250e+09, -1.131e+09, -1.012e+09, -8.929e+08, -7.738e+08, -6.546e+08, -5.355e+08, -4.163e+08, -2.972e+08, -1.780e+08, -58895236, 60251656, 1.794e+08, 2.985e+08, 4.177e+08, 5.368e+08, 6.560e+08, 7.751e+08, 8.943e+08, 1.013e+09, 1.133e+09, 1.252e+09, 1.371e+09, 1.490e+09, 1.609e+09, 1.728e+09, 1.847e+09, 1.967e+09, 2.086e+09
@type long
@label 
@class other
@N_unique .
@N 4299
 
_@NOTES
 
=====totalprpayout=====

totalprpayout:  Payout for guess-the-winner     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2268      2268          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2016         -       2016
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4284      2268       2016
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing        {res}   15
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                3.5482                      4299
  (73 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
totalprpay~t {c |}{res}      4284    .5834466    .7953809          0     3.5482
@mean     0.583
@sd     0.795
@min     0.000
@max     3.548
@example0 2.973
@histh 5.3714066, .25578126, .08526042, .34104168, .04263021, .08526042, .21315105, .17052084, .29841146, .42630211, .68208337, .08526042, .12789063, .12789063, .12789063, .21315105, .04263021, .08526042, .17052084, .25578126, .4689323, .12789063, .04263021, .04263021, .04263021, .17052084, .04263021
@histw .04928055, .14784166, .24640277, .34496388, .44352499, .54208612, .64064717, .73920834, .83776939, .93633056, 1.0348916, 1.1334528, 1.2320138, 1.330575, 1.429136, 1.5276972, 1.6262583, 1.7248194, 1.8233805, 1.9219416, 2.0205028, 2.1190639, 2.2176249, 2.6118693, 2.9075527, 3.0061138, 3.4989192
@type float
@label Payout for guess-the-winner responses
@class other
@N_unique 73
@N 4284
 
_@NOTES

totalprpayout:
{txt}{p 2 6}
1.
"Payout for guess-the-winner responses"
{p_end}
{res} 
=====bet=====

bet:  Amount wagered in this race               {txt}Number of Observations
{hline 33}           {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}    3         3          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4296       231       4065
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4299       234       4065
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 39.29                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}bet {c |}{res}      4299    7.628967    6.058411          0      39.29
@mean     7.629
@sd     6.058
@min     0.000
@max    39.290
@example0 32.580002
@histh .03133072, .07033426, .09591036, .08312231, .11573184, .10294379, .0799253, .07481008, .04987339, .04795518, .02877311, .0262155, .01278805, .01023044, .00575462, .00447582, .01086984, .00703343, .00767283, .01150924, .00703343, .00447582, .00511522, .00191821, .01086984, .00383641, .0006394, .0006394, .00447582
@histw .54569447, 1.6370834, 2.7284722, 3.8198612, 4.9112501, 6.0026388, 7.094028, 8.1854172, 9.2768059, 10.368195, 11.459583, 12.550973, 13.642362, 14.73375, 15.825139, 16.916529, 18.007917, 19.099306, 20.190695, 21.282084, 22.373472, 23.464861, 24.556252, 25.64764, 26.739029, 32.195972, 33.287361, 37.652916, 38.744305
@type float
@label Amount wagered in this race
@class other
@N_unique .
@N 4299
 
_@NOTES

bet:
{txt}{p 2 6}
1.
"Amount wagered in this race"
{p_end}
{res} 
=====beta=====

beta:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero           {res}    3         3          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4296         -       4296
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4299         3       4296
{txt}{c |}  {res}#   #   #   .   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0              .0010004                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}beta {c |}{res}      4299    .0003254    .0002504          0   .0010004
@mean     0.000
@sd     0.000
@min     0.000
@max     0.001
@example0 .00099999
@histh 200.90401, 1004.5201, 1958.8141, 2310.3962, 2762.4302, 1607.2321, 2486.1873, 2561.5261, 2913.1082, 2435.9612, 1732.7971, 1431.441, 1104.972, 1908.5881, 1054.7461, 1079.8591, 954.29407, 1004.5201, 728.27704, 200.90401, 226.01701, 175.79102, 50.226002, 175.79102, 150.67801, 175.79102, 175.79102, 125.56501, 175.79102, 100.452, 25.113001, 125.56501, 75.339005, 226.01701, 2561.5261
@histw .00001389, .00004168, .00006947, .00009726, .00012505, .00015283, .00018062, .00020841, .0002362, .00026398, .00029177, .00031956, .00034735, .00037514, .00040292, .00043071, .0004585, .00048629, .00051408, .00054186, .00056965, .00059744, .00062523, .00065301, .0006808, .00070859, .00073638, .00076417, .00079195, .00081974, .00084753, .00087532, .00093089, .00095868, .00098647
@type float
@label 
@class other
@N_unique .
@N 4299
 
_@NOTES
 
=====raceexp01=====

raceexp01:  On the whole, I am satisfied wi     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#               #         {txt}Positive       {res} 4290      4290          -
{txt}{c |}  {res}#               #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#           #   #         {txt}Total          {res} 4290      4290          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}    9
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}raceexp01 {c |}{res}      4290    5.876224    3.638903          1         10
@mean     5.876
@sd     3.639
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 954, 372, 240, 192, 123, 162, 258, 372, 516, 1101
@type byte
@label On the whole, I am satisfied with the outcome of this race. (strongly disagree=1
@class category
@N_unique 10
@N 4290
 
_@NOTES

raceexp01:
{txt}{p 2 6}
1.
"On the whole, I am satisfied with the outcome of this race. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====raceexp02=====

raceexp02:  The race was exciting/interesti     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#           #   #         {txt}Positive       {res} 4278      4278          -
{txt}{c |}  {res}#           #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4278      4278          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}   21
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}raceexp02 {c |}{res}      4278    5.884993     3.25631          1         10
@mean     5.885
@sd     3.256
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 696, 342, 255, 285, 246, 270, 417, 501, 546, 720
@type byte
@label The race was exciting/interesting to watch. (strongly disagree=1 to strongly agr
@class category
@N_unique 10
@N 4278
 
_@NOTES

raceexp02:
{txt}{p 2 6}
1.
"The race was exciting/interesting to watch. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====raceexp03=====

raceexp03:  The race was exciting/interesti     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#           #   #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#           #   #         {txt}Positive       {res} 4272      4272          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4272      4272          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}   27
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}raceexp03 {c |}{res}      4272    5.634129    3.102372          1         10
@mean     5.634
@sd     3.102
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 648, 360, 318, 336, 294, 351, 402, 564, 489, 510
@type byte
@label The race was exciting/interesting in the first couple of rounds. (strongly disag
@class category
@N_unique 10
@N 4272
 
_@NOTES

raceexp03:
{txt}{p 2 6}
1.
"The race was exciting/interesting in the first couple of rounds. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====raceexp04=====

raceexp04:  The winner of the race was very     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4284      4284          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#           #   #         {txt}Total          {res} 4284      4284          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}   15
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}raceexp04 {c |}{res}      4284    6.706583    3.104311          1         10
@mean     6.707
@sd     3.104
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 387, 279, 246, 255, 285, 291, 339, 468, 600, 1134
@type byte
@label The winner of the race was very obvious for the last round. (strongly disagree=1
@class category
@N_unique 10
@N 4284
 
_@NOTES

raceexp04:
{txt}{p 2 6}
1.
"The winner of the race was very obvious for the last round. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====raceexp05=====

raceexp05:  I would change my decisions if      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#               #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#               #         {txt}Positive       {res} 4290      4290          -
{txt}{c |}  {res}#       #       #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4290      4290          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}    9
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}raceexp05 {c |}{res}      4290    5.332168     3.33795          1         10
@mean     5.332
@sd     3.338
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 909, 369, 330, 279, 309, 360, 294, 315, 411, 714
@type byte
@label I would change my decisions if I could. (strongly disagree=1 to strongly agree=1
@class category
@N_unique 10
@N 4290
 
_@NOTES

raceexp05:
{txt}{p 2 6}
1.
"I would change my decisions if I could. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====winvalue=====

winvalue:  Amount participant will win if h     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}    3         3          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4296       351       3945
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4299       354       3945
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                589.35                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}winvalue {c |}{res}      4299    43.48596    46.41866          0     589.35
@mean    43.486
@sd    46.419
@min     0.000
@max   589.350
@example0 162.90001
@histh .01355533, .01837216, .0133422, .00541361, .00306913, .00200346, .00191821, .00089516, .00085254, .0004689, .0004689, .00008525, .00004263, .00012788, .00004263, .00004263, .00008525, .00008525, .00004263, .00008525, .00004263, .00004263
@histw 8.1854172, 24.556252, 40.927086, 57.29792, 73.668755, 90.039589, 106.41042, 122.78126, 139.1521, 155.52292, 188.26459, 204.63544, 237.37711, 253.74792, 270.11877, 302.86044, 319.23126, 335.60211, 368.34378, 401.08545, 499.31046, 581.16461
@type float
@label Amount participant will win if his car wins
@class other
@N_unique .
@N 4299
 
_@NOTES

winvalue:
{txt}{p 2 6}
1.
"Amount participant will win if his car wins"
{p_end}
{res} 
=====psconfidence=====

psconfidence:  How confident are you about      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero           {res}   16        16          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4282      4282          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4298      4298          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing        {res}    1
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                   100                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
psconfidence {c |}{res}      4298    70.71847    24.21446          0        100
@mean    70.718
@sd    24.214
@min         0
@max       100
@example0 100
@histh .00737087, .0029316, .0016752, .00318288, .0004188, .0012564, .00075384, .00242904, .00050256, .00108888, .00477431, .00192648, .00226152, .002094, .00737087, .00301536, .00561191, .00711959, .0292322, .00628199, .00544439, .02102373, .00393671, .00753839, .01264774, .02688692, .00586319, .01164262, .03434156, .01289902, .01072127, .00737087, .03199628, .01197766, .01666822, .04774314
@histw 1.3888888, 4.1666665, 6.9444447, 9.7222223, 12.5, 15.277778, 18.055555, 20.833334, 23.611111, 26.388889, 29.166666, 31.944445, 34.722221, 37.5, 40.277779, 43.055557, 45.833332, 48.611111, 51.388889, 54.166668, 56.944443, 59.722221, 62.5, 65.277779, 68.055557, 70.833336, 73.611115, 76.388885, 79.166664, 81.944443, 84.722221, 87.5, 90.277779, 93.055557, 95.833336, 98.611115
@type byte
@label How confident are you about your psexpectation?
@class other
@N_unique .
@N 4298
 
_@NOTES

psconfidence:
{txt}{p 2 6}
1.
"How confident are you about your psexpectation?"
{p_end}
{res} 
=====psexpectation=====

psexpectation:  Out of 1000 races, how like     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #   #   #         {txt}Zero           {res}  179       179          -
{txt}{c |}  {res}#       #   #   #         {txt}Positive       {res} 4120      4120          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  1000                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
psexpectat~n {c |}{res}      4299    520.6767    313.1772          0       1000
@mean   520.677
@sd   313.177
@min         0
@max      1000
@example0 0
@histh .0032575, .00084578, .00056106, .00141521, .00036008, .00041033, .00053594, .00126448, .00031821, .00046895, .00122261, .00055269, .00047732, .00036846, .00114724, .00036008, .00066155, .00162456, .00172505, .00068667, .00060293, .00194278, .00056106, .00066992, .00072017, .00197627, .00065318, .00074529, .00233636, .00069505, .00058618, .00057781, .00199302, .00059456, .00071179, .00236985
@histw 13.888889, 41.666668, 69.444443, 97.222221, 125, 152.77777, 180.55556, 208.33333, 236.11111, 263.88889, 291.66666, 319.44446, 347.22223, 375, 402.77777, 430.55554, 458.33334, 486.11111, 513.88892, 541.66669, 569.44446, 597.22223, 625, 652.77777, 680.55554, 708.33331, 736.11108, 763.88892, 791.66669, 819.44446, 847.22223, 875, 902.77777, 930.55554, 958.33331, 986.11108
@type int
@label Out of 1000 races, how likely would your car be to win from this pitstop onward?
@class other
@N_unique .
@N 4299
 
_@NOTES

psexpectation:
{txt}{p 2 6}
1.
"Out of 1000 races, how likely would your car be to win from this pitstop onward?"
{p_end}
{res} 
=====currentlap=====

currentlap:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#   #   #                 {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3                     9                      4299
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}currentlap {c |}{res}      4299           6    2.449775          3          9
@mean     6.000
@sd     2.450
@min     3.000
@max     9.000
@values 3, 6, 9
@names "3", "6", "9"
@freq 1433, 1433, 1433
@type float
@label 
@class category
@N_unique 3
@N 4299
 
_@NOTES
 
=====carcolor=====
@freq 1170, 612, 1350, 777
@values "blue", "magenta", "red", "yellow"
@type str7
@label Color of car
@class category
@N_unique 4
@N 3909
 
_@NOTES

carcolor:
{txt}{p 2 6}
1.
"Color of car"
{p_end}
{res} 
=====confidence=====

confidence:  How confident are you about yo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero           {res}   18        18          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4281      4281          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                   100                      4299
  (91 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}confidence {c |}{res}      4299    68.97278    22.88047          0        100
@mean    68.973
@sd    22.880
@min         0
@max       100
@example0 100
@histh .00628053, .00075366, .00150733, .00527565, .00025122, .00050244, .00200977, .00050244, .00276343, .00552687, .00226099, .00376832, .00150733, .00602931, .00326588, .00301465, .00803908, .04094906, .00602931, .0047732, .02185625, .00401954, .00979763, .01030007, .028388, .00753664, .01331472, .03768318, .01281228, .01507327, .00703419, .03617585, .00954641, .01356595, .02788555
@histw 1.3888888, 4.1666665, 6.9444447, 9.7222223, 15.277778, 18.055555, 20.833334, 23.611111, 26.388889, 29.166666, 31.944445, 34.722221, 37.5, 40.277779, 43.055557, 45.833332, 48.611111, 51.388889, 54.166668, 56.944443, 59.722221, 62.5, 65.277779, 68.055557, 70.833336, 73.611115, 76.388885, 79.166664, 81.944443, 84.722221, 87.5, 90.277779, 93.055557, 95.833336, 98.611115
@type byte
@label How confident are you about your expectation?
@class other
@N_unique 91
@N 4299
 
_@NOTES

confidence:
{txt}{p 2 6}
1.
"How confident are you about your expectation?"
{p_end}
{res} 
=====dropoutlap=====

dropoutlap:  Lap after which participant dr     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  795       795          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res}  795       795          -
{txt}{c |}  {res}#   #   #                 {txt}Missing        {res} 3504
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3                     9                      4299
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}dropoutlap {c |}{res}       795    4.879245    2.418549          3          9
@mean     4.879
@sd     2.419
@min         3
@max         9
@values 3, 6, 9
@names "3", "6", "9"
@freq 462, 168, 165
@type byte
@label Lap after which participant dropped out (missing if did not drop out)
@class category
@N_unique 3
@N 795
 
_@NOTES

dropoutlap:
{txt}{p 2 6}
1.
"Lap after which participant dropped out (missing if did not drop out)"
{p_end}
{res} 
=====expectation=====

expectation:  Out of 1000 races, how likely     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero           {res}   90        90          -
{txt}{c |}          {res}#   #   #         {txt}Positive       {res} 4209      4209          -
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  1000                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}expectation {c |}{res}      4299    600.8423    275.5426          0       1000
@mean   600.842
@sd   275.543
@min         0
@max      1000
@example0 0
@histh .00168318, .00035171, .00027634, .0009044, .00017585, .00027634, .00035171, .00115562, .00032659, .00030147, .00060293, .0004522, .00055269, .00037683, .00085415, .00025122, .00030147, .00198465, .00195953, .00050244, .00042708, .00263782, .00077879, .00060293, .0009044, .00256246, .00070342, .00128123, .00417027, .00100488, .00082903, .00085415, .00253733, .00042708, .00072854, .00190928
@histw 13.888889, 41.666668, 69.444443, 97.222221, 125, 152.77777, 180.55556, 208.33333, 236.11111, 263.88889, 291.66666, 319.44446, 347.22223, 375, 402.77777, 430.55554, 458.33334, 486.11111, 513.88892, 541.66669, 569.44446, 597.22223, 625, 652.77777, 680.55554, 708.33331, 736.11108, 763.88892, 791.66669, 819.44446, 847.22223, 875, 902.77777, 930.55554, 958.33331, 986.11108
@type int
@label Out of 1000 races, how likely would your car be to win (measured at start of rac
@class other
@N_unique .
@N 4299
 
_@NOTES

expectation:
{txt}{p 2 6}
1.
"Out of 1000 races, how likely would your car be to win (measured at start of race)?"
{p_end}
{res} 
=====racenum=====

racenum:  Race Number (1-6)                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     6                      4299
   (6 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}racenum {c |}{res}      4299    3.498255    1.707342          1          6
@mean     3.498
@sd     1.707
@min         1
@max         6
@values 1, 2, 3, 4, 5, 6
@names "1", "2", "3", "4", "5", "6"
@freq 717, 717, 717, 717, 717, 714
@type byte
@label Race Number (1-6)
@class category
@N_unique 6
@N 4299
 
_@NOTES

racenum:
{txt}{p 2 6}
1.
"Race Number (1-6)"
{p_end}
{res} 
=====winvalue2=====

winvalue2:  Amount participant will win if      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}    3         3          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 3990       219       3771
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 3993       222       3771
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing        {res}  306
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 39.29                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}winvalue2 {c |}{res}      3993    7.291367    5.355082          0      39.29
@mean     7.291
@sd     5.355
@min     0.000
@max    39.290
@example0 .
@histh .0282245, .07090545, .09568794, .08191989, .12047043, .10739078, .0839851, .07778948, .05094178, .05025338, .02547089, .0275361, .01376805, .01101444, .00619562, .00481882, .01032604, .00688402, .00688402, .00826083, .00757243, .00344201, .00413041, .00206521, .00619562, .0013768, .0006884, .0006884, .0013768
@histw .54569447, 1.6370834, 2.7284722, 3.8198612, 4.9112501, 6.0026388, 7.094028, 8.1854172, 9.2768059, 10.368195, 11.459583, 12.550973, 13.642362, 14.73375, 15.825139, 16.916529, 18.007917, 19.099306, 20.190695, 21.282084, 22.373472, 23.464861, 24.556252, 25.64764, 26.739029, 32.195972, 33.287361, 37.652916, 38.744305
@type float
@label Amount participant will win if his car comes in second place
@class other
@N_unique .
@N 3993
 
_@NOTES

winvalue2:
{txt}{p 2 6}
1.
"Amount participant will win if his car comes in second place"
{p_end}
{res} 
=====winvalue3=====

winvalue3:  Amount participant will win if      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}    3         3          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4002       150       3852
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4005       153       3852
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing        {res}  294
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                19.645                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}winvalue3 {c |}{res}      4005    3.647494    2.674115          0     19.645
@mean     3.647
@sd     2.674
@min     0.000
@max    19.645
@example0 .
@histh .05627986, .141386, .19080247, .16334888, .24021894, .2155107, .16746691, .15648548, .1015783, .10295098, .05078915, .05490718, .02745359, .02196287, .01235412, .00960876, .0205902, .0137268, .0137268, .01647216, .01509948, .0068634, .00823608, .00411804, .01235412, .00274536, .00137268, .00137268, .00274536
@histw .27284724, .81854171, 1.3642361, 1.9099306, 2.4556251, 3.0013194, 3.547014, 4.0927086, 4.6384029, 5.1840973, 5.7297916, 6.2754865, 6.8211808, 7.3668752, 7.9125695, 8.4582644, 9.0039587, 9.5496531, 10.095347, 10.641042, 11.186736, 11.73243, 12.278126, 12.82382, 13.369514, 16.097986, 16.643681, 18.826458, 19.372152
@type float
@label Amount participant will win if his car comes in third place
@class other
@N_unique .
@N 4005
 
_@NOTES

winvalue3:
{txt}{p 2 6}
1.
"Amount participant will win if his car comes in third place"
{p_end}
{res} 
=====bettingjust=====

bettingjust:  Betting is justified. 1 = str     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4266      4266          -
{txt}{c |}          {res}#   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     5                      4299
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}bettingjust {c |}{res}      4266    3.012658    1.119508          1          5
@mean     3.013
@sd     1.120
@min         1
@max         5
@values 1, 2, 3, 4, 5
@names "1", "2", "3", "4", "5"
@freq 522, 702, 1620, 1044, 378
@type byte
@label Betting is justified. 1 = strongly disagree to 5=strongly agree
@class category
@N_unique 5
@N 4266
 
_@NOTES

bettingjust:
{txt}{p 2 6}
1.
"Betting is justified. 1 = strongly disagree to 5=strongly agree"
{p_end}
{res} 
=====financesat=====

financesat:  How satisfied are you with you     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4266      4266          -
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}financesat {c |}{res}      4266    5.118143     2.31213          1         10
@mean     5.118
@sd     2.312
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 180, 270, 774, 594, 792, 522, 432, 270, 180, 252
@type byte
@label How satisfied are you with your financial situation? 1 = very satisfied to 10=ve
@class category
@N_unique 10
@N 4266
 
_@NOTES

financesat:
{txt}{p 2 6}
1.
"How satisfied are you with your financial situation? 1 = very satisfied to 10=very unsatisfied"
{p_end}
{res} 
=====gamblingjust=====

gamblingjust:  Gambling is justified. 1 = s     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4266      4266          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     5                      4299
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
gamblingjust {c |}{res}      4266    2.616034    1.132806          1          5
@mean     2.616
@sd     1.133
@min         1
@max         5
@values 1, 2, 3, 4, 5
@names "1", "2", "3", "4", "5"
@freq 882, 972, 1566, 594, 252
@type byte
@label Gambling is justified. 1 = strongly disagree to 5=strongly agree
@class category
@N_unique 5
@N 4266
 
_@NOTES

gamblingjust:
{txt}{p 2 6}
1.
"Gambling is justified. 1 = strongly disagree to 5=strongly agree"
{p_end}
{res} 
=====happy=====

happy:  All things considered in your life,     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 4266      4266          -
{txt}{c |}          {res}#   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #             {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     5                      4299
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}happy {c |}{res}      4266    3.658228    .8453301          1          5
@mean     3.658
@sd     0.845
@min         1
@max         5
@values 1, 2, 3, 4, 5
@names "1", "2", "3", "4", "5"
@freq 72, 288, 1206, 2160, 540
@type byte
@label All things considered in your life, how happy would you say you are usually? 1=v
@class category
@N_unique 5
@N 4266
 
_@NOTES

happy:
{txt}{p 2 6}
1.
"All things considered in your life, how happy would you say you are usually? 1=very unhappy to 5=very happy"
{p_end}
{res} 
=====perfuni=====

perfuni:  Overall, how would you rate your      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4266      4266          -
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     5                      4299
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}perfuni {c |}{res}      4266    2.388186    .9101698          1          5
@mean     2.388
@sd     0.910
@min         1
@max         5
@values 1, 2, 3, 4, 5
@names "1", "2", "3", "4", "5"
@freq 666, 1800, 1350, 378, 72
@type byte
@label Overall, how would you rate your performance at university? 1=well above average
@class category
@N_unique 5
@N 4266
 
_@NOTES

perfuni:
{txt}{p 2 6}
1.
"Overall, how would you rate your performance at university? 1=well above average to 5=well below average"
{p_end}
{res} 
=====political=====

political:  How would you place your views      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4266      4266          -
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#                 {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}political {c |}{res}      4266    5.514768     1.89981          1         10
@mean     5.515
@sd     1.900
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 108, 162, 342, 396, 1116, 1170, 306, 396, 126, 144
@type byte
@label How would you place your views on this scale, generally speaking? 1=(far) left t
@class category
@N_unique 10
@N 4266
 
_@NOTES

political:
{txt}{p 2 6}
1.
"How would you place your views on this scale, generally speaking? 1=(far) left to 10=(far) right"
{p_end}
{res} 
=====wealthfam=====

wealthfam:  Would you say that your family      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 4266      4266          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   #   .                 {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     3                      4299
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}wealthfam {c |}{res}      4266    1.818565    .4998404          1          3
@mean     1.819
@sd     0.500
@min         1
@max         3
@values 1, 2, 3
@names "1", "2", "3"
@freq 990, 3060, 216
@type byte
@label Would you say that your family is...0=wealthier than others to 2=poorer than oth
@class category
@N_unique 3
@N 4266
 
_@NOTES

wealthfam:
{txt}{p 2 6}
1.
"Would you say that your family is...0=wealthier than others to 2=poorer than others"
{p_end}
{res} 
=====alcohol=====
@example0 
@type str17
@label When you drink alcohol, on average, how many drinks do you have?
@class string
@N_unique 48
@N 3924
 
_@NOTES

alcohol:
{txt}{p 2 6}
1.
"When you drink alcohol, on average, how many drinks do you have?"
{p_end}
{res} 
=====depression=====

depression:  Have you had any symptoms of o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3906      3906          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  360       360          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}depression {c |}{res}      4266    .0843882    .2780017          0          1
@mean     0.084
@sd     0.278
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 3906, 360
@type byte
@label Have you had any symptoms of or complaints about depression during the last mont
@class dummy
@N_unique 2
@N 4266
 
_@NOTES

depression:
{txt}{p 2 6}
1.
"Have you had any symptoms of or complaints about depression during the last month (30 days)? 1=yes, 0=no"
{p_end}
{res} 
=====haslucky=====

haslucky:  Do you have a lucky charm? 0=yes     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3042      3042          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1152      1152          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}  105
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}haslucky {c |}{res}      4194    .2746781    .4464052          0          1
@mean     0.275
@sd     0.446
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 3042, 1152
@type byte
@label Do you have a lucky charm? 0=yes, 1=no
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

haslucky:
{txt}{p 2 6}
1.
"Do you have a lucky charm? 0=yes, 1=no"
{p_end}
{res} 
=====height=====

height:  How tall are you, in centimetres?      {txt}Number of Observations
{hline 42}  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4248      4248          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4248      4248          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}   51
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}140                 542                      4299
  (45 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}height {c |}{res}      4248    170.3347    26.15943        140        542
@mean   170.335
@sd    26.159
@min       140
@max       542
@example0 180
@histh .00417404, .02011131, .03642803, .02390589, .0045535, .00037946
@histw 145.58333, 156.75, 167.91667, 179.08333, 190.25, 536.41669
@type int
@label How tall are you, in centimetres?
@class other
@N_unique 45
@N 4248
 
_@NOTES

height:
{txt}{p 2 6}
1.
"How tall are you, in centimetres?"
{p_end}
{res} 
=====lefthand=====

lefthand:  Which hand do you write with? 1=     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 4014      4014          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  252       252          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}lefthand {c |}{res}      4266    .0590717    .2357865          0          1
@mean     0.059
@sd     0.236
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 4014, 252
@type byte
@label Which hand do you write with? 1=left, 0=right
@class dummy
@N_unique 2
@N 4266
 
_@NOTES

lefthand:
{txt}{p 2 6}
1.
"Which hand do you write with? 1=left, 0=right"
{p_end}
{res} 
=====luckyans=====

luckyans:  What is your opinion of the foll     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#   #             {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Positive       {res} 4194      4194          -
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}  105
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     5                      4299
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}luckyans {c |}{res}      4194           3    1.168389          1          5
@mean     3.000
@sd     1.168
@min         1
@max         5
@values 1, 2, 3, 4, 5
@names "1", "2", "3", "4", "5"
@freq 612, 702, 1278, 1278, 324
@type byte
@label What is your opinion of the following statement - Good luck charms sometimes do 
@class category
@N_unique 5
@N 4194
 
_@NOTES

luckyans:
{txt}{p 2 6}
1.
"What is your opinion of the following statement - Good luck charms sometimes do bring good luck. 1=Definitely not true to 5=Definitely true"
{p_end}
{res} 
=====medication=====

medication:  Are you taking a prescribed me     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3924      3924          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  342       342          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}medication {c |}{res}      4266    .0801688    .2715861          0          1
@mean     0.080
@sd     0.272
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 3924, 342
@type byte
@label Are you taking a prescribed medication? 1=yes, 0=no
@class dummy
@N_unique 2
@N 4266
 
_@NOTES

medication:
{txt}{p 2 6}
1.
"Are you taking a prescribed medication? 1=yes, 0=no"
{p_end}
{res} 
=====relig=====

relig:  Apart from weddings, funerals and c     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4194      4194          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#       #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}  105
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     6                      4299
   (6 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}relig {c |}{res}      4194    3.875536    1.672224          1          6
@mean     3.876
@sd     1.672
@min         1
@max         6
@values 1, 2, 3, 4, 5, 6
@names "1", "2", "3", "4", "5", "6"
@freq 414, 720, 576, 684, 864, 936
@type byte
@label Apart from weddings, funerals and christenings, how often do you attend religiou
@class category
@N_unique 6
@N 4194
 
_@NOTES

relig:
{txt}{p 2 6}
1.
"Apart from weddings, funerals and christenings, how often do you attend religious services these days? 1=More than once a week, 2=Once a week, 3=Once a month, 4=Once a year, 5=Less often than once a year, 6=never"
{p_end}
{res} 
=====smoke=====

smoke:  Do you regularly smoke any tobacco      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 4122      4122          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  144       144          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   .   .                 {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     2                      4299
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}smoke {c |}{res}      4266    .0506329    .2860833          0          2
@mean     0.051
@sd     0.286
@min         0
@max         2
@values 0, 1, 2
@names "0", "1", "2"
@freq 4122, 72, 72
@type byte
@label Do you regularly smoke any tobacco product, such as cigarettes, cigars or pipes?
@class category
@N_unique 3
@N 4266
 
_@NOTES

smoke:
{txt}{p 2 6}
1.
"Do you regularly smoke any tobacco product, such as cigarettes, cigars or pipes? 0=Yes, daily, 1=Yes, but not every day, 2=No, not at all"
{p_end}
{res} 
=====vegi=====

vegi:  Are you a vegetarian? 1=Yes, 0=No        {txt}Number of Observations
{hline 40}    {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 4068      4068          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  198       198          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}vegi {c |}{res}      4266    .0464135    .2104036          0          1
@mean     0.046
@sd     0.210
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 4068, 198
@type byte
@label Are you a vegetarian? 1=Yes, 0=No
@class dummy
@N_unique 2
@N 4266
 
_@NOTES

vegi:
{txt}{p 2 6}
1.
"Are you a vegetarian? 1=Yes, 0=No"
{p_end}
{res} 
=====watchover=====

watchover:  Is there someone, who cannot be     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero           {res} 2052      2052          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 2124      2124          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4176      4176          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}  123
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}watchover {c |}{res}      4176    .5086207    .4999855          0          1
@mean     0.509
@sd     0.500
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2052, 2124
@type byte
@label Is there someone, who cannot be seen by others, watching over you? 0=Yes, 1=No
@class dummy
@N_unique 2
@N 4176
 
_@NOTES

watchover:
{txt}{p 2 6}
1.
"Is there someone, who cannot be seen by others, watching over you? 0=Yes, 1=No"
{p_end}
{res} 
=====weight=====

weight:  How much do you weigh in light clo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 4230      4176         54
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4230      4176         54
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing        {res}   69
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}30                  162                      4299
  (57 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}weight {c |}{res}      4230    64.65191    16.95489         30        162
@mean    64.652
@sd    16.955
@min    30.000
@max   162.000
@example0 100
@histh .00116054, .00464217, .01276596, .03133462, .03945841, .01972921, .03481625, .03597679, .027853, .00928433, .02088975, .00812379, .00232108, .00580271, .00348162, .00232108, .00232108, .00232108, .00116054, .00116054, .00116054, .00116054, .00116054, .00116054, .00116054
@histw 31.833334, 42.833332, 46.5, 50.166668, 53.833332, 57.5, 61.166668, 64.833336, 68.5, 72.166664, 75.833336, 79.5, 83.166664, 86.833336, 90.5, 94.166664, 97.833336, 101.5, 105.16666, 108.83334, 119.83334, 130.83333, 141.83333, 149.16667, 160.16667
@type double
@label How much do you weigh in light clothing, in kilograms?
@class other
@N_unique 57
@N 4230
 
_@NOTES

weight:
{txt}{p 2 6}
1.
"How much do you weigh in light clothing, in kilograms?"
{p_end}
{res} 
=====father_qualification=====

father_qualification:  Did your father comp     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  900       900          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 3366      3366          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   .   #                 {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     9                      4299
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
father_qua~n {c |}{res}      4266    1.936709    2.918386          0          9
@mean     1.937
@sd     2.918
@min         0
@max         9
@values 0, 1, 9
@names "0", "1", "9"
@freq 900, 2754, 612
@type byte
@label Did your father complete an educational qualification after leaving school?  Ple
@class category
@N_unique 3
@N 4266
 
_@NOTES

father_qualification:
{txt}{p 2 6}
1.
"Did your father complete an educational qualification after leaving school?  Please include any trade certificates, apprenticeships, diplomas, degrees or other educational qualifications. 1=Yes, 0=No, 9=Don't know"
{p_end}
{res} 
=====highqual=====

highqual:  If yes, what was the highest typ     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2070      2070          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2070      2070          -
{txt}{c |}  {res}#   #   .   .   #         {txt}Missing        {res} 2229
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     9                      4299
   (8 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}highqual {c |}{res}      2070    3.817391    2.244695          1          9
@mean     3.817
@sd     2.245
@min         1
@max         9
@values 1, 2, 3, 4, 5, 7, 8, 9
@names "1", "2", "3", "4", "5", "7", "8", "9"
@freq 36, 432, 1116, 54, 18, 180, 18, 216
@type byte
@label If yes, what was the highest type of qualification you obtained?1=University[doc
@class category
@N_unique 8
@N 2070
 
_@NOTES

highqual:
{txt}{p 2 6}
1.
"If yes, what was the highest type of qualification you obtained?1=University[doctorate],2=University[Master],3=University[Bachelor],4=University[Other],5=Teachers college/College of Advanced Education,6=Institute of Technology,7=Technical colle"
{p_end}
{res} 
=====highqual_father=====

highqual_father:  If yes, what was the high     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2808      2808          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2808      2808          -
{txt}{c |}  {res}#   #   .   #   .         {txt}Missing        {res} 1491
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     9                      4299
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
highqual_f~r {c |}{res}      2808    3.628205    2.057929          1          9
@mean     3.628
@sd     2.058
@min         1
@max         9
@values 1, 2, 3, 4, 5, 6, 7, 8, 9
@names "1", "2", "3", "4", "5", "6", "7", "8", "9"
@freq 126, 612, 1350, 144, 72, 54, 252, 18, 180
@type byte
@label If yes, what was the highest type of qualification he obtained?1=University[doct
@class category
@N_unique 9
@N 2808
 
_@NOTES

highqual_father:
{txt}{p 2 6}
1.
"If yes, what was the highest type of qualification he obtained?1=University[doctorate],2=University[Master],3=University[Bachelor],4=University[Other],5=Teachers college/College of Advanced Education,6=Institute of Technology,7=Technical colleg"
{p_end}
{res} 
=====highqual_mother=====

highqual_mother:  If yes, what was the high     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2538      2538          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 2538      2538          -
{txt}{c |}  {res}#   #   .   #   .         {txt}Missing        {res} 1761
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     9                      4299
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
highqual_m~r {c |}{res}      2538    3.992908    2.058072          1          9
@mean     3.993
@sd     2.058
@min         1
@max         9
@values 1, 2, 3, 4, 5, 6, 7, 8, 9
@names "1", "2", "3", "4", "5", "6", "7", "8", "9"
@freq 126, 234, 1278, 144, 234, 36, 270, 90, 126
@type byte
@label If yes, what was the highest type of qualification she obtained?1=University[doc
@class category
@N_unique 9
@N 2538
 
_@NOTES

highqual_mother:
{txt}{p 2 6}
1.
"If yes, what was the highest type of qualification she obtained?1=University[doctorate],2=University[Master],3=University[Bachelor],4=University[Other],5=Teachers college/College of Advanced Education,6=Institute of Technology,7=Technical colle"
{p_end}
{res} 
=====jobtitle_father=====
@example0 
@type str50
@label What is the full title of your father's occupation?
@class string
@N_unique 124
@N 3150
 
_@NOTES

jobtitle_father:
{txt}{p 2 6}
1.
"What is the full title of your father's occupation?"
{p_end}
{res} 
=====jobtitle_mother=====
@example0 
@type str45
@label What is the full title of your mother's occupation?
@class string
@N_unique 117
@N 2952
 
_@NOTES

jobtitle_mother:
{txt}{p 2 6}
1.
"What is the full title of your mother's occupation?"
{p_end}
{res} 
=====mother_qualification=====

mother_qualification:  Did your mother comp     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1260      1260          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 3006      3006          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   .   .                 {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     9                      4299
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
mother_qua~n {c |}{res}      4266    1.683544    2.767877          0          9
@mean     1.684
@sd     2.768
@min         0
@max         9
@values 0, 1, 9
@names "0", "1", "9"
@freq 1260, 2484, 522
@type byte
@label Did your mother complete an educational qualification after leaving school?  Ple
@class category
@N_unique 3
@N 4266
 
_@NOTES

mother_qualification:
{txt}{p 2 6}
1.
"Did your mother complete an educational qualification after leaving school?  Please include any trade certificates, apprenticeships, diplomas, degrees or other educational qualifications. 1=Yes, 0=No, 9=Don't know"
{p_end}
{res} 
=====occupation_father=====

occupation_father:  Please select the categ     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4266      4266          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    99                      4299
  (12 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
occupa~ather {c |}{res}      4266    10.16456    24.85034          1         99
@mean    10.165
@sd    24.850
@min         1
@max        99
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 99
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "99"
@freq 1422, 1026, 72, 558, 36, 198, 90, 126, 216, 180, 36, 306
@type byte
@label Please select the category or class of professions your father's occupation fall
@class category
@N_unique 12
@N 4266
 
_@NOTES

occupation_father:
{txt}{p 2 6}
1.
"Please select the category or class of professions your father's occupation falls into (even if he is unemployed): 1=MANAGERS AND ADMINISTRATORS,2=PROFESSIONALS,3=ASSOCIATE PROFESSIONALS,4=TRADESPERSONS AND RELATED WORKERS,5=ADVANCED CLERICAL A"
{p_end}
{res} 
=====occupation_mother=====

occupation_mother:  Please select the categ     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4266      4266          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    99                      4299
  (12 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
occupa~other {c |}{res}      4266    15.05063    28.44451          1         99
@mean    15.051
@sd    28.445
@min         1
@max        99
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 99
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "99"
@freq 738, 846, 72, 180, 306, 270, 18, 108, 126, 72, 1098, 432
@type byte
@label Please select the category or class of professions your mother's occupation fall
@class category
@N_unique 12
@N 4266
 
_@NOTES

occupation_mother:
{txt}{p 2 6}
1.
"Please select the category or class of professions your mother's occupation falls into (even if she is unemployed): 1=MANAGERS AND ADMINISTRATORS,2=PROFESSIONALS,3=ASSOCIATE PROFESSIONALS,4=TRADESPERSONS AND RELATED WORKERS,5=ADVANCED CLERICAL "
{p_end}
{res} 
=====qualification=====

qualification:  Did you complete an educati     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2106      2106          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2160      2160          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   .   .                 {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     9                      4299
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
qualificat~n {c |}{res}      4266    .9451477    2.000537          0          9
@mean     0.945
@sd     2.001
@min         0
@max         9
@values 0, 1, 9
@names "0", "1", "9"
@freq 2106, 1926, 234
@type byte
@label Did you complete an educational qualification after leaving school?  Please incl
@class category
@N_unique 3
@N 4266
 
_@NOTES

qualification:
{txt}{p 2 6}
1.
"Did you complete an educational qualification after leaving school?  Please include any trade certificates, apprenticeships, diplomas, degrees or other educational qualifications. 1=Yes, 0=No, 9=Don't know"
{p_end}
{res} 
=====schooling=====

schooling:  What was the highest year of sc     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4266      4266          -
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#                 {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}.   .   #   .   .         {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     9                      4299
   (6 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}schooling {c |}{res}      4266    4.983122    .6091881          1          9
@mean     4.983
@sd     0.609
@min         1
@max         9
@values 1, 2, 3, 4, 5, 9
@names "1", "2", "3", "4", "5", "9"
@freq 18, 18, 54, 54, 4068, 54
@type byte
@label What was the highest year of school you completed? 1=None,2=Primary school only,
@class category
@N_unique 6
@N 4266
 
_@NOTES

schooling:
{txt}{p 2 6}
1.
"What was the highest year of school you completed? 1=None,2=Primary school only,3=Some secondary school, but no more than Year 10,4=Year 11 or equivalent,5=Year 12 or equivalent,9=Don't know"
{p_end}
{res} 
=====schooling_father=====

schooling_father:  And how much schooling d     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4266      4266          -
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#                 {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}.   #   #   .   .         {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     9                      4299
   (6 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
school~ather {c |}{res}      4266    4.831224    1.345958          1          9
@mean     4.831
@sd     1.346
@min         1
@max         9
@values 1, 2, 3, 4, 5, 9
@names "1", "2", "3", "4", "5", "9"
@freq 72, 126, 414, 162, 3258, 234
@type byte
@label And how much schooling did your father complete? 1=None,2=Primary school only,3=
@class category
@N_unique 6
@N 4266
 
_@NOTES

schooling_father:
{txt}{p 2 6}
1.
"And how much schooling did your father complete? 1=None,2=Primary school only,3=Some secondary school, but no more than Year 10,4=Year 11 or equivalent,5=Year 12 or equivalent,9=Don't know"
{p_end}
{res} 
=====schooling_mother=====

schooling_mother:  And how much schooling d     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4266      4266          -
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#                 {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}.   #   #   .   .         {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     9                      4299
   (6 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
school~other {c |}{res}      4266    4.708861    1.560383          1          9
@mean     4.709
@sd     1.560
@min         1
@max         9
@values 1, 2, 3, 4, 5, 9
@names "1", "2", "3", "4", "5", "9"
@freq 72, 180, 720, 198, 2790, 306
@type byte
@label And how much schooling did your mother complete? 1=None,2=Primary school only,3=
@class category
@N_unique 6
@N 4266
 
_@NOTES

schooling_mother:
{txt}{p 2 6}
1.
"And how much schooling did your mother complete? 1=None,2=Primary school only,3=Some secondary school, but no more than Year 10,4=Year 11 or equivalent,5=Year 12 or equivalent,9=Don't know"
{p_end}
{res} 
=====birthcountry=====
@example0 Africa
@type str11
@label Please enter the country you were born.
@class string
@N_unique 60
@N 4266
 
_@NOTES

birthcountry:
{txt}{p 2 6}
1.
"Please enter the country you were born."
{p_end}
{res} 
=====culture=====
@example0 Africa
@type str23
@label Please enter the country whose culture you identify with most strongly.
@class string
@N_unique 59
@N 4266
 
_@NOTES

culture:
{txt}{p 2 6}
1.
"Please enter the country whose culture you identify with most strongly."
{p_end}
{res} 
=====dayofbirth=====

dayofbirth:  Day of birth                       {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#           #             {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #   #   #         {txt}Positive       {res} 4230      4230          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4230      4230          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}   69
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    31                      4299
  (31 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}dayofbirth {c |}{res}      4230    15.20426    9.155594          1         31
@mean    15.204
@sd     9.156
@min         1
@max        31
@example0 1
@histh .06638298, .06638298, .03574468, .0306383, .05106383, .05617021, .0306383, .02553191, .0306383, .02553191, .02553191, .04085106, .05617021, .0306383, .02553191, .05106383, .02553191, .01531915, .05106383, .0306383, .0612766, .04085106, .0612766, .02553191, .07659575, .01531915, .02042553, .0306383, .02042553, .04595745, .0306383
@histw 1.4166666, 2.25, 3.0833333, 3.9166667, 4.75, 6.4166665, 7.25, 8.083333, 8.916667, 9.75, 11.416667, 12.25, 13.083333, 13.916667, 14.75, 16.416666, 17.25, 18.083334, 18.916666, 19.75, 21.416666, 22.25, 23.083334, 23.916666, 24.75, 26.416666, 27.25, 28.083334, 28.916666, 29.75, 30.583334
@type byte
@label Day of birth
@class other
@N_unique 31
@N 4230
 
_@NOTES

dayofbirth:
{txt}{p 2 6}
1.
"Day of birth"
{p_end}
{res} 
=====degree=====
@example0 
@type str33
@label Which degree program are you enrolled in (economics, commerce, etc.)?
@class string
@N_unique 96
@N 4176
 
_@NOTES

degree:
{txt}{p 2 6}
1.
"Which degree program are you enrolled in (economics, commerce, etc.)?"
{p_end}
{res} 
=====englishspeaker=====

englishspeaker:  Do you speak English at ho     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2484      2484          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1782      1782          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
englishspe~r {c |}{res}      4266    .4177215    .4932416          0          1
@mean     0.418
@sd     0.493
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2484, 1782
@type byte
@label Do you speak English at home? 1=yes, 0=no
@class dummy
@N_unique 2
@N 4266
 
_@NOTES

englishspeaker:
{txt}{p 2 6}
1.
"Do you speak English at home? 1=yes, 0=no"
{p_end}
{res} 
=====experiment=====

experiment:  Have you ever participated in      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  630       630          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 3636      3636          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}experiment {c |}{res}      4266    .8523207    .3548234          0          1
@mean     0.852
@sd     0.355
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 630, 3636
@type byte
@label Have you ever participated in an experiment before? 1=yes, 0=no
@class dummy
@N_unique 2
@N 4266
 
_@NOTES

experiment:
{txt}{p 2 6}
1.
"Have you ever participated in an experiment before? 1=yes, 0=no"
{p_end}
{res} 
=====gender=====

gender:  1=male, 2=female                       {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4266      4266          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     2                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}gender {c |}{res}      4266    1.451477    .4976983          1          2
@mean     1.451
@sd     0.498
@min         1
@max         2
@values 1, 2
@names "1", "2"
@freq 2340, 1926
@type byte
@label 1=male, 2=female
@class dummy
@N_unique 2
@N 4266
 
_@NOTES

gender:
{txt}{p 2 6}
1.
"1=male, 2=female"
{p_end}
{res} 
=====internationalstudent=====

internationalstudent:  1=yes, 0=no              {txt}Number of Observations
{hline 34}          {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1422      1422          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2826      2826          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4248      4248          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}   51
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
internatio~t {c |}{res}      4248    .6652542    .4719571          0          1
@mean     0.665
@sd     0.472
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1422, 2826
@type byte
@label 1=yes, 0=no
@class dummy
@N_unique 2
@N 4248
 
_@NOTES

internationalstudent:
{txt}{p 2 6}
1.
"1=yes, 0=no"
{p_end}
{res} 
=====living=====

living:  What is your current living situat     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero           {res} 1044      1044          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 3222      3222          -
{txt}{c |}  {res}#           #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#           #   #         {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   .   .   #   #         {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     5                      4299
   (6 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}living {c |}{res}      4266    2.700422    1.686241          0          5
@mean     2.700
@sd     1.686
@min         0
@max         5
@values 0, 1, 2, 3, 4, 5
@names "0", "1", "2", "3", "4", "5"
@freq 1044, 36, 252, 1026, 1638, 270
@type byte
@label What is your current living situation? 0=Living alone (renting),1=Living alone (
@class category
@N_unique 6
@N 4266
 
_@NOTES

living:
{txt}{p 2 6}
1.
"What is your current living situation? 0=Living alone (renting),1=Living alone (owning),2=Living with your partner,3=Living with your parents,4=Living in a shared house,5=Other"
{p_end}
{res} 
=====maritalstatus=====

maritalstatus:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero           {res}  108       108          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4158      4158          -
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#                 {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}.   #   #                 {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     2                      4299
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
maritalsta~s {c |}{res}      4266    1.755274    .4853073          0          2
@mean     1.755
@sd     0.485
@min         0
@max         2
@values 0, 1, 2
@names "0", "1", "2"
@freq 108, 828, 3330
@type byte
@label 
@class category
@N_unique 3
@N 4266
 
_@NOTES
 
=====monthofbirth=====

monthofbirth:  Month of birth                   {txt}Number of Observations
{hline 29}               {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #           #         {txt}Positive       {res} 4230      4230          -
{txt}{c |}  {res}#   #           #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4230      4230          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}   69
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    12                      4299
  (12 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
monthofbirth {c |}{res}      4230    6.561702    3.557766          1         12
@mean     6.562
@sd     3.558
@min         1
@max        12
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"
@freq 342, 378, 252, 558, 342, 306, 252, 270, 324, 414, 360, 432
@type byte
@label Month of birth
@class category
@N_unique 12
@N 4230
 
_@NOTES

monthofbirth:
{txt}{p 2 6}
1.
"Month of birth"
{p_end}
{res} 
=====monthofgrad=====

monthofgrad:  When do you expect to graduat     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4122      4122          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#       #         {txt}Total          {res} 4122      4122          -
{txt}{c |}  {res}#   .   #   .   #         {txt}Missing        {res}  177
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    12                      4299
  (12 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}monthofgrad {c |}{res}      4122    8.930131    3.177048          1         12
@mean     8.930
@sd     3.177
@min         1
@max        12
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"
@freq 72, 36, 360, 18, 90, 414, 540, 144, 126, 108, 1134, 1080
@type byte
@label When do you expect to graduate? (month)
@class category
@N_unique 12
@N 4122
 
_@NOTES

monthofgrad:
{txt}{p 2 6}
1.
"When do you expect to graduate? (month)"
{p_end}
{res} 
=====nationality=====
@example0 African
@type str18
@label Please enter your nationality.
@class string
@N_unique 59
@N 4266
 
_@NOTES

nationality:
{txt}{p 2 6}
1.
"Please enter your nationality."
{p_end}
{res} 
=====postcode=====

postcode:  Please enter the postcode of the     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 3672      3672          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 3672      3672          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  627
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2000               2763                      4299
  (56 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}postcode {c |}{res}      3672     2070.98    98.85047       2000       2763
@mean  2070.980
@sd    98.850
@min      2000
@max      2763
@example0 .
@histh .00314805, .02743299, .00314805, .00202375, .00022486, .00247347, .00314805, .00134916, .00179888, .00022486, .00044972, .00044972
@histw 2010.9, 2032.7, 2054.5, 2076.3, 2098.1001, 2119.8999, 2141.7, 2163.5, 2207.1001, 2228.8999, 2555.8999, 2752.1001
@type int
@label Please enter the postcode of the area you live in.
@class other
@N_unique 56
@N 3672
 
_@NOTES

postcode:
{txt}{p 2 6}
1.
"Please enter the postcode of the area you live in."
{p_end}
{res} 
=====weeklyincome=====

weeklyincome:  What is your weekly disposab     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2268      2268          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1998      1998          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     5                      4299
   (6 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
weeklyincome {c |}{res}      4266    .9451477     1.28998          0          5
@mean     0.945
@sd     1.290
@min         0
@max         5
@values 0, 1, 2, 3, 4, 5
@names "0", "1", "2", "3", "4", "5"
@freq 2268, 828, 702, 216, 108, 144
@type byte
@label What is your weekly disposable income? 0=None or less than $ 100,1=$ 100-199,2=$
@class category
@N_unique 6
@N 4266
 
_@NOTES

weeklyincome:
{txt}{p 2 6}
1.
"What is your weekly disposable income? 0=None or less than $ 100,1=$ 100-199,2=$ 200-299,3=$ 300-399,4=$ 400-499,5=$ 500 and over"
{p_end}
{res} 
=====yearofbirth=====

yearofbirth:  Year of birth                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 4266      4266          -
{txt}{c |}              {res}#                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#             {txt}Total          {res} 4266      4266          -
{txt}{c |}  {res}.   .   .   #   .         {txt}Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1963               1999                      4299
  (22 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}yearofbirth {c |}{res}      4266    1987.911    3.681343       1963       1999
@mean  1987.911
@sd     3.681
@min      1963
@max      1999
@values 1963, 1972, 1974, 1976, 1977, 1978, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1995, 1998, 1999
@names "1963", "1972", "1974", "1976", "1977", "1978", "1980", "1981", "1982", "1983", "1984", "1985", "1986", "1987", "1988", "1989", "1990", "1991", "1992", "1995", "1998", "1999"
@freq 18, 18, 18, 18, 36, 18, 18, 18, 54, 90, 108, 306, 432, 378, 594, 576, 828, 486, 180, 36, 18, 18
@type int
@label Year of birth
@class category
@N_unique 22
@N 4266
 
_@NOTES

yearofbirth:
{txt}{p 2 6}
1.
"Year of birth"
{p_end}
{res} 
=====yearofgrad=====

yearofgrad:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4176      4176          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4176      4176          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing        {res}  123
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2010               2014                      4299
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}yearofgrad {c |}{res}      4176     2011.47    1.117761       2010       2014
@mean  2011.470
@sd     1.118
@min      2010
@max      2014
@values 2010, 2011, 2012, 2013, 2014
@names "2010", "2011", "2012", "2013", "2014"
@freq 900, 1386, 1134, 540, 216
@type int
@label 
@class category
@N_unique 5
@N 4176
 
_@NOTES
 
=====dropout=====
@freq 3670, 629
@values "false", "true"
@type str5
@label True or False:  Participant dropped out at this pitstop
@class dummy
@N_unique 2
@N 4299
 
_@NOTES

dropout:
{txt}{p 2 6}
1.
"True or False:  Participant dropped out at this pitstop"
{p_end}
{res} 
=====dropoutvalue=====

dropoutvalue:  Payout to participant if he      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}    3         3          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4296       155       4141
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4299       158       4141
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                235.74                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
dropoutvalue {c |}{res}      4299    10.87149    13.97715          0     235.74
@mean    10.871
@sd    13.977
@min     0.000
@max   235.740
@example0 65.160004
@histh .07438381, .0403534, .01758357, .00781492, .00412059, .00259313, .00198925, .00120776, .00071045, .00056836, .00003552, .00046179, .00017761, .00007104, .00017761, .00003552, .00003552, .00010657, .00007104, .00007104, .00007104, .00003552, .00003552
@histw 3.2741671, 9.8225012, 16.370834, 22.919168, 29.467503, 36.015835, 42.564171, 49.112503, 55.660839, 62.209171, 68.757507, 75.30584, 81.854172, 94.950844, 101.49918, 108.04751, 121.14418, 127.69251, 134.24084, 147.33751, 160.43417, 199.72418, 232.46585
@type float
@label Payout to participant if he drops out at this pitstop
@class other
@N_unique .
@N 4299
 
_@NOTES

dropoutvalue:
{txt}{p 2 6}
1.
"Payout to participant if he drops out at this pitstop"
{p_end}
{res} 
=====winfactor=====

winfactor:  Multiple of bet to be won if pa     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#       #                 {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   .   #                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                    15                      4299
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}winfactor {c |}{res}      4299    6.780879    4.960232          2         15
@mean     6.781
@sd     4.960
@min         2
@max        15
@values 2, 5, 15
@names "2", "5", "15"
@freq 1098, 2106, 1095
@type byte
@label Multiple of bet to be won if participant's car comes in first place
@class category
@N_unique 3
@N 4299
 
_@NOTES

winfactor:
{txt}{p 2 6}
1.
"Multiple of bet to be won if participant's car comes in first place"
{p_end}
{res} 
=====earnings=====

earnings:  Income earned in real effort tas     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4299       108       4191
{txt}{c |}          {res}#   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #             {txt}Total          {res} 4299       108       4191
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.23232        41.33276                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}earnings {c |}{res}      4299    24.42959    6.216529    5.23232   41.33276
@mean    24.430
@sd     6.217
@min     5.232
@max    41.333
@example0 32.5802
@histh .00417537, .00417537, .00417537, .00835074, .00835074, .02087685, .00765485, .00417537, .00417537, .01252611, .02087685, .03340297, .04592908, .04592908, .05010445, .06680594, .06263056, .07515667, .07098131, .07933205, .08350742, .04175371, .05010445, .03757834, .0292276, .0292276, .02087685, .01670148, .00417537, .01670148, .00835074, .01670148, .00835074, .00417537
@histw 5.7337151, 6.736505, 7.739295, 9.744875, 10.747664, 11.750455, 12.753244, 13.756035, 14.758825, 15.761615, 16.764404, 17.767195, 18.769985, 19.772776, 20.775564, 21.778355, 22.781145, 23.783936, 24.786724, 25.789515, 26.792305, 27.795095, 28.797884, 29.800674, 30.803465, 31.806255, 32.809044, 33.811836, 34.814625, 35.817413, 36.820206, 37.822994, 38.825787, 40.831364
@type float
@label Income earned in real effort task
@class other
@N_unique .
@N 4299
 
_@NOTES

earnings:
{txt}{p 2 6}
1.
"Income earned in real effort task"
{p_end}
{res} 
=====risk_1=====

risk_1:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 4227      4227          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   72        72          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_1 {c |}{res}      4299    .0167481     .128341          0          1
@mean     0.017
@sd     0.128
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 4227, 72
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 1, 1=Participant prefers
@class dummy
@N_unique 2
@N 4299
 
_@NOTES

risk_1:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 1, 1=Participant prefers more risky option in Risk Lottery 1"
{p_end}
{res} 
=====risk_2=====

risk_2:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 4083      4083          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  216       216          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_2 {c |}{res}      4299    .0502442    .2184739          0          1
@mean     0.050
@sd     0.218
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 4083, 216
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 2, 1=Participant prefers
@class dummy
@N_unique 2
@N 4299
 
_@NOTES

risk_2:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 2, 1=Participant prefers more risky option in Risk Lottery 2"
{p_end}
{res} 
=====risk_3=====

risk_3:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3993      3993          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  306       306          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_3 {c |}{res}      4299    .0711793    .2571541          0          1
@mean     0.071
@sd     0.257
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 3993, 306
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 3, 1=Participant prefers
@class dummy
@N_unique 2
@N 4299
 
_@NOTES

risk_3:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 3, 1=Participant prefers more risky option in Risk Lottery 3"
{p_end}
{res} 
=====risk_4=====

risk_4:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3489      3489          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  810       810          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_4 {c |}{res}      4299    .1884159    .3910894          0          1
@mean     0.188
@sd     0.391
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 3489, 810
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 4, 1=Participant prefers
@class dummy
@N_unique 2
@N 4299
 
_@NOTES

risk_4:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 4, 1=Participant prefers more risky option in Risk Lottery 4"
{p_end}
{res} 
=====risk_5=====

risk_5:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2409      2409          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1890      1890          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_5 {c |}{res}      4299    .4396371    .4964007          0          1
@mean     0.440
@sd     0.496
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2409, 1890
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 5, 1=Participant prefers
@class dummy
@N_unique 2
@N 4299
 
_@NOTES

risk_5:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 5, 1=Participant prefers more risky option in Risk Lottery 5"
{p_end}
{res} 
=====risk_6=====

risk_6:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1527      1527          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2772      2772          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_6 {c |}{res}      4299    .6448011    .4786292          0          1
@mean     0.645
@sd     0.479
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1527, 2772
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 6, 1=Participant prefers
@class dummy
@N_unique 2
@N 4299
 
_@NOTES

risk_6:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 6, 1=Participant prefers more risky option in Risk Lottery 6"
{p_end}
{res} 
=====risk_7=====

risk_7:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  810       810          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 3489      3489          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_7 {c |}{res}      4299    .8115841    .3910894          0          1
@mean     0.812
@sd     0.391
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 810, 3489
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 7, 1=Participant prefers
@class dummy
@N_unique 2
@N 4299
 
_@NOTES

risk_7:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 7, 1=Participant prefers more risky option in Risk Lottery 7"
{p_end}
{res} 
=====risk_8=====

risk_8:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  432       432          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 3867      3867          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_8 {c |}{res}      4299    .8995115    .3006852          0          1
@mean     0.900
@sd     0.301
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 432, 3867
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 8, 1=Participant prefers
@class dummy
@N_unique 2
@N 4299
 
_@NOTES

risk_8:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 8, 1=Participant prefers more risky option in Risk Lottery 8"
{p_end}
{res} 
=====risk_9=====

risk_9:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  216       216          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 4083      4083          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_9 {c |}{res}      4299    .9497558    .2184739          0          1
@mean     0.950
@sd     0.218
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 216, 4083
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 9, 1=Participant prefers
@class dummy
@N_unique 2
@N 4299
 
_@NOTES

risk_9:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 9, 1=Participant prefers more risky option in Risk Lottery 9"
{p_end}
{res} 
=====loc01=====

loc01:  I have little control over the thin     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #       #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}loc01 {c |}{res}      4299    4.755059    2.583869          1         10
@mean     4.755
@sd     2.584
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 288, 684, 828, 576, 306, 324, 414, 411, 342, 126
@type byte
@label I have little control over the things that happen to me. (strongly disagree=1 to
@class category
@N_unique 10
@N 4299
 
_@NOTES

loc01:
{txt}{p 2 6}
1.
"I have little control over the things that happen to me. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====loc02=====

loc02:  There is really no way I can solve      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}loc02 {c |}{res}      4299    4.523378     2.67263          1         10
@mean     4.523
@sd     2.673
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 450, 738, 828, 447, 432, 270, 252, 396, 324, 162
@type byte
@label There is really no way I can solve some of the problems I have. (strongly disagr
@class category
@N_unique 10
@N 4299
 
_@NOTES

loc02:
{txt}{p 2 6}
1.
"There is really no way I can solve some of the problems I have. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====loc03=====

loc03:  There is little I can do to change      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #       #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}loc03 {c |}{res}      4299    4.171668    2.516364          1         10
@mean     4.172
@sd     2.516
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 558, 828, 864, 357, 396, 288, 450, 288, 162, 108
@type byte
@label There is little I can do to change many of the important things in my life. (str
@class category
@N_unique 10
@N 4299
 
_@NOTES

loc03:
{txt}{p 2 6}
1.
"There is little I can do to change many of the important things in my life. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====loc04=====

loc04:  I often feel helpless in dealing wi     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}loc04 {c |}{res}      4299    4.326588    2.603532          1         10
@mean     4.327
@sd     2.604
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 612, 702, 720, 483, 396, 342, 396, 306, 180, 162
@type byte
@label I often feel helpless in dealing with the problems of life. (strongly disagree=1
@class category
@N_unique 10
@N 4299
 
_@NOTES

loc04:
{txt}{p 2 6}
1.
"I often feel helpless in dealing with the problems of life. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====loc05=====

loc05:  Sometimes I feel that I'm being pus     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #   #             {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #             {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}loc05 {c |}{res}      4299    4.835311    2.694694          1         10
@mean     4.835
@sd     2.695
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 630, 522, 504, 306, 378, 594, 501, 522, 180, 162
@type byte
@label Sometimes I feel that I'm being pushed around in life. (strongly disagree=1 to s
@class category
@N_unique 10
@N 4299
 
_@NOTES

loc05:
{txt}{p 2 6}
1.
"Sometimes I feel that I'm being pushed around in life. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====loc06=====

loc06:  What happens to me in the future mo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4299      4299          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}loc06 {c |}{res}      4299    8.009072    2.007005          1         10
@mean     8.009
@sd     2.007
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 36, 18, 108, 198, 252, 216, 375, 918, 1062, 1116
@type byte
@label What happens to me in the future mostly depends on me. (strongly disagree=1 to s
@class category
@N_unique 10
@N 4299
 
_@NOTES

loc06:
{txt}{p 2 6}
1.
"What happens to me in the future mostly depends on me. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====loc07=====

loc07:  I can do just about anything I real     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}loc07 {c |}{res}      4299     7.28053    2.056874          1         10
@mean     7.281
@sd     2.057
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 54, 162, 252, 396, 468, 753, 774, 792, 630
@type byte
@label I can do just about anything I really set my mind to. (strongly disagree=1 to st
@class category
@N_unique 10
@N 4299
 
_@NOTES

loc07:
{txt}{p 2 6}
1.
"I can do just about anything I really set my mind to. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav01=====

sav01:  Before a good thing happens, I look     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   #   .   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                    10                      4299
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav01 {c |}{res}      4299    7.958828    1.681871          2         10
@mean     7.959
@sd     1.682
@min         2
@max        10
@values 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 54, 162, 198, 270, 627, 1098, 1134, 738
@type byte
@label Before a good thing happens, I look forward to it in ways that give me pleasure 
@class category
@N_unique 9
@N 4299
 
_@NOTES

sav01:
{txt}{p 2 6}
1.
"Before a good thing happens, I look forward to it in ways that give me pleasure in the present. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav02=====

sav02:  It's hard for me to hang onto a goo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#       #             {txt}Positive       {res} 4299      4299          -
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav02 {c |}{res}      4299    5.082345    2.368695          1         10
@mean     5.082
@sd     2.369
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 198, 414, 828, 558, 360, 522, 573, 540, 216, 90
@type byte
@label It's hard for me to hang onto a good feeling for very long. (strongly disagree=1
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav02:
{txt}{p 2 6}
1.
"It's hard for me to hang onto a good feeling for very long. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav03=====

sav03:  I enjoy looking back on happy times     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav03 {c |}{res}      4299    7.924634    2.040971          1         10
@mean     7.925
@sd     2.041
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 108, 126, 90, 216, 270, 450, 951, 1062, 1008
@type byte
@label I enjoy looking back on happy times from my past. (strongly disagree=1 to strong
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav03:
{txt}{p 2 6}
1.
"I enjoy looking back on happy times from my past. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav04=====

sav04:  I don't like to look forward to goo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#       #             {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #   #             {txt}Positive       {res} 4299      4299          -
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav04 {c |}{res}      4299    5.305652    2.461446          1         10
@mean     5.306
@sd     2.461
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 252, 324, 648, 612, 447, 486, 450, 630, 324, 126
@type byte
@label I don't like to look forward to good times too much before they happen. (strongl
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav04:
{txt}{p 2 6}
1.
"I don't like to look forward to good times too much before they happen. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav05=====

sav05:  I know how to make the most of a go     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav05 {c |}{res}      4299    7.162596    2.034678          1         10
@mean     7.163
@sd     2.035
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 54, 54, 162, 234, 342, 468, 900, 807, 846, 432
@type byte
@label I know how to make the most of a good time. (strongly disagree=1 to strongly agr
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav05:
{txt}{p 2 6}
1.
"I know how to make the most of a good time. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav06=====

sav06:  I don't like to look back at good t     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav06 {c |}{res}      4299    4.291696    2.308975          1         10
@mean     4.292
@sd     2.309
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 396, 630, 954, 630, 378, 447, 360, 306, 108, 90
@type byte
@label I don't like to look back at good times too much after they've taken place. (str
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav06:
{txt}{p 2 6}
1.
"I don't like to look back at good times too much after they've taken place. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav07=====

sav07:  I feel a joy of anticipation when I     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav07 {c |}{res}      4299    7.996511    1.615057          1         10
@mean     7.997
@sd     1.615
@min         1
@max        10
@values 1, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 18, 126, 180, 288, 771, 1170, 864, 864
@type byte
@label I feel a joy of anticipation when I think about upcoming good things. (strongly 
@class category
@N_unique 9
@N 4299
 
_@NOTES

sav07:
{txt}{p 2 6}
1.
"I feel a joy of anticipation when I think about upcoming good things. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav08=====

sav08:  When it comes to enjoying myself, I     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #             {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav08 {c |}{res}      4299    4.915562    2.383163          1         10
@mean     4.916
@sd     2.383
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 360, 504, 540, 396, 684, 555, 702, 216, 252, 90
@type byte
@label When it comes to enjoying myself, I'm my own 'worst enemy'. (strongly disagree=1
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav08:
{txt}{p 2 6}
1.
"When it comes to enjoying myself, I'm my own 'worst enemy'. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav09=====

sav09:  I can make myself feel good by reme     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav09 {c |}{res}      4299    7.551989     1.89898          1         10
@mean     7.552
@sd     1.899
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 72, 108, 162, 252, 378, 702, 1113, 954, 540
@type byte
@label I can make myself feel good by remembering pleasant events from my past. (strong
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav09:
{txt}{p 2 6}
1.
"I can make myself feel good by remembering pleasant events from my past. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav10=====

sav10:  For me, anticipating what upcoming      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav10 {c |}{res}      4299    3.957432    2.287462          1         10
@mean     3.957
@sd     2.287
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 468, 864, 954, 576, 429, 270, 270, 306, 72, 90
@type byte
@label For me, anticipating what upcoming good events will be like is basically a waste
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav10:
{txt}{p 2 6}
1.
"For me, anticipating what upcoming good events will be like is basically a waste of time. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav11=====

sav11:  When something good happens, I can      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 4299      4299          -
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav11 {c |}{res}      4299    7.088625    1.989341          1         10
@mean     7.089
@sd     1.989
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 54, 72, 108, 234, 432, 555, 666, 1080, 756, 342
@type byte
@label When something good happens, I can make my enjoyment of it last longer by thinki
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav11:
{txt}{p 2 6}
1.
"When something good happens, I can make my enjoyment of it last longer by thinking or doing certain things. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav12=====

sav12:  When I reminisce about pleasant mem     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #             {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav12 {c |}{res}      4299    4.595953    2.458741          1         10
@mean     4.596
@sd     2.459
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 396, 648, 774, 396, 522, 432, 450, 393, 216, 72
@type byte
@label When I reminisce about pleasant memories, I often start to feel sad or disappoin
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav12:
{txt}{p 2 6}
1.
"When I reminisce about pleasant memories, I often start to feel sad or disappointed. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav13=====

sav13:  I can enjoy pleasant events in my m     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 4299      4299          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav13 {c |}{res}      4299    7.011863    2.103775          1         10
@mean     7.012
@sd     2.104
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 36, 72, 252, 270, 342, 486, 756, 1023, 594, 468
@type byte
@label I can enjoy pleasant events in my mind before they actually occur. (strongly dis
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav13:
{txt}{p 2 6}
1.
"I can enjoy pleasant events in my mind before they actually occur. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav14=====

sav14:  I can't seem to capture the joy of      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav14 {c |}{res}      4299     3.55478    2.104962          1         10
@mean     3.555
@sd     2.105
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 630, 774, 1332, 486, 288, 303, 144, 216, 90, 36
@type byte
@label I can't seem to capture the joy of happy moments. (strongly disagree=1 to strong
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav14:
{txt}{p 2 6}
1.
"I can't seem to capture the joy of happy moments. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav15=====

sav15:  I like to store memories of fun tim     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                    10                      4299
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav15 {c |}{res}      4299    7.635729    1.863636          2         10
@mean     7.636
@sd     1.864
@min         2
@max        10
@values 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 162, 180, 234, 378, 684, 1131, 810, 702
@type byte
@label I like to store memories of fun times that I go through so that I can recall the
@class category
@N_unique 9
@N 4299
 
_@NOTES

sav15:
{txt}{p 2 6}
1.
"I like to store memories of fun times that I go through so that I can recall them later. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav16=====

sav16:  It's hard for me to get very excite     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav16 {c |}{res}      4299    4.405443     2.30767          1         10
@mean     4.405
@sd     2.308
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 360, 684, 756, 594, 591, 432, 324, 324, 180, 54
@type byte
@label It's hard for me to get very excited about fun times before they actually take p
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav16:
{txt}{p 2 6}
1.
"It's hard for me to get very excited about fun times before they actually take place. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav17=====

sav17:  I feel fully able to appreciate goo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav17 {c |}{res}      4299    7.817865    1.833354          1         10
@mean     7.818
@sd     1.833
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 18, 108, 144, 213, 378, 558, 1116, 972, 774
@type byte
@label I feel fully able to appreciate good things that happen to me. (strongly disagre
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav17:
{txt}{p 2 6}
1.
"I feel fully able to appreciate good things that happen to me. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav18=====

sav18:  I find that thinking about good tim     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav18 {c |}{res}      4299     3.37753     2.27865          1         10
@mean     3.378
@sd     2.279
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 954, 915, 936, 396, 378, 198, 144, 234, 54, 90
@type byte
@label I find that thinking about good times from the past is basically a waste of time
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav18:
{txt}{p 2 6}
1.
"I find that thinking about good times from the past is basically a waste of time. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav19=====

sav19:  I can make myself feel good by imag     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 4299      4299          -
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav19 {c |}{res}      4299    7.263084    1.913524          1         10
@mean     7.263
@sd     1.914
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 54, 36, 72, 216, 342, 684, 558, 1185, 702, 450
@type byte
@label I can make myself feel good by imagining what a happy time that is about to happ
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav19:
{txt}{p 2 6}
1.
"I can make myself feel good by imagining what a happy time that is about to happen will be like. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav20=====

sav20:  I don't enjoy things as much as I s     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #             {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav20 {c |}{res}      4299    4.889044    2.552386          1         10
@mean     4.889
@sd     2.552
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 396, 504, 720, 414, 432, 558, 468, 393, 270, 144
@type byte
@label I don't enjoy things as much as I should. (strongly disagree=1 to strongly agree
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav20:
{txt}{p 2 6}
1.
"I don't enjoy things as much as I should. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav21=====

sav21:  It's easy for me to rekindle the jo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Positive       {res} 4299      4299          -
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav21 {c |}{res}      4299    7.078856    1.759655          1         10
@mean     7.079
@sd     1.760
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 36, 90, 144, 540, 720, 738, 1077, 666, 270
@type byte
@label It's easy for me to rekindle the joy from pleasant memories. (strongly disagree=
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav21:
{txt}{p 2 6}
1.
"It's easy for me to rekindle the joy from pleasant memories. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav22=====

sav22:  When I think about a pleasant event     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav22 {c |}{res}      4299    3.715283    2.152812          1         10
@mean     3.715
@sd     2.153
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 684, 846, 720, 699, 378, 432, 306, 144, 36, 54
@type byte
@label When I think about a pleasant event before it happens, I often start to feel une
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav22:
{txt}{p 2 6}
1.
"When I think about a pleasant event before it happens, I often start to feel uneasy or uncomfortable. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav23=====

sav23:  It's easy for me to enjoy myself wh     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 4299      4299          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                    10                      4299
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav23 {c |}{res}      4299    7.348221    1.926144          2         10
@mean     7.348
@sd     1.926
@min         2
@max        10
@values 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 108, 126, 198, 324, 411, 576, 1314, 846, 396
@type byte
@label It's easy for me to enjoy myself when I want to. (strongly disagree=1 to strongl
@class category
@N_unique 9
@N 4299
 
_@NOTES

sav23:
{txt}{p 2 6}
1.
"It's easy for me to enjoy myself when I want to. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav24=====

sav24:  For me, once a fun time is over and     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav24 {c |}{res}      4299    3.706909    2.271001          1         10
@mean     3.707
@sd     2.271
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 648, 756, 1116, 555, 414, 270, 180, 126, 90, 144
@type byte
@label For me, once a fun time is over and gone, it's best not to think about it. (stro
@class category
@N_unique 10
@N 4299
 
_@NOTES

sav24:
{txt}{p 2 6}
1.
"For me, once a fun time is over and gone, it's best not to think about it. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====opt01=====

opt01:  When I'm in a new and unfamiliar si     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}opt01 {c |}{res}      4299    3.250523    1.792076          1         10
@mean     3.251
@sd     1.792
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 540, 1098, 1278, 573, 324, 108, 234, 108, 18, 18
@type byte
@label When I'm in a new and unfamiliar situation, I am always optimistic that things w
@class category
@N_unique 10
@N 4299
 
_@NOTES

opt01:
{txt}{p 2 6}
1.
"When I'm in a new and unfamiliar situation, I am always optimistic that things will work out for me (in other words, I feel and think that things will be OK). (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====opt02=====

opt02:  I often find myself doing things th     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #   #             {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #   #             {txt}Positive       {res} 4299      4299          -
{txt}{c |}      {res}#   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}opt02 {c |}{res}      4299    5.708304    2.422278          1         10
@mean     5.708
@sd     2.422
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 72, 414, 504, 501, 594, 468, 414, 702, 468, 162
@type byte
@label I often find myself doing things that I know, at the time I choose to do them, I
@class category
@N_unique 10
@N 4299
 
_@NOTES

opt02:
{txt}{p 2 6}
1.
"I often find myself doing things that I know, at the time I choose to do them, I will regret later. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====opt03=====

opt03:  When I expect that good things are      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     8                      4299
   (8 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}opt03 {c |}{res}      4299    2.510119     1.47811          1          8
@mean     2.510
@sd     1.478
@min         1
@max         8
@values 1, 2, 3, 4, 5, 6, 7, 8
@names "1", "2", "3", "4", "5", "6", "7", "8"
@freq 1152, 1368, 1005, 414, 90, 162, 54, 54
@type byte
@label When I expect that good things are going to happen to me in the future, I feel b
@class category
@N_unique 8
@N 4299
 
_@NOTES

opt03:
{txt}{p 2 6}
1.
"When I expect that good things are going to happen to me in the future, I feel better about myself. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====opt04=====

opt04:  When I get disappointed about somet     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}opt04 {c |}{res}      4299    4.444522    2.202811          1         10
@mean     4.445
@sd     2.203
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 198, 738, 717, 864, 504, 450, 360, 198, 198, 72
@type byte
@label When I get disappointed about something, it makes me feel that I'm to blame, bec
@class category
@N_unique 10
@N 4299
 
_@NOTES

opt04:
{txt}{p 2 6}
1.
"When I get disappointed about something, it makes me feel that I'm to blame, because I should have known better in the first place and not expected as much. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====opt05=====

opt05:  I always try to be cautious when I      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}opt05 {c |}{res}      4299    3.079553    1.704208          1         10
@mean     3.080
@sd     1.704
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 594, 1242, 1185, 630, 252, 144, 108, 108, 18, 18
@type byte
@label I always try to be cautious when I approach new and unfamiliar situations, in ca
@class category
@N_unique 10
@N 4299
 
_@NOTES

opt05:
{txt}{p 2 6}
1.
"I always try to be cautious when I approach new and unfamiliar situations, in case something goes wrong. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====opt06=====

opt06:  I prefer to have low expectations o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #       #             {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}opt06 {c |}{res}      4299    5.139567    2.751465          1         10
@mean     5.140
@sd     2.751
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 324, 540, 699, 540, 378, 288, 306, 612, 342, 270
@type byte
@label I prefer to have low expectations of the future since that way I might be pleasa
@class category
@N_unique 10
@N 4299
 
_@NOTES

opt06:
{txt}{p 2 6}
1.
"I prefer to have low expectations of the future since that way I might be pleasantly surprised, and I'm protected from being disappointed. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se01=====

se01:  On the whole, I am satisfied with my     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   .   .   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                    10                      4299
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se01 {c |}{res}      4299    7.815073    1.533706          2         10
@mean     7.815
@sd     1.534
@min         2
@max        10
@values 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 72, 126, 144, 288, 720, 1386, 1185, 360
@type byte
@label On the whole, I am satisfied with myself. (strongly disagree=1 to strongly agree
@class category
@N_unique 9
@N 4299
 
_@NOTES

se01:
{txt}{p 2 6}
1.
"On the whole, I am satisfied with myself. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se02=====

se02:  At times I think I am no good at all     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #                 {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se02 {c |}{res}      4299    4.764131    2.636715          1         10
@mean     4.764
@sd     2.637
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 486, 738, 432, 396, 396, 648, 429, 306, 360, 108
@type byte
@label At times I think I am no good at all, (strongly disagree=1 to strongly agree=10)
@class category
@N_unique 10
@N 4299
 
_@NOTES

se02:
{txt}{p 2 6}
1.
"At times I think I am no good at all, (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se03=====

se03:  I feel that I have a number of good      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3                    10                      4299
   (8 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se03 {c |}{res}      4299    8.191905     1.41936          3         10
@mean     8.192
@sd     1.419
@min         3
@max        10
@values 3, 4, 5, 6, 7, 8, 9, 10
@names "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 54, 162, 234, 630, 1368, 951, 882
@type byte
@label I feel that I have a number of good qualities. (strongly disagree=1 to strongly 
@class category
@N_unique 8
@N 4299
 
_@NOTES

se03:
{txt}{p 2 6}
1.
"I feel that I have a number of good qualities. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se04=====

se04:  I am able to do things as well as mo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4299      4299          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3                    10                      4299
   (8 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se04 {c |}{res}      4299    8.062805    1.590532          3         10
@mean     8.063
@sd     1.591
@min         3
@max        10
@values 3, 4, 5, 6, 7, 8, 9, 10
@names "3", "4", "5", "6", "7", "8", "9", "10"
@freq 36, 126, 198, 306, 558, 1203, 1026, 846
@type byte
@label I am able to do things as well as most people. (strongly disagree=1 to strongly 
@class category
@N_unique 8
@N 4299
 
_@NOTES

se04:
{txt}{p 2 6}
1.
"I am able to do things as well as most people. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se05=====

se05:  I feel I do not have much to be prou     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se05 {c |}{res}      4299    3.839498    2.276248          1         10
@mean     3.839
@sd     2.276
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 576, 810, 990, 576, 396, 321, 144, 306, 126, 54
@type byte
@label I feel I do not have much to be proud of. (strongly disagree=1 to strongly agree
@class category
@N_unique 10
@N 4299
 
_@NOTES

se05:
{txt}{p 2 6}
1.
"I feel I do not have much to be proud of. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se06=====

se06:  I certainly feel useless at times. (     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #                 {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se06 {c |}{res}      4299    4.526169    2.529022          1         10
@mean     4.526
@sd     2.529
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 504, 828, 360, 486, 558, 501, 432, 324, 198, 108
@type byte
@label I certainly feel useless at times. (strongly disagree=1 to strongly agree=10)
@class category
@N_unique 10
@N 4299
 
_@NOTES

se06:
{txt}{p 2 6}
1.
"I certainly feel useless at times. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se07=====

se07:  I feel that I am a person of worth,      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4299      4299          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se07 {c |}{res}      4299    8.147941    1.764121          1         10
@mean     8.148
@sd     1.764
@min         1
@max        10
@values 1, 2, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 36, 108, 216, 393, 468, 882, 1044, 1134
@type byte
@label I feel that I am a person of worth, or at least on an equal plane with others. (
@class category
@N_unique 9
@N 4299
 
_@NOTES

se07:
{txt}{p 2 6}
1.
"I feel that I am a person of worth, or at least on an equal plane with others. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se08=====

se08:  I wish I could have more respect for     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #   #   #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se08 {c |}{res}      4299    5.698535    2.788216          1         10
@mean     5.699
@sd     2.788
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 414, 396, 378, 216, 468, 555, 468, 648, 396, 360
@type byte
@label I wish I could have more respect for myself. (strongly disagree=1 to strongly ag
@class category
@N_unique 10
@N 4299
 
_@NOTES

se08:
{txt}{p 2 6}
1.
"I wish I could have more respect for myself. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se09=====

se09:  All in all, I am inclined to feel th     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se09 {c |}{res}      4299    3.144452    2.264568          1         10
@mean     3.144
@sd     2.265
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 1260, 1026, 558, 378, 324, 303, 234, 72, 72, 72
@type byte
@label All in all, I am inclined to feel that I am a failure. (strongly disagree=1 to s
@class category
@N_unique 10
@N 4299
 
_@NOTES

se09:
{txt}{p 2 6}
1.
"All in all, I am inclined to feel that I am a failure. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se10=====

se10:  I take a positive attitude toward my     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     8                      4299
   (8 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se10 {c |}{res}      4299    2.843685    1.660658          1          8
@mean     2.844
@sd     1.661
@min         1
@max         8
@values 1, 2, 3, 4, 5, 6, 7, 8
@names "1", "2", "3", "4", "5", "6", "7", "8"
@freq 1098, 972, 954, 630, 267, 234, 90, 54
@type byte
@label I take a positive attitude toward myself. (strongly disagree=1 to strongly agree
@class category
@N_unique 8
@N 4299
 
_@NOTES

se10:
{txt}{p 2 6}
1.
"I take a positive attitude toward myself. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====hostname=====
@example0 client20
@type str8
@label Client computer number - unique within session
@class string
@N_unique 32
@N 4299
 
_@NOTES

hostname:
{txt}{p 2 6}
1.
"Client computer number - unique within session"
{p_end}
{res} 
=====number=====

number:  Participant number unique within s     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 4299      4299          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}.   .   .   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}107                 999                      4299
  (41 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}number {c |}{res}      4299    805.9044    131.1922        107        999
@mean   805.904
@sd   131.192
@min       107
@max       999
@example0 720
@histh .00033797, .00016898, .01737707, .00709728, .00016898, .00016898, .00253474, .01233575, .00016898
@histw 119.38889, 614.94446, 714.05554, 738.83331, 837.94446, 912.27777, 937.05554, 961.83331, 986.61108
@type int
@label Participant number unique within session.  9XX = HRV participant
@class other
@N_unique 41
@N 4299
 
_@NOTES

number:
{txt}{p 2 6}
1.
"Participant number unique within session.  9XX = HRV participant"
{p_end}
{res} 
=====session=====

session:  Number of session:  1 through 8       {txt}Number of Observations
{hline 41}   {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #       #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #       #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     8                      4299
   (8 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}session {c |}{res}      4299    4.493371    2.269354          1          8
@mean     4.493
@sd     2.269
@min     1.000
@max     8.000
@values 1, 2, 3, 4, 5, 6, 7, 8
@names "1", "2", "3", "4", "5", "6", "7", "8"
@freq 522, 522, 576, 540, 537, 558, 522, 522
@type float
@label Number of session:  1 through 8
@class category
@N_unique 8
@N 4299
 
_@NOTES

session:
{txt}{p 2 6}
1.
"Number of session:  1 through 8"
{p_end}
{res} 
=====subjectid=====

subjectid:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#       #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #       #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}101                 832                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}subjectid {c |}{res}      4299    475.5611    224.0486        101        832
@mean   475.561
@sd   224.049
@min   101.000
@max   832.000
@example0 714
@histh .00309301, .00206201, .0008248, .0004124, .00288681, .00226821, .0004124, .0008248, .00247441, .00288681, .0004124, .001031, .00391781, .0012372, .00140904, .00391781, .0008248, .00350541, .00288681, .00185581, .00371161, .0004124, .00226821, .00371161
@histw 111.15278, 151.76389, 172.06944, 192.375, 212.68056, 253.29167, 273.59723, 293.90277, 314.20834, 354.81946, 375.125, 395.43054, 415.73611, 436.04166, 496.95834, 517.26392, 537.56946, 639.09723, 659.40277, 700.01392, 720.31946, 740.625, 801.54169, 821.84723
@type float
@label 
@class other
@N_unique .
@N 4299
 
_@NOTES
 
=====raceid=====

raceid:  Race identifier, unique across all     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#       #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #       #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}10101             83206                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}raceid {c |}{res}      4299     47559.6    22404.86      10101      83206
@mean 47559.604
@sd 22404.859
@min 10101.000
@max 83206.000
@example0 71406
@histh .00003093, .00002062, 8.247e-06, 4.124e-06, .00002887, .00002268, 4.124e-06, 8.247e-06, .00002474, .00002887, 4.124e-06, .00001031, .00003918, .00001237, .00001409, .00003918, 8.247e-06, .00003505, .00002887, .00001856, .00003711, 4.124e-06, .00002268, .00003711
@histw 11116.348, 15177.736, 17208.43, 19239.125, 21269.82, 25331.209, 27361.902, 29392.598, 31423.291, 35484.68, 37515.375, 39546.07, 41576.766, 43607.457, 49699.543, 51730.234, 53760.93, 63914.402, 65945.094, 70006.484, 72037.18, 74067.875, 80159.961, 82190.656
@type float
@label Race identifier, unique across all sessions
@class other
@N_unique .
@N 4299
 
_@NOTES

raceid:
{txt}{p 2 6}
1.
"Race identifier, unique across all sessions"
{p_end}
{res} 
=====pitstopnum=====

pitstopnum:  Number of current pitstop (1,      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#   #   #                 {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     3                      4299
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}pitstopnum {c |}{res}      4299           2    .8165916          1          3
@mean     2.000
@sd     0.817
@min     1.000
@max     3.000
@values 1, 2, 3
@names "1", "2", "3"
@freq 1433, 1433, 1433
@type float
@label Number of current pitstop (1, 2, or 3)
@class category
@N_unique 3
@N 4299
 
_@NOTES

pitstopnum:
{txt}{p 2 6}
1.
"Number of current pitstop (1, 2, or 3)"
{p_end}
{res} 
=====pitstopid=====

pitstopid:  Pitstop identifier, unique acro     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#       #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #       #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1010101         8320603                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}pitstopid {c |}{res}      4299     4755962     2240486    1010101    8320603
@mean  4.76e+06
@sd  2.24e+06
@min  1.01e+06
@max  8.32e+06
@example0 7140601
@histh 3.093e-07, 2.062e-07, 8.247e-08, 4.124e-08, 2.887e-07, 2.268e-07, 4.124e-08, 8.247e-08, 2.474e-07, 2.887e-07, 4.124e-08, 1.031e-07, 3.918e-07, 1.237e-07, 1.409e-07, 3.918e-07, 8.247e-08, 3.505e-07, 2.887e-07, 1.856e-07, 3.711e-07, 4.124e-08, 2.268e-07, 3.711e-07
@histw 1111635.8, 1517774.8, 1720844.3, 1923913.8, 2126983.3, 2533122.3, 2736191.8, 2939261.3, 3142330.8, 3548469.8, 3751539.3, 3954608.8, 4157678.3, 4360748, 4969956, 5173026, 5376095, 6391443, 6594512, 7000651, 7203721, 7406790, 8015999, 8219068
@type float
@label Pitstop identifier, unique across all sessions
@class other
@N_unique .
@N 4299
 
_@NOTES

pitstopid:
{txt}{p 2 6}
1.
"Pitstop identifier, unique across all sessions"
{p_end}
{res} 
=====failrate=====

failrate:  Chosen engine-failure rate of ca     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero           {res}    3         3          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 3990         3       3987
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 3993         6       3987
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing        {res}  306
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0              4.000811                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}failrate {c |}{res}      3993    1.239034    .9053965          0   4.000811
@mean     1.239
@sd     0.905
@min     0.000
@max     4.001
@example0 .
@histh .0540837, .22985575, .46647197, .58816028, .69632769, .39886734, .63548356, .67604631, .77069283, .60168123, .45971149, .38534641, .28393945, .52055568, .27041852, .29069993, .23661621, .2568976, .18929297, .04732324, .06084417, .04732324, .01352093, .0540837, .04056278, .04732324, .04732324, .04056278, .04056278, .02028139, .00676046, .03380232, .03380232, .04056278, .41238827
@histw .05556681, .16670044, .27783406, .38896769, .50010133, .61123496, .7223686, .83350223, .94463587, 1.0557694, 1.1669031, 1.2780367, 1.3891704, 1.500304, 1.6114376, 1.7225713, 1.8337048, 1.9448385, 2.0559721, 2.1671057, 2.2782395, 2.3893731, 2.5005066, 2.6116402, 2.7227738, 2.8339076, 2.9450412, 3.0561748, 3.1673083, 3.2784421, 3.3895757, 3.5007093, 3.7229764, 3.8341103, 3.9452438
@type float
@label Chosen engine-failure rate of car (expected number of times per 5 laps)
@class other
@N_unique .
@N 3993
 
_@NOTES

failrate:
{txt}{p 2 6}
1.
"Chosen engine-failure rate of car (expected number of times per 5 laps)"
{p_end}
{res} 
=====risk=====

risk:  Risk aversion as measured by lottery     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Zero           {res}  126       126          -
{txt}{c |}          {res}#   #             {txt}Positive       {res} 3831      3831          -
{txt}{c |}          {res}#   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 3957      3957          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing        {res}  342
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     9                      4299
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}risk {c |}{res}      3957    5.589841     1.85327          0          9
@mean     5.590
@sd     1.853
@min     0.000
@max     9.000
@values 0, 1, 2, 3, 4, 5, 6, 7, 8, 9
@names "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"
@freq 126, 54, 18, 180, 360, 1242, 738, 663, 414, 162
@type float
@label Risk aversion as measured by lottery: 0=Least risk averse, 9=Most risk averse
@class category
@N_unique 10
@N 3957
 
_@NOTES

risk:
{txt}{p 2 6}
1.
"Risk aversion as measured by lottery: 0=Least risk averse, 9=Most risk averse"
{p_end}
{res} 
=====dropout_dummy=====

dropout_dummy:  1 if participant dropped ou     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     2                      4299
   (2 unique values)

      {txt}dropout_dummy is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
dropout_du~y {c |}{res}      4299    1.146313    .3534609          1          2
@mean     1.146
@sd     0.353
@min         1
@max         2
@values 1, 2
@names "false", "true"
@freq 3670, 629
@type long
@label 1 if participant dropped out, 0 otherwise
@class dummy
@N_unique 2
@N 4299
 
_@NOTES

dropout_dummy:
{txt}{p 2 6}
1.
"1 if participant dropped out, 0 otherwise"
{p_end}
{res} 
=====BMI=====

BMI:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 4230         -       4230
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 4230         -       4230
{txt}{c |}  {res}.   #   .   .   .         {txt}Missing        {res}   69
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0001702       .0061728                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}BMI {c |}{res}      4230    .0022566    .0005483   .0001702   .0061728
@mean     0.002
@sd     0.001
@min     0.000
@max     0.006
@example0 .00308642
@histh 25.520708, 25.520708, 51.041416, 459.37274, 1250.5146, 1250.5146, 944.26617, 969.78687, 357.28992, 204.16566, 127.60354, 102.08283, 51.041416, 25.520708, 25.520708, 25.520708, 51.041416, 25.520708, 25.520708
@histw .00025357, .00125401, .00158749, .00175423, .00192097, .00208771, .00225445, .00242119, .00258793, .00275467, .00292141, .00308815, .00325489, .00342163, .00375511, .00392185, .00458881, .00508903, .00608947
@type float
@label 
@class other
@N_unique .
@N 4230
 
_@NOTES
 
=====sessiontype=====
@freq 1044, 1095, 1098, 1062
@values "baseline", "high-stakes", "low-stakes", "wealth"
@type str11
@label Type (treatment) of session:  baseline, high-stakes, wealth, low-stakes
@class category
@N_unique 4
@N 4299
 
_@NOTES

sessiontype:
{txt}{p 2 6}
1.
"Type (treatment) of session:  baseline, high-stakes, wealth, low-stakes"
{p_end}
{res} 
=====sessiondate=====
@freq 522, 522, 558, 522, 522, 576, 540, 537
@values "Friday AM", "Monday AM", "Thursday AM", "Thursday PM", "Tuesday AM", "Tuesday PM", "Wednesday AM", "Wednesday PM"
@type str12
@label Date and time of session (week of August 30 through Sept 3 2010)
@class category
@N_unique 8
@N 4299
 
_@NOTES

sessiondate:
{txt}{p 2 6}
1.
"Date and time of session (week of August 30 through Sept 3 2010)"
{p_end}
{res} 
=====showupfee=====

showupfee:  Value of show-up fee, in dollar     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5                    20                      4299
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}showupfee {c |}{res}      4299    8.705513    6.470055          5         20
@mean     8.706
@sd     6.470
@min     5.000
@max    20.000
@values 5, 20
@names "5", "20"
@freq 3237, 1062
@type float
@label Value of show-up fee, in dollars
@class dummy
@N_unique 2
@N 4299
 
_@NOTES

showupfee:
{txt}{p 2 6}
1.
"Value of show-up fee, in dollars"
{p_end}
{res} 
=====self_esteem_composite=====

self_esteem_composite:  Degree of self-este     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4299       414       3885
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4299       414       3885
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2.4                 8.6                      4299
  (47 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
self_estee~e {c |}{res}      4299    4.691137    1.140705        2.4        8.6
@mean     4.691
@sd     1.141
@min     2.400
@max     8.600
@example0 5.9000001
@histh .14587037, .09724692, .07293519, .07293519, .19449383, .24311729, .31605247, .07293519, .34036422, .36467594, .29174075, .38898766, .41329941, .26742902, .17018211, .36467594, .29174075, .31200051, .29174075, .17018211, .24311729, .07293519, .12155864, .19449383, .17018211, .02431173, .02431173, .02431173, .02431173, .02431173
@histw 2.4861112, 2.6583335, 2.8305557, 3.0027778, 3.1750002, 3.3472223, 3.5194447, 3.6916668, 3.863889, 4.0361114, 4.2083335, 4.3805556, 4.5527778, 4.7250004, 4.8972225, 5.0694447, 5.2416668, 5.4138889, 5.5861115, 5.7583337, 5.9305558, 6.102778, 6.2750001, 6.4472227, 6.6194448, 7.3083339, 7.480556, 7.8250003, 8.169445, 8.5138893
@type float
@label Degree of self-esteem:  1=least to 11=most
@class other
@N_unique 47
@N 4299
 
_@NOTES

self_esteem_composite:
{txt}{p 2 6}
1.
"Degree of self-esteem:  1=least to 11=most"
{p_end}
{res} 
=====locus_of_control_composite=====

locus_of_control_composite:  Locus of contr     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Positive       {res} 4299       630       3669
{txt}{c |}      {res}#   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #   #         {txt}Total          {res} 4299       630       3669
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3              10.71429                      4299
  (49 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
locus_of_c~e {c |}{res}      4299    7.525371    1.756328          3   10.71429
@mean     7.525
@sd     1.756
@min     3.000
@max    10.714
@example0 6.4285712
@histh .01953943, .01953943, .03907885, .05861828, .03907885, .07815771, .15631542, .09769714, .11723656, .15631542, .15631542, .05861828, .15631542, .25401255, .09769714, .03582228, .27355197, .35170969, .03907885, .11723656, .25401255, .19539428, .23447312, .29309142, .09769714, .29309142, .05861828, .11723656, .23447312, .11723656, .15631542, .09769714, .05861828, .13677599
@histw 3.1071429, 3.3214285, 3.75, 4.1785712, 4.3928571, 4.6071429, 4.8214288, 5.0357141, 5.25, 5.4642859, 5.6785717, 5.8928571, 6.1071429, 6.3214288, 6.5357141, 6.75, 6.9642859, 7.1785717, 7.3928571, 7.6071429, 7.8214288, 8.0357141, 8.25, 8.4642859, 8.6785717, 8.8928576, 9.1071434, 9.3214283, 9.5357141, 9.75, 9.9642859, 10.178572, 10.392858, 10.607143
@type float
@label Locus of control: 1=most internal to 11=most external
@class other
@N_unique 49
@N 4299
 
_@NOTES

locus_of_control_composite:
{txt}{p 2 6}
1.
"Locus of control: 1=most internal to 11=most external"
{p_end}
{res} 
=====SBI_anticipate=====

SBI_anticipate:  Degree of ability to obtai     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4299       666       3633
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299       666       3633
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1.5                8.25                      4299
  (45 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
SBI_antici~e {c |}{res}      4299    4.394191    1.335861        1.5       8.25
@mean     4.394
@sd     1.336
@min     1.500
@max     8.250
@example0 6
@histh .15631542, .02233077, .06699232, .02233077, .17864619, .04466155, .20097697, .11165387, .17864619, .13398464, .35729238, .17864619, .31263083, .22330774, .35729238, .22330774, .30890906, .26796928, .31263083, .06699232, .22330774, .11165387, .42428473, .26796928, .26796928, .11165387, .02233077, .04466155, .02233077, .02233077, .02233077, .02233077, .02233077, .02233077
@histw 1.59375, 1.78125, 1.96875, 2.15625, 2.34375, 2.53125, 2.71875, 2.90625, 3.09375, 3.28125, 3.46875, 3.65625, 3.84375, 4.03125, 4.21875, 4.40625, 4.59375, 4.78125, 4.96875, 5.15625, 5.34375, 5.53125, 5.71875, 5.90625, 6.09375, 6.28125, 6.46875, 6.84375, 7.21875, 7.40625, 7.59375, 7.78125, 7.96875, 8.15625
@type float
@label Degree of ability to obtain pleasure from anticipation: 1=least to 11=most
@class other
@N_unique 45
@N 4299
 
_@NOTES

SBI_anticipate:
{txt}{p 2 6}
1.
"Degree of ability to obtain pleasure from anticipation: 1=least to 11=most"
{p_end}
{res} 
=====SBI_moment=====

SBI_moment:  Degree of ability to obtain pl     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4299       612       3687
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4299       612       3687
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1.5                9.25                      4299
  (49 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}SBI_moment {c |}{res}      4299    4.628053    1.343359        1.5       9.25
@mean     4.628
@sd     1.343
@min     1.500
@max     9.250
@example0 6
@histh .05834815, .01944938, .03889877, .03889877, .11669631, .11669631, .25284201, .11669631, .09724692, .25284201, .23339261, .35008892, .33063954, .21394323, .25284201, .33063954, .25284201, .07779754, .27229139, .25284201, .27229139, .09724692, .19125228, .09724692, .15559508, .05834815, .03889877, .01944938, .01944938, .01944938
@histw 1.6076388, 1.8229166, 2.0381944, 2.2534723, 2.46875, 2.6840277, 2.8993056, 3.1145833, 3.3298612, 3.5451388, 3.7604167, 3.9756944, 4.1909723, 4.40625, 4.6215277, 4.8368053, 5.0520835, 5.2673612, 5.4826388, 5.6979165, 5.9131947, 6.1284723, 6.34375, 6.5590277, 6.7743053, 7.2048612, 7.4201388, 7.6354165, 7.8506947, 9.1423607
@type float
@label Degree of ability to obtain pleasure from the present: 1=least to 11=most
@class other
@N_unique 49
@N 4299
 
_@NOTES

SBI_moment:
{txt}{p 2 6}
1.
"Degree of ability to obtain pleasure from the present: 1=least to 11=most"
{p_end}
{res} 
=====SBI_reminisce=====

SBI_reminisce:  Degree of ability to obtain     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4299       540       3759
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299       540       3759
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1.5                 8.5                      4299
  (47 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
SBI_remini~e {c |}{res}      4299     4.22261    1.379223        1.5        8.5
@mean     4.223
@sd     1.379
@min     1.500
@max     8.500
@example0 6
@histh .06459974, .04306649, .12919948, .10766623, .08613299, .2799322, .10766623, .30146545, .17226598, .19379923, .53833115, .15073273, .30146545, .2799322, .30146545, .16867711, .3229987, .17226598, .19379923, .19379923, .10766623, .19379923, .15073273, .12919948, .15073273, .04306649, .04306649, .02153325, .02153325, .08613299, .04306649, .02153325, .02153325
@histw 1.5972222, 1.7916666, 1.9861112, 2.1805556, 2.375, 2.5694444, 2.7638888, 2.9583333, 3.1527777, 3.3472223, 3.5416667, 3.7361112, 3.9305556, 4.125, 4.3194447, 4.5138888, 4.7083335, 4.9027777, 5.0972223, 5.2916665, 5.4861112, 5.6805553, 5.875, 6.0694447, 6.2638888, 6.4583335, 6.6527777, 6.8472223, 7.0416665, 7.4305553, 7.8194447, 8.208333, 8.4027777
@type float
@label Degree of ability to obtain pleasure from memories: 1=least to 11=most
@class other
@N_unique 47
@N 4299
 
_@NOTES

SBI_reminisce:
{txt}{p 2 6}
1.
"Degree of ability to obtain pleasure from memories: 1=least to 11=most"
{p_end}
{res} 
=====SBI_total=====

SBI_total:  Degree of ability to obtain ple     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4299       180       4119
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 4299       180       4119
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1.5            7.666667                      4299
  (96 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}SBI_total {c |}{res}      4299    4.414951    1.167148        1.5   7.666667
@mean     4.415
@sd     1.167
@min     1.500
@max     7.667
@example0 6
@histh .02444315, .02444315, .04888629, .12221573, .02444315, .02444315, .04888629, .12221573, .19554517, .31776088, .26887462, .31776088, .21998832, .12221573, .39109033, .41553348, .24443145, .34220403, .39109033, .17110202, .21998832, .31368703, .14665887, .21998832, .29331774, .21998832, .21998832, .17110202, .04888629, .04888629, .02444315, .02444315, .04888629
@histw 1.5856482, 1.7569444, 1.9282408, 2.0995371, 2.2708333, 2.4421296, 2.613426, 2.7847221, 2.9560184, 3.1273148, 3.2986112, 3.4699073, 3.6412036, 3.8125, 3.9837961, 4.1550927, 4.3263888, 4.497685, 4.6689816, 4.8402777, 5.0115738, 5.1828704, 5.3541665, 5.5254626, 5.6967592, 5.8680553, 6.0393519, 6.2106481, 6.3819442, 6.5532408, 6.895833, 7.2384257, 7.5810184
@type float
@label Degree of ability to obtain pleasure in aggregate: 1=least to 11=most
@class other
@N_unique 96
@N 4299
 
_@NOTES

SBI_total:
{txt}{p 2 6}
1.
"Degree of ability to obtain pleasure in aggregate: 1=least to 11=most"
{p_end}
{res} 
=====seed=====
@example0 -1003954801
@type str11
@label 
@class string
@N_unique 1433
@N 4299
 
_@NOTES
 
=====lap=====

lap:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#   #   #                 {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3                     9                      4299
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}lap {c |}{res}      4299           6    2.449775          3          9
@mean     6.000
@sd     2.450
@min         3
@max         9
@values 3, 6, 9
@names "3", "6", "9"
@freq 1433, 1433, 1433
@type byte
@label 
@class category
@N_unique 3
@N 4299
 
_@NOTES
 
=====seedold=====

seedold:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative       {res} 2211      2211          -
{txt}{c |}  {res}#               #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res} 2088      2088          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}-2.14e+09      2.15e+09                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}seedold {c |}{res}      4299   -3.40e+07    1.30e+09  -2.14e+09   2.15e+09
@mean -3.40e+07
@sd  1.30e+09
@min -2.14e+09
@max  2.15e+09
@example0 -1.004e+09
@histh 2.109e-10, 2.460e-10, 3.866e-10, 1.406e-10, 3.163e-10, 2.811e-10, 4.217e-10, 2.811e-10, 2.109e-10, 3.456e-10, 1.406e-10, 2.109e-10, 1.054e-10, 1.054e-10, 3.163e-10, 1.757e-10, 2.811e-10, 1.406e-10, 1.757e-10, 2.109e-10, 2.109e-10, 1.757e-10, 2.460e-10, 1.406e-10, 2.460e-10, 2.109e-10, 1.757e-10, 2.460e-10, 1.757e-10, 3.163e-10, 2.460e-10, 3.514e-10, 1.054e-10, 1.406e-10, 3.514e-10, 3.514e-10
@histw -2.084e+09, -1.965e+09, -1.846e+09, -1.727e+09, -1.608e+09, -1.489e+09, -1.370e+09, -1.250e+09, -1.131e+09, -1.012e+09, -8.929e+08, -7.738e+08, -6.546e+08, -5.355e+08, -4.163e+08, -2.972e+08, -1.780e+08, -58895236, 60251656, 1.794e+08, 2.985e+08, 4.177e+08, 5.368e+08, 6.560e+08, 7.751e+08, 8.943e+08, 1.013e+09, 1.133e+09, 1.252e+09, 1.371e+09, 1.490e+09, 1.609e+09, 1.728e+09, 1.847e+09, 1.967e+09, 2.086e+09
@type long
@label 
@class other
@N_unique .
@N 4299
 
_@NOTES
 
=====from=====

from:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#   #   #                 {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2406               7218                      4299
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}from {c |}{res}      4299        4812    1964.719       2406       7218
@mean  4812.000
@sd  1964.719
@min      2406
@max      7218
@values 2406, 4812, 7218
@names "2406", "4812", "7218"
@freq 1433, 1433, 1433
@type int
@label 
@class category
@N_unique 3
@N 4299
 
_@NOTES
 
=====testwinner=====

testwinner:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4299      4299          -
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     5                      4299
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}testwinner {c |}{res}      4299    2.935101    1.177074          1          5
@mean     2.935
@sd     1.177
@min         1
@max         5
@values 1, 2, 3, 4, 5
@names "1", "2", "3", "4", "5"
@freq 642, 675, 1827, 630, 525
@type byte
@label 
@class category
@N_unique 5
@N 4299
 
_@NOTES
 
=====dst1=====

dst1:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#       #       #         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #       #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #       #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#       #       #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#       #       #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   .   #   .   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}119356           360984                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}dst1 {c |}{res}      4299    240210.1    98136.77     119356     360984
@mean  2.40e+05
@sd 98136.771
@min    119356
@max    360984
@example0 120071
@histh .00004966, .00001865, .00003102, .00004966
@histw 122711.95, 236814.06, 243525.94, 357628.06
@type long
@label 
@class other
@N_unique .
@N 4299
 
_@NOTES
 
=====dst2=====

dst2:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#       #       #         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #       #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #       #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#       #       #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#       #       #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   .   #   .   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}119515           360935                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}dst2 {c |}{res}      4299      240212    98138.56     119515     360935
@mean  2.40e+05
@sd 98138.560
@min    119515
@max    360935
@example0 120177
@histh .00004971, .00002477, .00002494, .00004971
@histw 122868.05, 236871.94, 243578.06, 357581.94
@type long
@label 
@class other
@N_unique .
@N 4299
 
_@NOTES
 
=====dst3=====

dst3:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#       #       #         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #       #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #       #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#       #       #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#       #       #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   .   #   .   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}119502           361049                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}dst3 {c |}{res}      4299    240288.4    98172.42     119502     361049
@mean  2.40e+05
@sd 98172.421
@min    119502
@max    361049
@example0 119930
@histh .00004968, .00001917, .00003051, .00004968
@histw 122856.82, 236920.69, 243630.31, 357694.19
@type long
@label 
@class other
@N_unique .
@N 4299
 
_@NOTES
 
=====dst4=====

dst4:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#       #       #         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #       #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #       #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#       #       #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#       #       #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   .   #   .   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}119488           360989                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}dst4 {c |}{res}      4299    240215.2    98140.08     119488     360989
@mean  2.40e+05
@sd 98140.078
@min    119488
@max    360989
@example0 120178
@histh .00004969, .00002653, .00002316, .00004969
@histw 122842.18, 236884.31, 243592.69, 357634.81
@type long
@label 
@class other
@N_unique .
@N 4299
 
_@NOTES
 
=====dst5=====

dst5:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#       #       #         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #       #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #       #         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#       #       #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#       #       #         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#   .   #   .   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}119462           360964                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}dst5 {c |}{res}      4299    240200.3    98135.82     119462     360964
@mean  2.40e+05
@sd 98135.817
@min    119462
@max    360964
@example0 120087
@histh .00004969, .00002538, .00002431, .00004969
@histw 122816.2, 236858.81, 243567.19, 357609.81
@type long
@label 
@class other
@N_unique .
@N 4299
 
_@NOTES
 
=====winpc=====

winpc:  (mean) winpc                            {txt}Number of Observations
{hline 20}                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  382       382          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 3917        92       3825
{txt}{c |}  {res}#               #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4299       474       3825
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}winpc {c |}{res}      4299    .4333554    .3496625          0          1
@mean     0.433
@sd     0.350
@min     0.000
@max     1.000
@example0 .00433333
@histh 7.1514306, 1.1304954, .93789256, .88764828, .90439636, .82902998, .84577811, .69504535, .76203769, .79553384, .59455687, .72016746, .56943476, .66992325, .82065594, .67829728, .72854149, .72016746, .6029309, .7871598, .69504535, .6364271, .70341939, .87927425, .68667132, .75366366, .77041173, .79553384, .69504535, .82902998, .76203769, .62805301, .74528962, .61967897, .98813677, 2.9811585
@histw .01388889, .04166667, .06944445, .09722222, .125, .15277778, .18055555, .20833333, .2361111, .2638889, .29166666, .31944445, .34722221, .375, .40277779, .43055555, .45833334, .4861111, .5138889, .54166669, .56944442, .59722221, .625, .65277779, .68055558, .70833331, .7361111, .7638889, .79166669, .81944442, .84722221, .875, .90277779, .93055558, .95833331, .9861111
@type float
@label (mean) winpc
@class other
@N_unique .
@N 4299
 
_@NOTES
 
=====repeat=====

repeat:  (mean) repeat                          {txt}Number of Observations
{hline 22}                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4299      4299          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4299      4299          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}100                                          4299
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}repeat {c |}{res}      4299         100           0        100        100
@mean   100.000
@sd     0.000
@min   100.000
@max   100.000
@values 100
@type float
@label (mean) repeat
@class constant
@N_unique 1
@N 4299
 
_@NOTES
 
=====sdwin=====

sdwin:  (sd) winpc                              {txt}Number of Observations
{hline 18}                          {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #   #             {txt}Zero           {res}  474       474          -
{txt}{c |}  {res}#       #   #             {txt}Positive       {res} 3825         -       3825
{txt}{c |}  {res}#       #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4299       474       3825
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                .06915                      4299
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sdwin {c |}{res}      4299    .0299721    .0184003          0     .06915
@mean     0.030
@sd     0.018
@min     0.000
@max     0.069
@example0 .00773854
@histh 66.241501, 13.805358, 13.07876, 10.414568, 11.262265, 9.0824718, 9.8090696, 8.2347746, 10.172369, 9.2035723, 9.4457712, 9.6879702, 10.172369, 8.4769745, 12.231063, 14.531956, 14.168656, 17.559446, 20.586937, 23.372229, 23.735527, 25.188723, 26.763018, 28.821712, 22.766731, 25.188723, 20.465837, 16.590649, 9.0824718, 8.598074, 4.965085, 3.7540886, 1.5742952, .84769744, .48439851, .24219926
@histw .00096042, .00288125, .00480208, .00672292, .00864375, .01056458, .01248542, .01440625, .01632708, .01824792, .02016875, .02208959, .02401042, .02593125, .02785209, .02977292, .03169375, .03361459, .03553542, .03745626, .03937709, .04129792, .04321875, .04513959, .04706042, .04898126, .05090209, .05282292, .05474376, .05666459, .05858542, .06050626, .06242709, .06434792, .06626876, .06818959
@type float
@label (sd) winpc
@class other
@N_unique .
@N 4299
 
_@NOTES
 
{com}. 
. // noi profiler report
. // profiler off
. {c )-}
{txt}
{com}. 
. exit, clear STATA
