{smcl}
{txt}{sf}{ul off}

{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. cap noi {c -(}
. 
. use  "/Users/schaffne/Dropbox/EXPERIMENTS/OET/oet_Oct2013.dta"
. 
. describe, short

{txt}Contains data from {res}/Users/schaffne/Dropbox/EXPERIMENTS/OET/oet_Oct2013.dta
{txt}  obs:{res}         4,194                          
{txt} vars:{res}           195                          7 Oct 2013 10:54
{txt} size:{res}     2,717,712                          
{txt}Sorted by:  {res}subjectid  pitstopid
{com}. 
. local N = r(N)
. local variables = r(k)
. 
. di "@N `N'"
{res}@N 4194
{com}. di "@variables `variables'"
{res}@variables 195
{com}. 
. datasignature
  {res}4194:195(67511):3859143343:1496924803
{com}. local datasig = "`r(datasignature)'"
. 
. di "@datasignature `datasig'"
{res}@datasignature 4194:195(67511):3859143343:1496924803
{com}. 
. cap noi xtset
{err}n ambiguous abbreviation
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
.     di "@panelvar `r(panelvar)'"
. {c )-}
. 
. notes _dta
{res}{com}. 
. qui {c -(}
. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====id=====

{res}id:  timestamp (in ms since 1.1.1970)           {txt}Number of Observations
{hline 37}       {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #   #             {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #   #             {txt}Positive       {res} 4194         -       4194
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194         -       4194
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1.28e+12       1.28e+12                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 10}id {c |}{res}      4194    1.28e+12    1.05e+08   1.28e+12   1.28e+12
@mean  1.28e+12
@sd  1.05e+08
@min  1.28e+12
@max  1.28e+12
@example0 1.283e+12
@histh 1.282e-08, 6.629e-10, 1.171e-08, 1.414e-08, 8.936e-09, 4.321e-09, 1.282e-08, 1.144e-08, 1.817e-09, 1.193e-08, 1.237e-08
@histw 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12, 1.283e+12
@type double
@label timestamp (in ms since 1.1.1970)
@class other
@N_unique .
@N 4194
 
_@NOTES

id:
{txt}{p 2 6}
1.
"timestamp (in ms since 1.1.1970)"
{p_end}
{res} 
=====finalpayout=====

finalpayout:  Payout of this race (which ma     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  576       576          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 3600       198       3402
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4176       774       3402
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing        {res}   18
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 100.2                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}finalpayout {c |}{res}      4176    15.00295    20.06619          0      100.2
@mean    15.003
@sd    20.066
@min     0.000
@max   100.200
@example0 30.1
@histh .13008466, .03097254, .02787529, .03406979, .01238902, .0170349, .01238902, .00929176, .00774313, .00619451, .01393764, .00619451, .00309725, .00774313, .00464588, .00464588, .00309725, .00309725, .00154863, .00309725, .00154863, .00309725, .00154863, .00154863, .00154863, .00464588, .00154863, .00464588
@histw 1.3916667, 4.1749997, 6.958333, 9.7416668, 12.525, 15.308332, 18.091665, 20.875, 23.658333, 26.441666, 29.224998, 32.008331, 34.791664, 37.574997, 40.358334, 43.141666, 45.924999, 48.708332, 51.491665, 54.274998, 57.058331, 59.841663, 62.625, 65.408333, 70.974998, 79.324997, 82.10833, 98.808327
@type float
@label Payout of this race (which may or may not have been selected to be paid out)
@class other
@N_unique .
@N 4176
 
_@NOTES

finalpayout:
{txt}{p 2 6}
1.
"Payout of this race (which may or may not have been selected to be paid out)"
{p_end}
{res} 
=====place=====

place:  Place of own car at the end of the      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     5                      4194
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}place {c |}{res}      4194    2.256795    1.401885          1          5
@mean     2.257
@sd     1.402
@min         1
@max         5
@values 1, 2, 3, 4, 5
@names "1", "2", "3", "4", "5"
@freq 1797, 960, 486, 465, 486
@type byte
@label Place of own car at the end of the race
@class category
@N_unique 5
@N 4194
 
_@NOTES

place:
{txt}{p 2 6}
1.
"Place of own car at the end of the race"
{p_end}
{res} 
=====winner=====

winner:  Which car won the race? 1 through      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4194      4194          -
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     5                      4194
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}winner {c |}{res}      4194    2.938484    1.171663          1          5
@mean     2.938
@sd     1.172
@min         1
@max         5
@values 1, 2, 3, 4, 5
@names "1", "2", "3", "4", "5"
@freq 615, 660, 1797, 612, 510
@type byte
@label Which car won the race? 1 through 5
@class category
@N_unique 5
@N 4194
 
_@NOTES

winner:
{txt}{p 2 6}
1.
"Which car won the race? 1 through 5"
{p_end}
{res} 
=====totalprpayout=====

totalprpayout:  Guess the winner                {txt}Number of Observations
{hline 32}            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2214      2214          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1980         -       1980
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      2214       1980
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                3.5482                      4194
  (73 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
totalprpay~t {c |}{res}      4194    .5806536    .7856878          0     3.5482
@mean     0.581
@sd     0.786
@min     0.000
@max     3.548
@example0 0
@histh 5.3560376, .26127014, .08709004, .34836015, .04354502, .08709004, .17418008, .17418008, .30481514, .4354502, .6967203, .08709004, .13063507, .13063507, .13063507, .2177251, .04354502, .08709004, .17418008, .26127014, .47899523, .13063507, .04354502, .04354502, .04354502, .13063507, .04354502
@histw .04928055, .14784166, .24640277, .34496388, .44352499, .54208612, .64064717, .73920834, .83776939, .93633056, 1.0348916, 1.1334528, 1.2320138, 1.330575, 1.429136, 1.5276972, 1.6262583, 1.7248194, 1.8233805, 1.9219416, 2.0205028, 2.1190639, 2.2176249, 2.6118693, 2.9075527, 3.0061138, 3.4989192
@type float
@label Guess the winner
@class other
@N_unique 73
@N 4194
 
_@NOTES

totalprpayout:
{txt}{p 2 6}
1.
"Payout for guess-the-winner responses"
{p_end}
{res} 
=====bet=====

bet:  Amount wagered                            {txt}Number of Observations
{hline 20}                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}    3         3          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4191       231       3960
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194       234       3960
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 39.29                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}bet {c |}{res}      4194    7.599907     5.94603          0      39.29
@mean     7.600
@sd     5.946
@min     0.000
@max    39.290
@example0 12.1
@histh .03211511, .06685185, .0950345, .08520334, .11666304, .10093319, .08127088, .0760276, .0504666, .04850037, .02949347, .025561, .0124528, .01048657, .00589869, .00458787, .01114198, .00720951, .00720951, .01179739, .00720951, .00458787, .00524328, .00196623, .01114198, .00131082, .00065541, .00065541, .00458787
@histw .54569447, 1.6370834, 2.7284722, 3.8198612, 4.9112501, 6.0026388, 7.094028, 8.1854172, 9.2768059, 10.368195, 11.459583, 12.550973, 13.642362, 14.73375, 15.825139, 16.916529, 18.007917, 19.099306, 20.190695, 21.282084, 22.373472, 23.464861, 24.556252, 25.64764, 26.739029, 32.195972, 33.287361, 37.652916, 38.744305
@type float
@label Amount wagered
@class other
@N_unique .
@N 4194
 
_@NOTES

bet:
{txt}{p 2 6}
1.
"Amount wagered in this race"
{p_end}
{res} 
=====raceexp01=====

raceexp01:  On the whole, I am satisfied wi     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#               #         {txt}Positive       {res} 4185      4185          -
{txt}{c |}  {res}#               #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#           #   #         {txt}Total          {res} 4185      4185          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}    9
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}raceexp01 {c |}{res}      4185    5.903226    3.639917          1         10
@mean     5.903
@sd     3.640
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 921, 369, 231, 180, 114, 159, 255, 366, 504, 1086
@type byte
@label On the whole, I am satisfied with the outcome of this race. (strongly disagree=1
@class category
@N_unique 10
@N 4185
 
_@NOTES

raceexp01:
{txt}{p 2 6}
1.
"On the whole, I am satisfied with the outcome of this race. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====raceexp02=====

raceexp02:  The race was exciting/interesti     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#           #   #         {txt}Positive       {res} 4173      4173          -
{txt}{c |}  {res}#           #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4173      4173          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}   21
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}raceexp02 {c |}{res}      4173    5.907261    3.249128          1         10
@mean     5.907
@sd     3.249
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 669, 339, 240, 273, 237, 270, 411, 498, 534, 702
@type byte
@label The race was exciting/interesting to watch. (strongly disagree=1 to strongly agr
@class category
@N_unique 10
@N 4173
 
_@NOTES

raceexp02:
{txt}{p 2 6}
1.
"The race was exciting/interesting to watch. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====raceexp03=====

raceexp03:  The race was exciting/interesti     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#           #   #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#           #   #         {txt}Positive       {res} 4167      4167          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4167      4167          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}   27
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}raceexp03 {c |}{res}      4167    5.645788    3.095425          1         10
@mean     5.646
@sd     3.095
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 624, 357, 306, 321, 285, 348, 396, 561, 477, 492
@type byte
@label The race was exciting/interesting in the first couple of rounds. (strongly disag
@class category
@N_unique 10
@N 4167
 
_@NOTES

raceexp03:
{txt}{p 2 6}
1.
"The race was exciting/interesting in the first couple of rounds. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====raceexp04=====

raceexp04:  The winner of the race was very     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4179      4179          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#       #   #   #         {txt}Total          {res} 4179      4179          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}   15
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}raceexp04 {c |}{res}      4179    6.740847    3.090944          1         10
@mean     6.741
@sd     3.091
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 366, 276, 234, 234, 285, 282, 336, 465, 585, 1116
@type byte
@label The winner of the race was very obvious for the last round. (strongly disagree=1
@class category
@N_unique 10
@N 4179
 
_@NOTES

raceexp04:
{txt}{p 2 6}
1.
"The winner of the race was very obvious for the last round. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====raceexp05=====

raceexp05:  I would change my decisions if      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#               #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#               #         {txt}Positive       {res} 4185      4185          -
{txt}{c |}  {res}#       #       #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4185      4185          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}    9
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}raceexp05 {c |}{res}      4185    5.346237    3.344658          1         10
@mean     5.346
@sd     3.345
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 876, 369, 327, 270, 297, 345, 285, 303, 405, 708
@type byte
@label I would change my decisions if I could. (strongly disagree=1 to strongly agree=1
@class category
@N_unique 10
@N 4185
 
_@NOTES

raceexp05:
{txt}{p 2 6}
1.
"I would change my decisions if I could. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====winvalue=====

winvalue:  Amount to be won                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}    3         3          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4191       351       3840
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194       354       3840
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                589.35                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}winvalue {c |}{res}      4194    43.34991     46.3604          0     589.35
@mean    43.350
@sd    46.360
@min     0.000
@max   589.350
@example0 60.5
@histh .01354515, .01813302, .01358884, .00554914, .00305858, .00196623, .00196623, .00091757, .00083019, .00030586, .00048063, .00008739, .00004369, .00013108, .00004369, .00004369, .00008739, .00008739, .00004369, .00008739, .00004369, .00004369
@histw 8.1854172, 24.556252, 40.927086, 57.29792, 73.668755, 90.039589, 106.41042, 122.78126, 139.1521, 155.52292, 188.26459, 204.63544, 237.37711, 253.74792, 270.11877, 302.86044, 319.23126, 335.60211, 368.34378, 401.08545, 499.31046, 581.16461
@type float
@label Amount to be won
@class other
@N_unique .
@N 4194
 
_@NOTES

winvalue:
{txt}{p 2 6}
1.
"Amount participant will win if his car wins"
{p_end}
{res} 
=====psconfidence=====

psconfidence:  How confident are you about      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero           {res}   16        16          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4177      4177          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4193      4193          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing        {res}    1
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                   100                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
psconfidence {c |}{res}      4193    70.64345    24.24279          0        100
@mean    70.643
@sd    24.243
@min         0
@max       100
@example0 95
@histh .00746959, .00291915, .00171715, .00317672, .00042929, .001202, .00077272, .00240401, .00051514, .00111615, .00480801, .00188886, .00223229, .00214643, .00755545, .00309087, .00566659, .00729788, .02944908, .0058383, .00515144, .02112092, .0040353, .00738373, .01236346, .02713093, .00592416, .01159075, .03477224, .01313618, .01064632, .00721202, .0320248, .01176246, .01648462, .04756499
@histw 1.3888888, 4.1666665, 6.9444447, 9.7222223, 12.5, 15.277778, 18.055555, 20.833334, 23.611111, 26.388889, 29.166666, 31.944445, 34.722221, 37.5, 40.277779, 43.055557, 45.833332, 48.611111, 51.388889, 54.166668, 56.944443, 59.722221, 62.5, 65.277779, 68.055557, 70.833336, 73.611115, 76.388885, 79.166664, 81.944443, 84.722221, 87.5, 90.277779, 93.055557, 95.833336, 98.611115
@type byte
@label How confident are you about your psexpectation?
@class other
@N_unique .
@N 4193
 
_@NOTES

psconfidence:
{txt}{p 2 6}
1.
"How confident are you about your psexpectation?"
{p_end}
{res} 
=====psexpectation=====

psexpectation:  Out of 1000 races, how like     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #   #   #         {txt}Zero           {res}  166       166          -
{txt}{c |}  {res}#       #   #   #         {txt}Positive       {res} 4028      4028          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  1000                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
psexpectat~n {c |}{res}      4194    521.1361    313.5534          0       1000
@mean   521.136
@sd   313.553
@min         0
@max      1000
@example0 892
@histh .0032103, .00084979, .00057511, .00142489, .0003691, .0004206, .00054077, .00127897, .00032618, .0004721, .00122747, .00056652, .00048069, .0003691, .00116738, .00035193, .00058369, .00162232, .00175107, .00066094, .00053219, .0019485, .00054936, .00067811, .00072961, .002, .00066094, .00075536, .00234335, .00070386, .00060086, .00055794, .00199142, .00056652, .00070386, .00242918
@histw 13.888889, 41.666668, 69.444443, 97.222221, 125, 152.77777, 180.55556, 208.33333, 236.11111, 263.88889, 291.66666, 319.44446, 347.22223, 375, 402.77777, 430.55554, 458.33334, 486.11111, 513.88892, 541.66669, 569.44446, 597.22223, 625, 652.77777, 680.55554, 708.33331, 736.11108, 763.88892, 791.66669, 819.44446, 847.22223, 875, 902.77777, 930.55554, 958.33331, 986.11108
@type int
@label Out of 1000 races, how likely would your car be to win from this pitstop onward?
@class other
@N_unique .
@N 4194
 
_@NOTES

psexpectation:
{txt}{p 2 6}
1.
"Out of 1000 races, how likely would your car be to win from this pitstop onward?"
{p_end}
{res} 
=====carcolor=====
@freq 1263, 663, 1443, 825
@values "blue", "magenta", "red", "yellow"
@type str7
@label Color of car
@class category
@N_unique 4
@N 4194
 
_@NOTES

carcolor:
{txt}{p 2 6}
1.
"Color of car"
{p_end}
{res} 
=====confidence=====

confidence:  How confident are you about yo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero           {res}   15        15          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4179      4179          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                   100                      4194
  (91 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}confidence {c |}{res}      4194     68.8784    22.88717          0        100
@mean    68.878
@sd    22.887
@min         0
@max       100
@example0 90
@histh .00618026, .00077253, .00154506, .00540773, .00025751, .00051502, .00206009, .00051502, .00257511, .00566524, .0023176, .00386266, .00154506, .00618026, .00309013, .00309013, .00824034, .04171674, .00515021, .00437768, .02214592, .00412017, .00978541, .01004292, .02858369, .00746781, .01364807, .03759656, .01313305, .01467811, .0072103, .03656652, .00901288, .01313305, .02781116
@histw 1.3888888, 4.1666665, 6.9444447, 9.7222223, 15.277778, 18.055555, 20.833334, 23.611111, 26.388889, 29.166666, 31.944445, 34.722221, 37.5, 40.277779, 43.055557, 45.833332, 48.611111, 51.388889, 54.166668, 56.944443, 59.722221, 62.5, 65.277779, 68.055557, 70.833336, 73.611115, 76.388885, 79.166664, 81.944443, 84.722221, 87.5, 90.277779, 93.055557, 95.833336, 98.611115
@type byte
@label How confident are you about your expectation?
@class other
@N_unique 91
@N 4194
 
_@NOTES

confidence:
{txt}{p 2 6}
1.
"How confident are you about your expectation?"
{p_end}
{res} 
=====dropoutlap=====

dropoutlap:  Lap after which participant dr     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  759       759          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res}  759       759          -
{txt}{c |}  {res}#   #   #                 {txt}Missing        {res} 3435
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3                     9                      4194
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}dropoutlap {c |}{res}       759    4.932806    2.446141          3          9
@mean     4.933
@sd     2.446
@min         3
@max         9
@values 3, 6, 9
@names "3", "6", "9"
@freq 435, 159, 165
@type byte
@label Lap after which participant dropped out (missing if did not drop out)
@class category
@N_unique 3
@N 759
 
_@NOTES

dropoutlap:
{txt}{p 2 6}
1.
"Lap after which participant dropped out (missing if did not drop out)"
{p_end}
{res} 
=====expectation=====

expectation:  Out of 1000 races, how likely     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero           {res}   78        78          -
{txt}{c |}          {res}#   #   #         {txt}Positive       {res} 4116      4116          -
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  1000                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}expectation {c |}{res}      4194    601.5651     275.599          0       1000
@mean   601.565
@sd   275.599
@min         0
@max      1000
@example0 863
@histh .00162232, .00036052, .00028326, .00092704, .00018026, .00028326, .00036052, .00118455, .00033476, .00030901, .00061803, .00046352, .00056652, .00033476, .00082403, .00025751, .00020601, .00200858, .00195708, .00043777, .00043777, .00265236, .00079828, .00059227, .00090129, .00257511, .00069528, .0013133, .00422318, .00100429, .00084979, .00087554, .00249785, .00036052, .00074678, .00195708
@histw 13.888889, 41.666668, 69.444443, 97.222221, 125, 152.77777, 180.55556, 208.33333, 236.11111, 263.88889, 291.66666, 319.44446, 347.22223, 375, 402.77777, 430.55554, 458.33334, 486.11111, 513.88892, 541.66669, 569.44446, 597.22223, 625, 652.77777, 680.55554, 708.33331, 736.11108, 763.88892, 791.66669, 819.44446, 847.22223, 875, 902.77777, 930.55554, 958.33331, 986.11108
@type int
@label Out of 1000 races, how likely would your car be to win (measured at start of rac
@class other
@N_unique .
@N 4194
 
_@NOTES

expectation:
{txt}{p 2 6}
1.
"Out of 1000 races, how likely would your car be to win (measured at start of race)?"
{p_end}
{res} 
=====racenum=====

racenum:  Race Number (1-6)                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     6                      4194
   (6 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}racenum {c |}{res}      4194         3.5    1.708029          1          6
@mean     3.500
@sd     1.708
@min         1
@max         6
@values 1, 2, 3, 4, 5, 6
@names "1", "2", "3", "4", "5", "6"
@freq 699, 699, 699, 699, 699, 699
@type byte
@label Race Number (1-6)
@class category
@N_unique 6
@N 4194
 
_@NOTES

racenum:
{txt}{p 2 6}
1.
"Race Number (1-6)"
{p_end}
{res} 
=====winvalue2=====

winvalue2:  Amount participant will win if      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}    3         3          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 3897       219       3678
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 3900       222       3678
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing        {res}  294
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 39.29                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}winvalue2 {c |}{res}      3900    7.305169    5.328931          0      39.29
@mean     7.305
@sd     5.329
@min     0.000
@max    39.290
@example0 12.1
@histh .02878008, .06920923, .09456311, .08839595, .12060223, .10895315, .06989447, .08017307, .05687491, .0376882, .02261292, .02535388, .01233432, .0068524, .00890812, .0068524, .00959336, .00548192, .00548192, .01096384, .00411144, .00479668, .00205572, .00479668, .00205572, .00068524, .00068524, .00068524, .00137048
@histw .56128573, 1.6838572, 2.8064287, 3.9290001, 5.0515714, 6.1741428, 7.2967143, 8.4192858, 9.5418577, 10.664429, 11.787001, 12.909572, 14.032144, 15.154715, 16.277287, 17.399858, 18.522429, 19.645, 20.767572, 21.890142, 23.012714, 24.135286, 25.257858, 26.380428, 27.503, 31.993286, 33.115856, 37.606144, 38.728714
@type float
@label Amount participant will win if his car comes in second place
@class other
@N_unique .
@N 3900
 
_@NOTES

winvalue2:
{txt}{p 2 6}
1.
"Amount participant will win if his car comes in second place"
{p_end}
{res} 
=====winvalue3=====

winvalue3:  Amount participant will win if      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}    3         3          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 3909       150       3759
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 3912       153       3759
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing        {res}  282
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                19.645                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}winvalue3 {c |}{res}      3912    3.654417    2.660976          0     19.645
@mean     3.654
@sd     2.661
@min     0.000
@max    19.645
@example0 6.0500002
@histh .05738359, .13799387, .18854608, .17624959, .24046455, .21860415, .13936014, .16122055, .11613345, .07514518, .04508711, .05055221, .02459297, .01366276, .01776159, .01366276, .01912786, .01093021, .01093021, .02186042, .00819765, .00956393, .00409883, .00956393, .00409883, .00136628, .00136628, .00136628, .00273255
@histw .28064287, .8419286, 1.4032143, 1.9645001, 2.5257857, 3.0870714, 3.6483572, 4.2096429, 4.7709289, 5.3322144, 5.8935003, 6.4547858, 7.0160718, 7.5773573, 8.1386433, 8.6999292, 9.2612143, 9.8225002, 10.383786, 10.945071, 11.506357, 12.067643, 12.628929, 13.190214, 13.7515, 15.996643, 16.557928, 18.803072, 19.364357
@type float
@label Amount participant will win if his car comes in third place
@class other
@N_unique .
@N 3912
 
_@NOTES

winvalue3:
{txt}{p 2 6}
1.
"Amount participant will win if his car comes in third place"
{p_end}
{res} 
=====bettingjust=====

bettingjust:  Betting is justified              {txt}Number of Observations
{hline 34}          {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4194      4194          -
{txt}{c |}          {res}#   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     5                      4194
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}bettingjust {c |}{res}      4194    3.004292    1.125335          1          5
@mean     3.004
@sd     1.125
@min         1
@max         5
@values 1, 2, 3, 4, 5
@names "1", "2", "3", "4", "5"
@freq 522, 702, 1584, 1008, 378
@type byte
@label Betting is justified
@class category
@N_unique 5
@N 4194
 
_@NOTES

bettingjust:
{txt}{p 2 6}
1.
"Betting is justified. 1 = strongly disagree to 5=strongly agree"
{p_end}
{res} 
=====financesat=====

financesat:  How satisfied are you with you     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Zero           {res}  252       252          -
{txt}{c |}          {res}#   #             {txt}Positive       {res} 3942      3942          -
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     9                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}financesat {c |}{res}      4194    4.879828     2.32816          0          9
@mean     4.880
@sd     2.328
@min         0
@max         9
@values 0, 1, 2, 3, 4, 5, 6, 7, 8, 9
@names "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"
@freq 252, 180, 270, 432, 486, 792, 558, 774, 270, 180
@type byte
@label How satisfied are you with your financial situation? 1 = very satisfied to 10=ve
@class category
@N_unique 10
@N 4194
 
_@NOTES

financesat:
{txt}{p 2 6}
1.
"How satisfied are you with your financial situation? 1 = very satisfied to 10=very unsatisfied"
{p_end}
{res} 
=====gamblingjust=====

gamblingjust:  Gambling is justified. 1 = s     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     5                      4194
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
gamblingjust {c |}{res}      4194    2.609442    1.137596          1          5
@mean     2.609
@sd     1.138
@min         1
@max         5
@values 1, 2, 3, 4, 5
@names "1", "2", "3", "4", "5"
@freq 882, 954, 1530, 576, 252
@type byte
@label Gambling is justified. 1 = strongly disagree to 5=strongly agree
@class category
@N_unique 5
@N 4194
 
_@NOTES

gamblingjust:
{txt}{p 2 6}
1.
"Gambling is justified. 1 = strongly disagree to 5=strongly agree"
{p_end}
{res} 
=====happy=====

happy:  Happiness                               {txt}Number of Observations
{hline 17}                           {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 4194      4194          -
{txt}{c |}          {res}#   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     5                      4194
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}happy {c |}{res}      4194    3.660944    .8497783          1          5
@mean     3.661
@sd     0.850
@min         1
@max         5
@values 1, 2, 3, 4, 5
@names "1", "2", "3", "4", "5"
@freq 72, 288, 1170, 2124, 540
@type byte
@label Happiness
@class category
@N_unique 5
@N 4194
 
_@NOTES

happy:
{txt}{p 2 6}
1.
"All things considered in your life, how happy would you say you are usually? 1=very unhappy to 5=very happy"
{p_end}
{res} 
=====perfuni=====

perfuni:  Performance at Uni                    {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero           {res}   72        72          -
{txt}{c |}          {res}#   #             {txt}Positive       {res} 4122      4122          -
{txt}{c |}          {res}#   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     4                      4194
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}perfuni {c |}{res}      4194    2.618026    .9149469          0          4
@mean     2.618
@sd     0.915
@min         0
@max         4
@values 0, 1, 2, 3, 4
@names "0", "1", "2", "3", "4"
@freq 72, 378, 1296, 1782, 666
@type byte
@label Performance at Uni
@class category
@N_unique 5
@N 4194
 
_@NOTES

perfuni:
{txt}{p 2 6}
1.
"Overall, how would you rate your performance at university? 1=well above average to 5=well below average"
{p_end}
{res} 
=====political=====

political:  How would you place your views      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4194      4194          -
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#                 {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}political {c |}{res}      4194    5.502146    1.908251          1         10
@mean     5.502
@sd     1.908
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 108, 162, 342, 396, 1098, 1134, 306, 378, 126, 144
@type byte
@label How would you place your views on this scale, generally speaking? 1=(far) left t
@class category
@N_unique 10
@N 4194
 
_@NOTES

political:
{txt}{p 2 6}
1.
"How would you place your views on this scale, generally speaking? 1=(far) left to 10=(far) right"
{p_end}
{res} 
=====wealthfam=====

wealthfam:  Would you say that your family      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  216       216          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 3978      3978          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #   #                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     2                      4194
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}wealthfam {c |}{res}      4194    1.184549    .5035431          0          2
@mean     1.185
@sd     0.504
@min         0
@max         2
@values 0, 1, 2
@names "0", "1", "2"
@freq 216, 2988, 990
@type byte
@label Would you say that your family is...0=wealthier than others to 2=poorer than oth
@class category
@N_unique 3
@N 4194
 
_@NOTES

wealthfam:
{txt}{p 2 6}
1.
"Would you say that your family is...0=wealthier than others to 2=poorer than others"
{p_end}
{res} 
=====alcohol=====
@example0 3
@type str17
@label When you drink alcohol, on average, how many drinks do you have?
@class string
@N_unique 48
@N 3924
 
_@NOTES

alcohol:
{txt}{p 2 6}
1.
"When you drink alcohol, on average, how many drinks do you have?"
{p_end}
{res} 
=====depression=====

depression:  Depression                         {txt}Number of Observations
{hline 23}                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3852      3852          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  342       342          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}depression {c |}{res}      4194    .0815451     .273703          0          1
@mean     0.082
@sd     0.274
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 3852, 342
@type byte
@label Depression
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

depression:
{txt}{p 2 6}
1.
"Have you had any symptoms of or complaints about depression during the last month (30 days)? 1=yes, 0=no"
{p_end}
{res} 
=====haslucky=====

haslucky:  Do you have a lucky charm? 0=yes     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1152      1152          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 3042      3042          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}haslucky {c |}{res}      4194    .7253219    .4464052          0          1
@mean     0.725
@sd     0.446
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1152, 3042
@type byte
@label Do you have a lucky charm? 0=yes, 1=no
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

haslucky:
{txt}{p 2 6}
1.
"Do you have a lucky charm? 0=yes, 1=no"
{p_end}
{res} 
=====height=====

height:  How tall are you, in centimetres?      {txt}Number of Observations
{hline 42}  {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Positive       {res} 4176      4176          -
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 4176      4176          -
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing        {res}   18
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}140                 195                      4194
  (42 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}height {c |}{res}      4176    168.8793    9.659684        140        195
@mean   168.879
@sd     9.660
@min       140
@max       195
@example0 173
@histh .00282132, .00564263, .00282132, .01410658, .00282132, .0169279, .00846395, .0338558, .01128527, .06206897, .01410658, .03949843, .04231975, .04514107, .03103448, .05642633, .0338558, .02257053, .03667711, .01128527, .04514107, .00846395, .05360502, .00846395, .01128527, .01128527, .00564263, .00846395, .00282132, .00564263
@histw 140.76389, 145.34723, 146.875, 149.93056, 152.98611, 154.51389, 156.04167, 157.56944, 159.09723, 160.625, 162.15277, 163.68056, 165.20833, 166.73611, 168.26389, 169.79167, 171.31944, 172.84723, 174.375, 175.90277, 177.43056, 178.95833, 180.48611, 182.01389, 183.54167, 185.06944, 186.59723, 189.65277, 191.18056, 194.23611
@type int
@label How tall are you, in centimetres?
@class other
@N_unique 42
@N 4176
 
_@NOTES

height:
{txt}{p 2 6}
1.
"How tall are you, in centimetres?"
{p_end}
{res} 
=====lefthand=====

lefthand:  Lefthanded                           {txt}Number of Observations
{hline 21}                       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3960      3960          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  234       234          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}lefthand {c |}{res}      4194     .055794    .2295508          0          1
@mean     0.056
@sd     0.230
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 3960, 234
@type byte
@label Lefthanded
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

lefthand:
{txt}{p 2 6}
1.
"Which hand do you write with? 1=left, 0=right"
{p_end}
{res} 
=====luckyans=====

luckyans:  Lucky Charm                          {txt}Number of Observations
{hline 22}                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#   #             {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Positive       {res} 4194      4194          -
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     5                      4194
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}luckyans {c |}{res}      4194           3    1.168389          1          5
@mean     3.000
@sd     1.168
@min         1
@max         5
@values 1, 2, 3, 4, 5
@names "1", "2", "3", "4", "5"
@freq 612, 702, 1278, 1278, 324
@type byte
@label Lucky Charm
@class category
@N_unique 5
@N 4194
 
_@NOTES

luckyans:
{txt}{p 2 6}
1.
"What is your opinion of the following statement - Good luck charms sometimes do bring good luck. 1=Definitely not true to 5=Definitely true"
{p_end}
{res} 
=====medication=====

medication:  Medication                         {txt}Number of Observations
{hline 23}                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3870      3870          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  324       324          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}medication {c |}{res}      4194    .0772532    .2670246          0          1
@mean     0.077
@sd     0.267
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 3870, 324
@type byte
@label Medication
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

medication:
{txt}{p 2 6}
1.
"Are you taking a prescribed medication? 1=yes, 0=no"
{p_end}
{res} 
=====relig=====

relig:  Apart from weddings, funerals and c     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero           {res}  936       936          -
{txt}{c |}  {res}#   #           #         {txt}Positive       {res} 3258      3258          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     5                      4194
   (6 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}relig {c |}{res}      4194    2.124464    1.672224          0          5
@mean     2.124
@sd     1.672
@min         0
@max         5
@values 0, 1, 2, 3, 4, 5
@names "0", "1", "2", "3", "4", "5"
@freq 936, 864, 684, 576, 720, 414
@type byte
@label Apart from weddings, funerals and christenings, how often do you attend religiou
@class category
@N_unique 6
@N 4194
 
_@NOTES

relig:
{txt}{p 2 6}
1.
"Apart from weddings, funerals and christenings, how often do you attend religious services these days? 1=More than once a week, 2=Once a week, 3=Once a month, 4=Once a year, 5=Less often than once a year, 6=never"
{p_end}
{res} 
=====smoke=====

smoke:  Smoking                                 {txt}Number of Observations
{hline 15}                             {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 4068      4068          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  126       126          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .   .                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     2                      4194
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}smoke {c |}{res}      4194    .0429185     .258541          0          2
@mean     0.043
@sd     0.259
@min         0
@max         2
@values 0, 1, 2
@names "0", "1", "2"
@freq 4068, 72, 54
@type byte
@label Smoking
@class category
@N_unique 3
@N 4194
 
_@NOTES

smoke:
{txt}{p 2 6}
1.
"Do you regularly smoke any tobacco product, such as cigarettes, cigars or pipes? 2=Yes, daily, 1=Yes, but not every day, 0=No, not at all"
{p_end}
{res} 
=====vegi=====

vegi:  Vegetarian                               {txt}Number of Observations
{hline 17}                           {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 4014      4014          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  180       180          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}vegi {c |}{res}      4194    .0429185    .2026975          0          1
@mean     0.043
@sd     0.203
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 4014, 180
@type byte
@label Vegetarian
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

vegi:
{txt}{p 2 6}
1.
"Are you a vegetarian? 1=Yes, 0=No"
{p_end}
{res} 
=====watchover=====

watchover:  Is there someone, who cannot be     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero           {res} 2124      2124          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 2052      2052          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4176      4176          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}   18
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}watchover {c |}{res}      4176    .4913793    .4999855          0          1
@mean     0.491
@sd     0.500
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2124, 2052
@type byte
@label Is there someone, who cannot be seen by others, watching over you? 0=Yes, 1=No
@class dummy
@N_unique 2
@N 4176
 
_@NOTES

watchover:
{txt}{p 2 6}
1.
"Is there someone, who cannot be seen by others, watching over you? 0=Yes, 1=No"
{p_end}
{res} 
=====weight=====

weight:  How much do you weigh in light clo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 4158      4104         54
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4158      4104         54
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing        {res}   36
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}30                  162                      4194
  (57 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}weight {c |}{res}      4158    64.58095    16.91177         30        162
@mean    64.581
@sd    16.912
@min    30.000
@max   162.000
@example0 65
@histh .00118064, .00472255, .01298701, .03069658, .04014168, .02007084, .03423849, .03541913, .0283353, .0094451, .02125148, .00826446, .00236128, .00590319, .00354191, .00236128, .00236128, .00118064, .00118064, .00118064, .00118064, .00118064, .00118064, .00118064, .00118064
@histw 31.833334, 42.833332, 46.5, 50.166668, 53.833332, 57.5, 61.166668, 64.833336, 68.5, 72.166664, 75.833336, 79.5, 83.166664, 86.833336, 90.5, 94.166664, 97.833336, 101.5, 105.16666, 108.83334, 119.83334, 130.83333, 141.83333, 149.16667, 160.16667
@type double
@label How much do you weigh in light clothing, in kilograms?
@class other
@N_unique 57
@N 4158
 
_@NOTES

weight:
{txt}{p 2 6}
1.
"How much do you weigh in light clothing, in kilograms?"
{p_end}
{res} 
=====father_qualification=====

father_qualification:  Did your father comp     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  900       900          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 3294      3294          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .   .                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     9                      4194
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
father_qua~n {c |}{res}      4194    1.918455    2.904724          0          9
@mean     1.918
@sd     2.905
@min         0
@max         9
@values 0, 1, 9
@names "0", "1", "9"
@freq 900, 2700, 594
@type byte
@label Did your father complete an educational qualification after leaving school?  Ple
@class category
@N_unique 3
@N 4194
 
_@NOTES

father_qualification:
{txt}{p 2 6}
1.
"Did your father complete an educational qualification after leaving school?  Please include any trade certificates, apprenticeships, diplomas, degrees or other educational qualifications. 1=Yes, 0=No, 9=Don't know"
{p_end}
{res} 
=====highqual=====

highqual:  If yes, what was the highest typ     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2016      2016          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2016      2016          -
{txt}{c |}  {res}#   #   .   .   #         {txt}Missing        {res} 2178
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     9                      4194
   (8 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}highqual {c |}{res}      2016    3.839286    2.270528          1          9
@mean     3.839
@sd     2.271
@min         1
@max         9
@values 1, 2, 3, 4, 5, 7, 8, 9
@names "1", "2", "3", "4", "5", "7", "8", "9"
@freq 36, 432, 1062, 54, 18, 180, 18, 216
@type byte
@label If yes, what was the highest type of qualification you obtained?1=University[doc
@class category
@N_unique 8
@N 2016
 
_@NOTES

highqual:
{txt}{p 2 6}
1.
"If yes, what was the highest type of qualification you obtained?1=University[doctorate],2=University[Master],3=University[Bachelor],4=University[Other],5=Teachers college/College of Advanced Education,6=Institute of Technology,7=Technical colle"
{p_end}
{res} 
=====highqual_father=====

highqual_father:  If yes, what was the high     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2754      2754          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2754      2754          -
{txt}{c |}  {res}#   #   .   #   .         {txt}Missing        {res} 1440
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     9                      4194
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
highqual_f~r {c |}{res}      2754    3.640523    2.072962          1          9
@mean     3.641
@sd     2.073
@min         1
@max         9
@values 1, 2, 3, 4, 5, 6, 7, 8, 9
@names "1", "2", "3", "4", "5", "6", "7", "8", "9"
@freq 126, 594, 1332, 126, 72, 54, 252, 18, 180
@type byte
@label If yes, what was the highest type of qualification he obtained?1=University[doct
@class category
@N_unique 9
@N 2754
 
_@NOTES

highqual_father:
{txt}{p 2 6}
1.
"If yes, what was the highest type of qualification he obtained?1=University[doctorate],2=University[Master],3=University[Bachelor],4=University[Other],5=Teachers college/College of Advanced Education,6=Institute of Technology,7=Technical colleg"
{p_end}
{res} 
=====highqual_mother=====

highqual_mother:  If yes, what was the high     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2484      2484          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 2484      2484          -
{txt}{c |}  {res}#   #   .   #   .         {txt}Missing        {res} 1710
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     9                      4194
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
highqual_m~r {c |}{res}      2484    3.992754    2.076843          1          9
@mean     3.993
@sd     2.077
@min         1
@max         9
@values 1, 2, 3, 4, 5, 6, 7, 8, 9
@names "1", "2", "3", "4", "5", "6", "7", "8", "9"
@freq 126, 234, 1260, 126, 216, 36, 270, 90, 126
@type byte
@label If yes, what was the highest type of qualification she obtained?1=University[doc
@class category
@N_unique 9
@N 2484
 
_@NOTES

highqual_mother:
{txt}{p 2 6}
1.
"If yes, what was the highest type of qualification she obtained?1=University[doctorate],2=University[Master],3=University[Bachelor],4=University[Other],5=Teachers college/College of Advanced Education,6=Institute of Technology,7=Technical colle"
{p_end}
{res} 
=====jobtitle_father=====
@example0 Boss
@type str50
@label What is the full title of your father's occupation?
@class string
@N_unique 124
@N 3150
 
_@NOTES

jobtitle_father:
{txt}{p 2 6}
1.
"What is the full title of your father's occupation?"
{p_end}
{res} 
=====jobtitle_mother=====
@example0 Transport managner
@type str45
@label What is the full title of your mother's occupation?
@class string
@N_unique 117
@N 2952
 
_@NOTES

jobtitle_mother:
{txt}{p 2 6}
1.
"What is the full title of your mother's occupation?"
{p_end}
{res} 
=====mother_qualification=====

mother_qualification:  Did your mother comp     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1260      1260          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2934      2934          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .   .                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     9                      4194
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
mother_qua~n {c |}{res}      4194    1.660944    2.748885          0          9
@mean     1.661
@sd     2.749
@min         0
@max         9
@values 0, 1, 9
@names "0", "1", "9"
@freq 1260, 2430, 504
@type byte
@label Did your mother complete an educational qualification after leaving school?  Ple
@class category
@N_unique 3
@N 4194
 
_@NOTES

mother_qualification:
{txt}{p 2 6}
1.
"Did your mother complete an educational qualification after leaving school?  Please include any trade certificates, apprenticeships, diplomas, degrees or other educational qualifications. 1=Yes, 0=No, 9=Don't know"
{p_end}
{res} 
=====occupation_father=====

occupation_father:  Please select the categ     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    99                      4194
  (12 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
occupa~ather {c |}{res}      4194    10.30901    25.03805          1         99
@mean    10.309
@sd    25.038
@min         1
@max        99
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 99
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "99"
@freq 1404, 972, 72, 558, 36, 198, 90, 126, 216, 180, 36, 306
@type byte
@label Please select the category or class of professions your father's occupation fall
@class category
@N_unique 12
@N 4194
 
_@NOTES

occupation_father:
{txt}{p 2 6}
1.
"Please select the category or class of professions your father's occupation falls into (even if he is unemployed): 1=MANAGERS AND ADMINISTRATORS,2=PROFESSIONALS,3=ASSOCIATE PROFESSIONALS,4=TRADESPERSONS AND RELATED WORKERS,5=ADVANCED CLERICAL A"
{p_end}
{res} 
=====occupation_mother=====

occupation_mother:  Please select the categ     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    99                      4194
  (12 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
occupa~other {c |}{res}      4194    15.25322    28.64191          1         99
@mean    15.253
@sd    28.642
@min         1
@max        99
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 99
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "99"
@freq 702, 828, 72, 180, 306, 270, 18, 108, 108, 72, 1098, 432
@type byte
@label Please select the category or class of professions your mother's occupation fall
@class category
@N_unique 12
@N 4194
 
_@NOTES

occupation_mother:
{txt}{p 2 6}
1.
"Please select the category or class of professions your mother's occupation falls into (even if she is unemployed): 1=MANAGERS AND ADMINISTRATORS,2=PROFESSIONALS,3=ASSOCIATE PROFESSIONALS,4=TRADESPERSONS AND RELATED WORKERS,5=ADVANCED CLERICAL "
{p_end}
{res} 
=====qualification=====

qualification:  Did you complete an educati     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2106      2106          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2088      2088          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .   .                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     9                      4194
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
qualificat~n {c |}{res}      4194    .9098712    1.947065          0          9
@mean     0.910
@sd     1.947
@min         0
@max         9
@values 0, 1, 9
@names "0", "1", "9"
@freq 2106, 1872, 216
@type byte
@label Did you complete an educational qualification after leaving school?  Please incl
@class category
@N_unique 3
@N 4194
 
_@NOTES

qualification:
{txt}{p 2 6}
1.
"Did you complete an educational qualification after leaving school?  Please include any trade certificates, apprenticeships, diplomas, degrees or other educational qualifications. 1=Yes, 0=No, 9=Don't know"
{p_end}
{res} 
=====schooling=====

schooling:  What was the highest year of sc     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4194      4194          -
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#                 {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     9                      4194
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}schooling {c |}{res}      4194    4.995708    .5823386          1          9
@mean     4.996
@sd     0.582
@min         1
@max         9
@values 1, 3, 4, 5, 9
@names "1", "3", "4", "5", "9"
@freq 18, 54, 54, 4014, 54
@type byte
@label What was the highest year of school you completed? 1=None,2=Primary school only,
@class category
@N_unique 5
@N 4194
 
_@NOTES

schooling:
{txt}{p 2 6}
1.
"What was the highest year of school you completed? 1=None,2=Primary school only,3=Some secondary school, but no more than Year 10,4=Year 11 or equivalent,5=Year 12 or equivalent,9=Don't know"
{p_end}
{res} 
=====schooling_father=====

schooling_father:  And how much schooling d     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4194      4194          -
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#                 {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     9                      4194
   (6 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
school~ather {c |}{res}      4194    4.849785    1.339147          1          9
@mean     4.850
@sd     1.339
@min         1
@max         9
@values 1, 2, 3, 4, 5, 9
@names "1", "2", "3", "4", "5", "9"
@freq 72, 108, 396, 162, 3222, 234
@type byte
@label And how much schooling did your father complete? 1=None,2=Primary school only,3=
@class category
@N_unique 6
@N 4194
 
_@NOTES

schooling_father:
{txt}{p 2 6}
1.
"And how much schooling did your father complete? 1=None,2=Primary school only,3=Some secondary school, but no more than Year 10,4=Year 11 or equivalent,5=Year 12 or equivalent,9=Don't know"
{p_end}
{res} 
=====schooling_mother=====

schooling_mother:  And how much schooling d     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4194      4194          -
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     9                      4194
   (6 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
school~other {c |}{res}      4194    4.716738    1.563314          1          9
@mean     4.717
@sd     1.563
@min         1
@max         9
@values 1, 2, 3, 4, 5, 9
@names "1", "2", "3", "4", "5", "9"
@freq 72, 162, 720, 198, 2736, 306
@type byte
@label And how much schooling did your mother complete? 1=None,2=Primary school only,3=
@class category
@N_unique 6
@N 4194
 
_@NOTES

schooling_mother:
{txt}{p 2 6}
1.
"And how much schooling did your mother complete? 1=None,2=Primary school only,3=Some secondary school, but no more than Year 10,4=Year 11 or equivalent,5=Year 12 or equivalent,9=Don't know"
{p_end}
{res} 
=====birthcountry=====
@example0 CHINA
@type str11
@label Please enter the country you were born.
@class string
@N_unique 44
@N 4194
 
_@NOTES

birthcountry:
{txt}{p 2 6}
1.
"Please enter the country you were born."
{p_end}
{res} 
=====culture=====
@example0 China
@type str23
@label Please enter the country whose culture you identify with most strongly.
@class string
@N_unique 58
@N 4194
 
_@NOTES

culture:
{txt}{p 2 6}
1.
"Please enter the country whose culture you identify with most strongly."
{p_end}
{res} 
=====dayofbirth=====

dayofbirth:  Day of birth                       {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#           #             {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #   #   #         {txt}Positive       {res} 4176      4176          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4176      4176          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}   18
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    31                      4194
  (31 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}dayofbirth {c |}{res}      4176    15.34483    9.122026          1         31
@mean    15.345
@sd     9.122
@min         1
@max        31
@example0 15
@histh .06206897, .06724138, .03103448, .03103448, .05172414, .05689655, .03103448, .02586207, .02586207, .02586207, .02586207, .04137931, .05689655, .03103448, .02586207, .05172414, .02586207, .01551724, .05172414, .03103448, .06206897, .04137931, .06206897, .02586207, .0775862, .01551724, .02068966, .03103448, .02068966, .04655172, .03103448
@histw 1.4166666, 2.25, 3.0833333, 3.9166667, 4.75, 6.4166665, 7.25, 8.083333, 8.916667, 9.75, 11.416667, 12.25, 13.083333, 13.916667, 14.75, 16.416666, 17.25, 18.083334, 18.916666, 19.75, 21.416666, 22.25, 23.083334, 23.916666, 24.75, 26.416666, 27.25, 28.083334, 28.916666, 29.75, 30.583334
@type byte
@label Day of birth
@class other
@N_unique 31
@N 4176
 
_@NOTES

dayofbirth:
{txt}{p 2 6}
1.
"Day of birth"
{p_end}
{res} 
=====degree=====
@example0 Policy Studies
@type str33
@label Which degree program are you enrolled in (economics, commerce, etc.)?
@class string
@N_unique 96
@N 4158
 
_@NOTES

degree:
{txt}{p 2 6}
1.
"Which degree program are you enrolled in (economics, commerce, etc.)?"
{p_end}
{res} 
=====englishspeaker=====

englishspeaker:  Englishspeaker                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2430      2430          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1764      1764          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
englishspe~r {c |}{res}      4194    .4206009    .4937144          0          1
@mean     0.421
@sd     0.494
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2430, 1764
@type byte
@label Englishspeaker
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

englishspeaker:
{txt}{p 2 6}
1.
"Do you speak English at home? 1=yes, 0=no"
{p_end}
{res} 
=====experiment=====

experiment:  Experiment experience              {txt}Number of Observations
{hline 34}          {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  630       630          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 3564      3564          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}experiment {c |}{res}      4194    .8497854    .3573242          0          1
@mean     0.850
@sd     0.357
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 630, 3564
@type byte
@label Experiment experience
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

experiment:
{txt}{p 2 6}
1.
"Have you ever participated in an experiment before? 1=yes, 0=no"
{p_end}
{res} 
=====gender=====

gender:  1=male, 2=female                       {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1890      1890          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 2304      2304          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}gender {c |}{res}      4194    .5493562    .4976173          0          1
@mean     0.549
@sd     0.498
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1890, 2304
@type byte
@label 1=male, 2=female
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

gender:
{txt}{p 2 6}
1.
"1=male, 2=female"
{p_end}
{res} 
=====internationalstudent=====

internationalstudent:  International Studen     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1422      1422          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2772      2772          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
internatio~t {c |}{res}      4194    .6609442    .4734453          0          1
@mean     0.661
@sd     0.473
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1422, 2772
@type byte
@label International Student
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

internationalstudent:
{txt}{p 2 6}
1.
"1=yes, 0=no"
{p_end}
{res} 
=====living=====

living:  What is your current living situat     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero           {res} 1008      1008          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 3186      3186          -
{txt}{c |}  {res}#           #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#           #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .   .   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     5                      4194
   (6 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}living {c |}{res}      4194    2.708155    1.673205          0          5
@mean     2.708
@sd     1.673
@min         0
@max         5
@values 0, 1, 2, 3, 4, 5
@names "0", "1", "2", "3", "4", "5"
@freq 1008, 36, 252, 1026, 1620, 252
@type byte
@label What is your current living situation? 0=Living alone (renting),1=Living alone (
@class category
@N_unique 6
@N 4194
 
_@NOTES

living:
{txt}{p 2 6}
1.
"What is your current living situation? 0=Living alone (renting),1=Living alone (owning),2=Living with your partner,3=Living with your parents,4=Living in a shared house,5=Other"
{p_end}
{res} 
=====maritalstatus=====

maritalstatus:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3276      3276          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  918       918          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
maritalsta~s {c |}{res}      4194    .2188841    .4135392          0          1
@mean     0.219
@sd     0.414
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 3276, 918
@type byte
@label 
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====monthofbirth=====

monthofbirth:  Month of birth                   {txt}Number of Observations
{hline 29}               {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #           #         {txt}Positive       {res} 4176      4176          -
{txt}{c |}  {res}#   #           #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4176      4176          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}   18
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    12                      4194
  (12 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
monthofbirth {c |}{res}      4176    6.599138    3.547959          1         12
@mean     6.599
@sd     3.548
@min         1
@max        12
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"
@freq 324, 360, 252, 558, 342, 306, 252, 252, 324, 414, 360, 432
@type byte
@label Month of birth
@class category
@N_unique 12
@N 4176
 
_@NOTES

monthofbirth:
{txt}{p 2 6}
1.
"Month of birth"
{p_end}
{res} 
=====monthofgrad=====

monthofgrad:  When do you expect to graduat     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4104      4104          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#       #         {txt}Total          {res} 4104      4104          -
{txt}{c |}  {res}#   .   #   .   #         {txt}Missing        {res}   90
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    12                      4194
  (12 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}monthofgrad {c |}{res}      4104    8.938596    3.181431          1         12
@mean     8.939
@sd     3.181
@min         1
@max        12
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"
@freq 72, 36, 360, 18, 90, 414, 522, 144, 126, 108, 1134, 1080
@type byte
@label When do you expect to graduate? (month)
@class category
@N_unique 12
@N 4104
 
_@NOTES

monthofgrad:
{txt}{p 2 6}
1.
"When do you expect to graduate? (month)"
{p_end}
{res} 
=====nationality=====
@example0 Chinese
@type str18
@label Please enter your nationality.
@class string
@N_unique 57
@N 4194
 
_@NOTES

nationality:
{txt}{p 2 6}
1.
"Please enter your nationality."
{p_end}
{res} 
=====postcode=====

postcode:  Please enter the postcode of the     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 3636      3636          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 3636      3636          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  558
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2000               2763                      4194
  (56 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}postcode {c |}{res}      3636    2071.366    99.26224       2000       2763
@mean  2071.366
@sd    99.262
@min      2000
@max      2763
@example0 2010
@histh .00317922, .02725043, .00317922, .00204378, .00022709, .00249796, .00317922, .00136252, .0018167, .00022709, .00045417, .00045417
@histw 2010.9, 2032.7, 2054.5, 2076.3, 2098.1001, 2119.8999, 2141.7, 2163.5, 2207.1001, 2228.8999, 2555.8999, 2752.1001
@type int
@label Please enter the postcode of the area you live in.
@class other
@N_unique 56
@N 3636
 
_@NOTES

postcode:
{txt}{p 2 6}
1.
"Please enter the postcode of the area you live in."
{p_end}
{res} 
=====weeklyincome=====

weeklyincome:  What is your weekly disposab     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2250      2250          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1944      1944          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #             {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     3                      4194
   (4 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
weeklyincome {c |}{res}      4194    .8412017     1.05062          0          3
@mean     0.841
@sd     1.051
@min         0
@max         3
@values 0, 1, 2, 3
@names "0", "1", "2", "3"
@freq 2250, 810, 684, 450
@type byte
@label What is your weekly disposable income? 0=None or less than $ 100,1=$ 100-199,2=$
@class category
@N_unique 4
@N 4194
 
_@NOTES

weeklyincome:
{txt}{p 2 6}
1.
"What is your weekly disposable income? 0=None or less than $ 100,1=$ 100-199,2=$ 200-299,3=$ 300-399,4=$ 400-499,5=$ 500 and over"
{p_end}
{res} 
=====yearofbirth=====

yearofbirth:  Year of birth                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   .   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1963               1998                      4194
  (21 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}yearofbirth {c |}{res}      4194    1987.876    3.635852       1963       1998
@mean  1987.876
@sd     3.636
@min      1963
@max      1998
@values 1963, 1972, 1974, 1976, 1977, 1978, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1995, 1998
@names "1963", "1972", "1974", "1976", "1977", "1978", "1980", "1981", "1982", "1983", "1984", "1985", "1986", "1987", "1988", "1989", "1990", "1991", "1992", "1995", "1998"
@freq 18, 18, 18, 18, 36, 18, 18, 18, 54, 90, 108, 306, 396, 378, 594, 558, 828, 486, 180, 36, 18
@type int
@label Year of birth
@class category
@N_unique 21
@N 4194
 
_@NOTES

yearofbirth:
{txt}{p 2 6}
1.
"Year of birth"
{p_end}
{res} 
=====yearofgrad=====

yearofgrad:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Positive       {res} 4140      4140          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4140      4140          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing        {res}   54
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2010               2014                      4194
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}yearofgrad {c |}{res}      4140    2011.474    1.121748       2010       2014
@mean  2011.474
@sd     1.122
@min      2010
@max      2014
@values 2010, 2011, 2012, 2013, 2014
@names "2010", "2011", "2012", "2013", "2014"
@freq 900, 1350, 1134, 540, 216
@type int
@label 
@class category
@N_unique 5
@N 4140
 
_@NOTES
 
=====dropout=====
@freq 3598, 596
@values "false", "true"
@type str5
@label True or False:  Participant dropped out at this pitstop
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

dropout:
{txt}{p 2 6}
1.
"True or False:  Participant dropped out at this pitstop"
{p_end}
{res} 
=====dropoutvalue=====

dropoutvalue:  Payout to participant if he      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}    3         3          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4191       154       4037
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194       157       4037
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                235.74                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
dropoutvalue {c |}{res}      4194    10.83748    13.95581          0     235.74
@mean    10.837
@sd    13.956
@min     0.000
@max   235.740
@example0 24.200001
@histh .07453471, .04016209, .01769608, .00793775, .00415093, .00254882, .00189341, .001238, .00069182, .00043694, .00003641, .00047335, .00018206, .00007282, .00018206, .00003641, .00003641, .00010924, .00007282, .00007282, .00007282, .00003641, .00003641
@histw 3.2741671, 9.8225012, 16.370834, 22.919168, 29.467503, 36.015835, 42.564171, 49.112503, 55.660839, 62.209171, 68.757507, 75.30584, 81.854172, 94.950844, 101.49918, 108.04751, 121.14418, 127.69251, 134.24084, 147.33751, 160.43417, 199.72418, 232.46585
@type float
@label Payout to participant if he drops out at this pitstop
@class other
@N_unique .
@N 4194
 
_@NOTES

dropoutvalue:
{txt}{p 2 6}
1.
"Payout to participant if he drops out at this pitstop"
{p_end}
{res} 
=====winfactor=====

winfactor:  Multiple of bet to be won if pa     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#       #                 {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .   #                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                    15                      4194
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}winfactor {c |}{res}      4194    6.759657    4.954689          2         15
@mean     6.760
@sd     4.955
@min         2
@max        15
@values 2, 5, 15
@names "2", "5", "15"
@freq 1080, 2052, 1062
@type byte
@label Multiple of bet to be won if participant's car comes in first place
@class category
@N_unique 3
@N 4194
 
_@NOTES

winfactor:
{txt}{p 2 6}
1.
"Multiple of bet to be won if participant's car comes in first place"
{p_end}
{res} 
=====earnings=====

earnings:  Real-Effort Earnings                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4194       108       4086
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 4194       108       4086
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}6.64824        41.33276                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}earnings {c |}{res}      4194    24.48323    6.060306    6.64824   41.33276
@mean    24.483
@sd     6.060
@min     6.648
@max    41.333
@example0 26.084721
@histh .00445462, .00445462, .00445462, .00445462, .00890925, .02227311, .00445462, .00890925, .01336387, .01781849, .03563698, .04900084, .04454622, .04454622, .05791009, .07572858, .07572858, .09354707, .06236471, .05791009, .08909245, .05791009, .02227311, .03563698, .02672773, .03118236, .01781849, .00890925, .00445462, .01336387, .01781849, .00890925, .00890925, .00445462
@histw 7.1299696, 8.0934286, 9.0568876, 10.020347, 10.983805, 11.947264, 12.910723, 13.874182, 15.8011, 16.764559, 17.728018, 18.691477, 19.654936, 20.618393, 21.581852, 22.545311, 23.50877, 24.472229, 25.435688, 26.399147, 27.362606, 28.326065, 29.289524, 30.252983, 31.216442, 32.179901, 33.14336, 34.106819, 35.070278, 36.033737, 36.997196, 37.960655, 38.924114, 40.851032
@type float
@label Real-Effort Earnings
@class other
@N_unique .
@N 4194
 
_@NOTES

earnings:
{txt}{p 2 6}
1.
"Income earned in real effort task"
{p_end}
{res} 
=====risk_1=====

risk_1:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 4122      4122          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   72        72          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_1 {c |}{res}      4194    .0171674    .1299103          0          1
@mean     0.017
@sd     0.130
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 4122, 72
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 1, 1=Participant prefers
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

risk_1:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 1, 1=Participant prefers more risky option in Risk Lottery 1"
{p_end}
{res} 
=====risk_2=====

risk_2:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3996      3996          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  198       198          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_2 {c |}{res}      4194    .0472103    .2121137          0          1
@mean     0.047
@sd     0.212
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 3996, 198
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 2, 1=Participant prefers
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

risk_2:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 2, 1=Participant prefers more risky option in Risk Lottery 2"
{p_end}
{res} 
=====risk_3=====

risk_3:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3888      3888          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  306       306          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_3 {c |}{res}      4194    .0729614    .2601041          0          1
@mean     0.073
@sd     0.260
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 3888, 306
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 3, 1=Participant prefers
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

risk_3:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 3, 1=Participant prefers more risky option in Risk Lottery 3"
{p_end}
{res} 
=====risk_4=====

risk_4:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3384      3384          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  810       810          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_4 {c |}{res}      4194     .193133    .3948035          0          1
@mean     0.193
@sd     0.395
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 3384, 810
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 4, 1=Participant prefers
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

risk_4:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 4, 1=Participant prefers more risky option in Risk Lottery 4"
{p_end}
{res} 
=====risk_5=====

risk_5:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2322      2322          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1872      1872          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_5 {c |}{res}      4194    .4463519    .4971728          0          1
@mean     0.446
@sd     0.497
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2322, 1872
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 5, 1=Participant prefers
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

risk_5:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 5, 1=Participant prefers more risky option in Risk Lottery 5"
{p_end}
{res} 
=====risk_6=====

risk_6:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1458      1458          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2736      2736          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_6 {c |}{res}      4194    .6523605    .4762776          0          1
@mean     0.652
@sd     0.476
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1458, 2736
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 6, 1=Participant prefers
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

risk_6:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 6, 1=Participant prefers more risky option in Risk Lottery 6"
{p_end}
{res} 
=====risk_7=====

risk_7:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  774       774          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 3420      3420          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_7 {c |}{res}      4194    .8154506    .3879778          0          1
@mean     0.815
@sd     0.388
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 774, 3420
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 7, 1=Participant prefers
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

risk_7:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 7, 1=Participant prefers more risky option in Risk Lottery 7"
{p_end}
{res} 
=====risk_8=====

risk_8:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  414       414          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 3780      3780          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_8 {c |}{res}      4194    .9012876    .2983111          0          1
@mean     0.901
@sd     0.298
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 414, 3780
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 8, 1=Participant prefers
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

risk_8:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 8, 1=Participant prefers more risky option in Risk Lottery 8"
{p_end}
{res} 
=====risk_9=====

risk_9:  0=Participant prefers less risky o     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  198       198          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 3996      3996          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}risk_9 {c |}{res}      4194    .9527897    .2121137          0          1
@mean     0.953
@sd     0.212
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 198, 3996
@type byte
@label 0=Participant prefers less risky option in Risk Lottery 9, 1=Participant prefers
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

risk_9:
{txt}{p 2 6}
1.
"0=Participant prefers less risky option in Risk Lottery 9, 1=Participant prefers more risky option in Risk Lottery 9"
{p_end}
{res} 
=====loc01=====

loc01:  I have little control over the thin     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #       #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}loc01 {c |}{res}      4194    4.733906    2.600658          1         10
@mean     4.734
@sd     2.601
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 288, 684, 810, 576, 270, 306, 396, 396, 342, 126
@type byte
@label I have little control over the things that happen to me. (strongly disagree=1 to
@class category
@N_unique 10
@N 4194
 
_@NOTES

loc01:
{txt}{p 2 6}
1.
"I have little control over the things that happen to me. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====loc02=====

loc02:  There is really no way I can solve      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}loc02 {c |}{res}      4194    4.536481    2.691859          1         10
@mean     4.536
@sd     2.692
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 432, 738, 810, 432, 396, 252, 252, 396, 324, 162
@type byte
@label There is really no way I can solve some of the problems I have. (strongly disagr
@class category
@N_unique 10
@N 4194
 
_@NOTES

loc02:
{txt}{p 2 6}
1.
"There is really no way I can solve some of the problems I have. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====loc03=====

loc03:  There is little I can do to change      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #       #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}loc03 {c |}{res}      4194    4.145923    2.524891          1         10
@mean     4.146
@sd     2.525
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 558, 828, 846, 342, 342, 288, 450, 288, 144, 108
@type byte
@label There is little I can do to change many of the important things in my life. (str
@class category
@N_unique 10
@N 4194
 
_@NOTES

loc03:
{txt}{p 2 6}
1.
"There is little I can do to change many of the important things in my life. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====loc04=====

loc04:  I often feel helpless in dealing wi     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}loc04 {c |}{res}      4194    4.334764     2.63215          1         10
@mean     4.335
@sd     2.632
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 612, 702, 684, 450, 360, 342, 396, 306, 180, 162
@type byte
@label I often feel helpless in dealing with the problems of life. (strongly disagree=1
@class category
@N_unique 10
@N 4194
 
_@NOTES

loc04:
{txt}{p 2 6}
1.
"I often feel helpless in dealing with the problems of life. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====loc05=====

loc05:  Sometimes I feel that I'm being pus     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#           #             {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #             {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}loc05 {c |}{res}      4194    4.815451    2.700715          1         10
@mean     4.815
@sd     2.701
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 630, 522, 486, 288, 342, 594, 486, 522, 180, 144
@type byte
@label Sometimes I feel that I'm being pushed around in life. (strongly disagree=1 to s
@class category
@N_unique 10
@N 4194
 
_@NOTES

loc05:
{txt}{p 2 6}
1.
"Sometimes I feel that I'm being pushed around in life. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====loc06=====

loc06:  What happens to me in the future mo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}loc06 {c |}{res}      4194    8.055794    1.968082          1         10
@mean     8.056
@sd     1.968
@min         1
@max        10
@values 1, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 36, 108, 198, 216, 216, 360, 900, 1062, 1098
@type byte
@label What happens to me in the future mostly depends on me. (strongly disagree=1 to s
@class category
@N_unique 9
@N 4194
 
_@NOTES

loc06:
{txt}{p 2 6}
1.
"What happens to me in the future mostly depends on me. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====loc07=====

loc07:  I can do just about anything I real     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4194      4194          -
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}loc07 {c |}{res}      4194    7.296137    2.055873          1         10
@mean     7.296
@sd     2.056
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 54, 162, 234, 378, 450, 738, 756, 792, 612
@type byte
@label I can do just about anything I really set my mind to. (strongly disagree=1 to st
@class category
@N_unique 10
@N 4194
 
_@NOTES

loc07:
{txt}{p 2 6}
1.
"I can do just about anything I really set my mind to. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav01=====

sav01:  Before a good thing happens, I look     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #   .   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                    10                      4194
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav01 {c |}{res}      4194    7.969957    1.686793          2         10
@mean     7.970
@sd     1.687
@min         2
@max        10
@values 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 54, 162, 180, 270, 594, 1080, 1098, 738
@type byte
@label Before a good thing happens, I look forward to it in ways that give me pleasure 
@class category
@N_unique 9
@N 4194
 
_@NOTES

sav01:
{txt}{p 2 6}
1.
"Before a good thing happens, I look forward to it in ways that give me pleasure in the present. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav02=====

sav02:  It's hard for me to hang onto a goo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#       #             {txt}Positive       {res} 4194      4194          -
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav02 {c |}{res}      4194    5.038627    2.375633          1         10
@mean     5.039
@sd     2.376
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 198, 414, 828, 558, 342, 504, 540, 504, 216, 90
@type byte
@label It's hard for me to hang onto a good feeling for very long. (strongly disagree=1
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav02:
{txt}{p 2 6}
1.
"It's hard for me to hang onto a good feeling for very long. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav03=====

sav03:  I enjoy looking back on happy times     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav03 {c |}{res}      4194    7.939914    2.052312          1         10
@mean     7.940
@sd     2.052
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 108, 126, 90, 198, 252, 450, 900, 1044, 1008
@type byte
@label I enjoy looking back on happy times from my past. (strongly disagree=1 to strong
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav03:
{txt}{p 2 6}
1.
"I enjoy looking back on happy times from my past. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav04=====

sav04:  I don't like to look forward to goo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #   #             {txt}Positive       {res} 4194      4194          -
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav04 {c |}{res}      4194    5.283262    2.482252          1         10
@mean     5.283
@sd     2.482
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 252, 324, 648, 612, 414, 450, 432, 612, 324, 126
@type byte
@label I don't like to look forward to good times too much before they happen. (strongl
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav04:
{txt}{p 2 6}
1.
"I don't like to look forward to good times too much before they happen. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav05=====

sav05:  I know how to make the most of a go     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav05 {c |}{res}      4194    7.175966    2.042486          1         10
@mean     7.176
@sd     2.042
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 54, 54, 162, 216, 324, 468, 882, 756, 846, 432
@type byte
@label I know how to make the most of a good time. (strongly disagree=1 to strongly agr
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav05:
{txt}{p 2 6}
1.
"I know how to make the most of a good time. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav06=====

sav06:  I don't like to look back at good t     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav06 {c |}{res}      4194    4.270386    2.318302          1         10
@mean     4.270
@sd     2.318
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 396, 630, 918, 630, 360, 432, 324, 306, 108, 90
@type byte
@label I don't like to look back at good times too much after they've taken place. (str
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav06:
{txt}{p 2 6}
1.
"I don't like to look back at good times too much after they've taken place. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav07=====

sav07:  I feel a joy of anticipation when I     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav07 {c |}{res}      4194    8.034335      1.5938          1         10
@mean     8.034
@sd     1.594
@min         1
@max        10
@values 1, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 18, 108, 162, 270, 756, 1152, 846, 864
@type byte
@label I feel a joy of anticipation when I think about upcoming good things. (strongly 
@class category
@N_unique 9
@N 4194
 
_@NOTES

sav07:
{txt}{p 2 6}
1.
"I feel a joy of anticipation when I think about upcoming good things. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav08=====

sav08:  When it comes to enjoying myself, I     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #             {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav08 {c |}{res}      4194    4.879828    2.391825          1         10
@mean     4.880
@sd     2.392
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 360, 504, 540, 396, 648, 522, 684, 216, 234, 90
@type byte
@label When it comes to enjoying myself, I'm my own 'worst enemy'. (strongly disagree=1
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav08:
{txt}{p 2 6}
1.
"When it comes to enjoying myself, I'm my own 'worst enemy'. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav09=====

sav09:  I can make myself feel good by reme     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav09 {c |}{res}      4194    7.553648    1.902991          1         10
@mean     7.554
@sd     1.903
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 72, 108, 162, 234, 360, 684, 1098, 936, 522
@type byte
@label I can make myself feel good by remembering pleasant events from my past. (strong
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav09:
{txt}{p 2 6}
1.
"I can make myself feel good by remembering pleasant events from my past. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav10=====

sav10:  For me, anticipating what upcoming      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav10 {c |}{res}      4194    3.909871    2.280159          1         10
@mean     3.910
@sd     2.280
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 468, 864, 936, 576, 396, 270, 234, 288, 72, 90
@type byte
@label For me, anticipating what upcoming good events will be like is basically a waste
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav10:
{txt}{p 2 6}
1.
"For me, anticipating what upcoming good events will be like is basically a waste of time. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav11=====

sav11:  When something good happens, I can      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 4194      4194          -
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav11 {c |}{res}      4194    7.124464    1.988821          1         10
@mean     7.124
@sd     1.989
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 54, 72, 90, 234, 414, 522, 630, 1080, 756, 342
@type byte
@label When something good happens, I can make my enjoyment of it last longer by thinki
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav11:
{txt}{p 2 6}
1.
"When something good happens, I can make my enjoyment of it last longer by thinking or doing certain things. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav12=====

sav12:  When I reminisce about pleasant mem     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #             {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav12 {c |}{res}      4194    4.553648    2.452916          1         10
@mean     4.554
@sd     2.453
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 396, 648, 774, 378, 486, 414, 450, 378, 216, 54
@type byte
@label When I reminisce about pleasant memories, I often start to feel sad or disappoin
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav12:
{txt}{p 2 6}
1.
"When I reminisce about pleasant memories, I often start to feel sad or disappointed. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav13=====

sav13:  I can enjoy pleasant events in my m     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav13 {c |}{res}      4194    7.012876     2.11799          1         10
@mean     7.013
@sd     2.118
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 36, 72, 252, 270, 324, 450, 756, 990, 576, 468
@type byte
@label I can enjoy pleasant events in my mind before they actually occur. (strongly dis
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav13:
{txt}{p 2 6}
1.
"I can enjoy pleasant events in my mind before they actually occur. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav14=====

sav14:  I can't seem to capture the joy of      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav14 {c |}{res}      4194    3.523605    2.106975          1         10
@mean     3.524
@sd     2.107
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 630, 756, 1332, 468, 252, 288, 126, 216, 90, 36
@type byte
@label I can't seem to capture the joy of happy moments. (strongly disagree=1 to strong
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav14:
{txt}{p 2 6}
1.
"I can't seem to capture the joy of happy moments. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav15=====

sav15:  I like to store memories of fun tim     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                    10                      4194
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav15 {c |}{res}      4194    7.635193    1.871615          2         10
@mean     7.635
@sd     1.872
@min         2
@max        10
@values 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 162, 180, 216, 378, 666, 1080, 810, 684
@type byte
@label I like to store memories of fun times that I go through so that I can recall the
@class category
@N_unique 9
@N 4194
 
_@NOTES

sav15:
{txt}{p 2 6}
1.
"I like to store memories of fun times that I go through so that I can recall them later. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav16=====

sav16:  It's hard for me to get very excite     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav16 {c |}{res}      4194    4.360515    2.291998          1         10
@mean     4.361
@sd     2.292
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 360, 684, 738, 594, 558, 432, 288, 324, 180, 36
@type byte
@label It's hard for me to get very excited about fun times before they actually take p
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav16:
{txt}{p 2 6}
1.
"It's hard for me to get very excited about fun times before they actually take place. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav17=====

sav17:  I feel fully able to appreciate goo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav17 {c |}{res}      4194    7.866953    1.807302          1         10
@mean     7.867
@sd     1.807
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 18, 90, 144, 180, 360, 558, 1080, 972, 774
@type byte
@label I feel fully able to appreciate good things that happen to me. (strongly disagre
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav17:
{txt}{p 2 6}
1.
"I feel fully able to appreciate good things that happen to me. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav18=====

sav18:  I find that thinking about good tim     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav18 {c |}{res}      4194    3.356223    2.271034          1         10
@mean     3.356
@sd     2.271
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 936, 900, 918, 396, 360, 180, 144, 216, 54, 90
@type byte
@label I find that thinking about good times from the past is basically a waste of time
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav18:
{txt}{p 2 6}
1.
"I find that thinking about good times from the past is basically a waste of time. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav19=====

sav19:  I can make myself feel good by imag     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 4194      4194          -
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav19 {c |}{res}      4194     7.27897    1.913438          1         10
@mean     7.279
@sd     1.913
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 54, 36, 72, 216, 306, 648, 558, 1170, 702, 432
@type byte
@label I can make myself feel good by imagining what a happy time that is about to happ
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav19:
{txt}{p 2 6}
1.
"I can make myself feel good by imagining what a happy time that is about to happen will be like. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav20=====

sav20:  I don't enjoy things as much as I s     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #             {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav20 {c |}{res}      4194    4.858369    2.561426          1         10
@mean     4.858
@sd     2.561
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 396, 504, 720, 396, 396, 540, 468, 378, 252, 144
@type byte
@label I don't enjoy things as much as I should. (strongly disagree=1 to strongly agree
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav20:
{txt}{p 2 6}
1.
"I don't enjoy things as much as I should. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav21=====

sav21:  It's easy for me to rekindle the jo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Positive       {res} 4194      4194          -
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav21 {c |}{res}      4194    7.081545    1.772011          1         10
@mean     7.082
@sd     1.772
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 36, 90, 144, 522, 702, 720, 1026, 666, 270
@type byte
@label It's easy for me to rekindle the joy from pleasant memories. (strongly disagree=
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav21:
{txt}{p 2 6}
1.
"It's easy for me to rekindle the joy from pleasant memories. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav22=====

sav22:  When I think about a pleasant event     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav22 {c |}{res}      4194    3.682403    2.161661          1         10
@mean     3.682
@sd     2.162
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 684, 846, 720, 648, 360, 414, 288, 144, 36, 54
@type byte
@label When I think about a pleasant event before it happens, I often start to feel une
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav22:
{txt}{p 2 6}
1.
"When I think about a pleasant event before it happens, I often start to feel uneasy or uncomfortable. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav23=====

sav23:  It's easy for me to enjoy myself wh     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                    10                      4194
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav23 {c |}{res}      4194    7.351931     1.93383          2         10
@mean     7.352
@sd     1.934
@min         2
@max        10
@values 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 108, 126, 198, 306, 396, 540, 1296, 846, 378
@type byte
@label It's easy for me to enjoy myself when I want to. (strongly disagree=1 to strongl
@class category
@N_unique 9
@N 4194
 
_@NOTES

sav23:
{txt}{p 2 6}
1.
"It's easy for me to enjoy myself when I want to. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====sav24=====

sav24:  For me, once a fun time is over and     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sav24 {c |}{res}      4194    3.686695    2.269801          1         10
@mean     3.687
@sd     2.270
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 630, 756, 1098, 540, 396, 270, 144, 126, 90, 144
@type byte
@label For me, once a fun time is over and gone, it's best not to think about it. (stro
@class category
@N_unique 10
@N 4194
 
_@NOTES

sav24:
{txt}{p 2 6}
1.
"For me, once a fun time is over and gone, it's best not to think about it. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====opt01=====

opt01:  When I'm in a new and unfamiliar si     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}opt01 {c |}{res}      4194    3.223176    1.775573          1         10
@mean     3.223
@sd     1.776
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 540, 1080, 1242, 558, 324, 90, 234, 90, 18, 18
@type byte
@label When I'm in a new and unfamiliar situation, I am always optimistic that things w
@class category
@N_unique 10
@N 4194
 
_@NOTES

opt01:
{txt}{p 2 6}
1.
"When I'm in a new and unfamiliar situation, I am always optimistic that things will work out for me (in other words, I feel and think that things will be OK). (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====opt02=====

opt02:  I often find myself doing things th     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #   #             {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #   #             {txt}Positive       {res} 4194      4194          -
{txt}{c |}      {res}#   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}opt02 {c |}{res}      4194    5.716738    2.424509          1         10
@mean     5.717
@sd     2.425
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 72, 396, 504, 468, 594, 450, 396, 702, 450, 162
@type byte
@label I often find myself doing things that I know, at the time I choose to do them, I
@class category
@N_unique 10
@N 4194
 
_@NOTES

opt02:
{txt}{p 2 6}
1.
"I often find myself doing things that I know, at the time I choose to do them, I will regret later. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====opt03=====

opt03:  When I expect that good things are      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     8                      4194
   (8 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}opt03 {c |}{res}      4194    2.459227    1.423251          1          8
@mean     2.459
@sd     1.423
@min         1
@max         8
@values 1, 2, 3, 4, 5, 6, 7, 8
@names "1", "2", "3", "4", "5", "6", "7", "8"
@freq 1134, 1368, 990, 396, 90, 126, 36, 54
@type byte
@label When I expect that good things are going to happen to me in the future, I feel b
@class category
@N_unique 8
@N 4194
 
_@NOTES

opt03:
{txt}{p 2 6}
1.
"When I expect that good things are going to happen to me in the future, I feel better about myself. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====opt04=====

opt04:  Optimism: Disapp.                       {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}opt04 {c |}{res}      4194    4.433476    2.211451          1         10
@mean     4.433
@sd     2.211
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 198, 738, 684, 846, 486, 432, 360, 180, 198, 72
@type byte
@label Optimism: Disapp.
@class category
@N_unique 10
@N 4194
 
_@NOTES

opt04:
{txt}{p 2 6}
1.
"When I get disappointed about something, it makes me feel that I'm to blame, because I should have known better in the first place and not expected as much. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====opt05=====

opt05:  I always try to be cautious when I      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}opt05 {c |}{res}      4194    3.055794    1.675922          1         10
@mean     3.056
@sd     1.676
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 576, 1224, 1170, 612, 252, 126, 108, 90, 18, 18
@type byte
@label I always try to be cautious when I approach new and unfamiliar situations, in ca
@class category
@N_unique 10
@N 4194
 
_@NOTES

opt05:
{txt}{p 2 6}
1.
"I always try to be cautious when I approach new and unfamiliar situations, in case something goes wrong. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====opt06=====

opt06:  Optimism: Low Exp.                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #       #             {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}opt06 {c |}{res}      4194    5.124464     2.76071          1         10
@mean     5.124
@sd     2.761
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 324, 540, 666, 540, 360, 270, 306, 594, 324, 270
@type byte
@label Optimism: Low Exp.
@class category
@N_unique 10
@N 4194
 
_@NOTES

opt06:
{txt}{p 2 6}
1.
"I prefer to have low expectations of the future since that way I might be pleasantly surprised, and I'm protected from being disappointed. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se01=====

se01:  On the whole, I am satisfied with my     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   .   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                    10                      4194
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se01 {c |}{res}      4194    7.824034    1.533483          2         10
@mean     7.824
@sd     1.533
@min         2
@max        10
@values 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 72, 126, 126, 270, 720, 1350, 1152, 360
@type byte
@label On the whole, I am satisfied with myself. (strongly disagree=1 to strongly agree
@class category
@N_unique 9
@N 4194
 
_@NOTES

se01:
{txt}{p 2 6}
1.
"On the whole, I am satisfied with myself. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se02=====

se02:  At times I think I am no good at all     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se02 {c |}{res}      4194     4.76824    2.652941          1         10
@mean     4.768
@sd     2.653
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 468, 738, 432, 378, 360, 630, 414, 306, 360, 108
@type byte
@label At times I think I am no good at all, (strongly disagree=1 to strongly agree=10)
@class category
@N_unique 10
@N 4194
 
_@NOTES

se02:
{txt}{p 2 6}
1.
"At times I think I am no good at all, (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se03=====

se03:  I feel that I have a number of good      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3                    10                      4194
   (8 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se03 {c |}{res}      4194    8.201717    1.407566          3         10
@mean     8.202
@sd     1.408
@min         3
@max        10
@values 3, 4, 5, 6, 7, 8, 9, 10
@names "3", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 54, 144, 216, 630, 1350, 918, 864
@type byte
@label I feel that I have a number of good qualities. (strongly disagree=1 to strongly 
@class category
@N_unique 8
@N 4194
 
_@NOTES

se03:
{txt}{p 2 6}
1.
"I feel that I have a number of good qualities. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se04=====

se04:  I am able to do things as well as mo     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3                    10                      4194
   (8 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se04 {c |}{res}      4194    8.098712    1.565269          3         10
@mean     8.099
@sd     1.565
@min         3
@max        10
@values 3, 4, 5, 6, 7, 8, 9, 10
@names "3", "4", "5", "6", "7", "8", "9", "10"
@freq 36, 126, 144, 306, 540, 1188, 1026, 828
@type byte
@label I am able to do things as well as most people. (strongly disagree=1 to strongly 
@class category
@N_unique 8
@N 4194
 
_@NOTES

se04:
{txt}{p 2 6}
1.
"I am able to do things as well as most people. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se05=====

se05:  I feel I do not have much to be prou     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se05 {c |}{res}      4194    3.819742    2.290792          1         10
@mean     3.820
@sd     2.291
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 576, 792, 990, 558, 360, 288, 144, 306, 126, 54
@type byte
@label I feel I do not have much to be proud of. (strongly disagree=1 to strongly agree
@class category
@N_unique 10
@N 4194
 
_@NOTES

se05:
{txt}{p 2 6}
1.
"I feel I do not have much to be proud of. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se06=====

se06:  I certainly feel useless at times. (     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #                 {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se06 {c |}{res}      4194    4.506438    2.539473          1         10
@mean     4.506
@sd     2.539
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 504, 828, 342, 468, 522, 486, 432, 324, 180, 108
@type byte
@label I certainly feel useless at times. (strongly disagree=1 to strongly agree=10)
@class category
@N_unique 10
@N 4194
 
_@NOTES

se06:
{txt}{p 2 6}
1.
"I certainly feel useless at times. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se07=====

se07:  I feel that I am a person of worth,      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se07 {c |}{res}      4194    8.197425    1.734633          1         10
@mean     8.197
@sd     1.735
@min         1
@max        10
@values 1, 2, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "4", "5", "6", "7", "8", "9", "10"
@freq 18, 36, 90, 180, 378, 468, 864, 1026, 1134
@type byte
@label I feel that I am a person of worth, or at least on an equal plane with others. (
@class category
@N_unique 9
@N 4194
 
_@NOTES

se07:
{txt}{p 2 6}
1.
"I feel that I am a person of worth, or at least on an equal plane with others. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se08=====

se08:  I wish I could have more respect for     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #   #   #         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se08 {c |}{res}      4194    5.669528    2.805567          1         10
@mean     5.670
@sd     2.806
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 414, 396, 378, 216, 432, 540, 468, 612, 378, 360
@type byte
@label I wish I could have more respect for myself. (strongly disagree=1 to strongly ag
@class category
@N_unique 10
@N 4194
 
_@NOTES

se08:
{txt}{p 2 6}
1.
"I wish I could have more respect for myself. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se09=====

se09:  All in all, I am inclined to feel th     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    10                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se09 {c |}{res}      4194    3.120172    2.274058          1         10
@mean     3.120
@sd     2.274
@min         1
@max        10
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 1242, 1026, 558, 342, 288, 288, 234, 72, 72, 72
@type byte
@label All in all, I am inclined to feel that I am a failure. (strongly disagree=1 to s
@class category
@N_unique 10
@N 4194
 
_@NOTES

se09:
{txt}{p 2 6}
1.
"All in all, I am inclined to feel that I am a failure. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====se10=====

se10:  I take a positive attitude toward my     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     8                      4194
   (8 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}se10 {c |}{res}      4194    2.811159    1.638905          1          8
@mean     2.811
@sd     1.639
@min         1
@max         8
@values 1, 2, 3, 4, 5, 6, 7, 8
@names "1", "2", "3", "4", "5", "6", "7", "8"
@freq 1098, 936, 936, 630, 252, 216, 72, 54
@type byte
@label I take a positive attitude toward myself. (strongly disagree=1 to strongly agree
@class category
@N_unique 8
@N 4194
 
_@NOTES

se10:
{txt}{p 2 6}
1.
"I take a positive attitude toward myself. (strongly disagree=1 to strongly agree=10)"
{p_end}
{res} 
=====hostname=====
@example0 client01
@type str8
@label Client computer number - unique within session
@class string
@N_unique 32
@N 4194
 
_@NOTES

hostname:
{txt}{p 2 6}
1.
"Client computer number - unique within session"
{p_end}
{res} 
=====number=====

number:  Participant number unique within s     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 4194      4194          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   .   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}107                 999                      4194
  (41 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}number {c |}{res}      4194    808.0258    132.1263        107        999
@mean   808.026
@sd   132.126
@min       107
@max       999
@example0 958
@histh .00034643, .00017321, .01697492, .00710175, .00017321, .00017321, .0025982, .01264459, .00017321
@histw 119.38889, 614.94446, 714.05554, 738.83331, 837.94446, 912.27777, 937.05554, 961.83331, 986.61108
@type int
@label Participant number unique within session.  9XX = HRV participant
@class other
@N_unique 41
@N 4194
 
_@NOTES

number:
{txt}{p 2 6}
1.
"Participant number unique within session.  9XX = HRV participant"
{p_end}
{res} 
=====session=====

session:  Number of session:  1 through 8       {txt}Number of Observations
{hline 41}   {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #       #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #       #         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     8                      4194
   (8 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}session {c |}{res}      4194    4.459227    2.265763          1          8
@mean     4.459
@sd     2.266
@min     1.000
@max     8.000
@values 1, 2, 3, 4, 5, 6, 7, 8
@names "1", "2", "3", "4", "5", "6", "7", "8"
@freq 522, 504, 576, 540, 522, 540, 486, 504
@type float
@label Number of session:  1 through 8
@class category
@N_unique 8
@N 4194
 
_@NOTES

session:
{txt}{p 2 6}
1.
"Number of session:  1 through 8"
{p_end}
{res} 
=====subjectid=====

subjectid:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#       #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #       #         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}101                 832                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}subjectid {c |}{res}      4194    472.0086    223.7743        101        832
@mean   472.009
@sd   223.774
@min   101.000
@max   832.000
@example0 101
@histh .00317045, .00211363, .00084545, .00042273, .00295908, .00211363, .00042273, .00084545, .00253636, .00295908, .00042273, .00105682, .0040159, .00126818, .00126818, .0040159, .00084545, .00359317, .00274772, .00190227, .00338181, .00042273, .00232499, .00359317
@histw 111.15278, 151.76389, 172.06944, 192.375, 212.68056, 253.29167, 273.59723, 293.90277, 314.20834, 354.81946, 375.125, 395.43054, 415.73611, 436.04166, 496.95834, 517.26392, 537.56946, 639.09723, 659.40277, 700.01392, 720.31946, 740.625, 801.54169, 821.84723
@type float
@label 
@class other
@N_unique .
@N 4194
 
_@NOTES
 
=====screentime=====

screentime:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4194         5       4189
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194         5       4189
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2.309           115.253                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}screentime {c |}{res}      4194    9.784833    7.200423      2.309    115.253
@mean     9.785
@sd     7.200
@min     2.309
@max   115.253
@example0 8.4860001
@histh .06763958, .11589929, .05988763, .03351579, .0162639, .00790395, .00562397, .00311598, .00189999, .00189999, .00091199, .00076, .000684, .00083599, .000532, .000076, .000532, .000076, .000076, .000152, .000076, .000076, .000076, .000076, .000076, .000076
@histw 3.8776667, 7.0149999, 10.152333, 13.289666, 16.427, 19.564333, 22.701666, 25.838999, 28.976334, 32.113667, 35.250999, 38.388332, 41.525665, 44.662998, 47.800331, 50.937668, 54.075001, 57.212334, 60.349667, 63.487, 66.624329, 69.761665, 72.899002, 79.173668, 91.723, 113.68433
@type float
@label 
@class other
@N_unique .
@N 4194
 
_@NOTES
 
=====raceid=====

raceid:  Race identifier, unique across all     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#       #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #       #         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}10101             83206                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}raceid {c |}{res}      4194    47204.36    22377.43      10101      83206
@mean 47204.358
@sd 22377.430
@min 10101.000
@max 83206.000
@example0 10101
@histh .0000317, .00002113, 8.454e-06, 4.227e-06, .00002959, .00002113, 4.227e-06, 8.454e-06, .00002536, .00002959, 4.227e-06, .00001057, .00004016, .00001268, .00001268, .00004016, 8.454e-06, .00003593, .00002748, .00001902, .00003382, 4.227e-06, .00002325, .00003593
@histw 11116.348, 15177.736, 17208.43, 19239.125, 21269.82, 25331.209, 27361.902, 29392.598, 31423.291, 35484.68, 37515.375, 39546.07, 41576.766, 43607.457, 49699.543, 51730.234, 53760.93, 63914.402, 65945.094, 70006.484, 72037.18, 74067.875, 80159.961, 82190.656
@type float
@label Race identifier, unique across all sessions
@class other
@N_unique .
@N 4194
 
_@NOTES

raceid:
{txt}{p 2 6}
1.
"Race identifier, unique across all sessions"
{p_end}
{res} 
=====pitstopnum=====

pitstopnum:  Pitstop                            {txt}Number of Observations
{hline 20}                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#   #   #                 {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     3                      4194
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}pitstopnum {c |}{res}      4194           2    .8165939          1          3
@mean     2.000
@sd     0.817
@min     1.000
@max     3.000
@values 1, 2, 3
@names "1", "2", "3"
@freq 1398, 1398, 1398
@type float
@label Pitstop
@class category
@N_unique 3
@N 4194
 
_@NOTES

pitstopnum:
{txt}{p 2 6}
1.
"Number of current pitstop (1, 2, or 3)"
{p_end}
{res} 
=====pitstopid=====

pitstopid:  Pitstop identifier, unique acro     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#       #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #       #         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1010101         8320603                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}pitstopid {c |}{res}      4194     4720438     2237743    1010101    8320603
@mean  4.72e+06
@sd  2.24e+06
@min  1.01e+06
@max  8.32e+06
@example0 1010101
@histh 3.170e-07, 2.113e-07, 8.454e-08, 4.227e-08, 2.959e-07, 2.113e-07, 4.227e-08, 8.454e-08, 2.536e-07, 2.959e-07, 4.227e-08, 1.057e-07, 4.016e-07, 1.268e-07, 1.268e-07, 4.016e-07, 8.454e-08, 3.593e-07, 2.748e-07, 1.902e-07, 3.382e-07, 4.227e-08, 2.325e-07, 3.593e-07
@histw 1111635.8, 1517774.8, 1720844.3, 1923913.8, 2126983.3, 2533122.3, 2736191.8, 2939261.3, 3142330.8, 3548469.8, 3751539.3, 3954608.8, 4157678.3, 4360748, 4969956, 5173026, 5376095, 6391443, 6594512, 7000651, 7203721, 7406790, 8015999, 8219068
@type float
@label Pitstop identifier, unique across all sessions
@class other
@N_unique .
@N 4194
 
_@NOTES

pitstopid:
{txt}{p 2 6}
1.
"Pitstop identifier, unique across all sessions"
{p_end}
{res} 
=====failrate=====

failrate:  Fail rate of the car                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero           {res}    3         3          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 3897         3       3894
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 3900         6       3894
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing        {res}  294
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0              4.000811                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}failrate {c |}{res}      3900    1.235291    .9052245          0   4.000811
@mean     1.235
@sd     0.905
@min     0.000
@max     4.001
@example0 1.8554925
@histh .05383524, .24225859, .46432897, .57199949, .69312876, .40376434, .76715225, .58545828, .93538737, .41722313, .47778779, .32974088, .28263503, .49124661, .30955264, .2557174, .18169394, .30282325, .07402346, .02018822, .05383524, .02691762, .06729405, .02018822, .05383524, .02691762, .06056465, .03364703, .02691762, .00672941, .02691762, .00672941, .03364703, .03364703, .41049373
@histw .05715444, .17146331, .28577217, .40008107, .51438993, .62869883, .74300766, .85731655, .97162545, 1.0859343, 1.2002432, 1.3145521, 1.4288609, 1.5431699, 1.6574787, 1.7717875, 1.8860965, 2.0004053, 2.1147141, 2.229023, 2.3433321, 2.4576409, 2.5719497, 2.6862586, 2.8005674, 2.9148762, 3.0291853, 3.1434941, 3.257803, 3.3721118, 3.4864206, 3.6007295, 3.7150385, 3.8293474, 3.9436562
@type float
@label Fail rate of the car
@class other
@N_unique .
@N 3900
 
_@NOTES

failrate:
{txt}{p 2 6}
1.
"Chosen engine-failure rate of car (expected number of times per 5 laps)"
{p_end}
{res} 
=====risk=====

risk:  Risk-aversion (HL)                       {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero           {res}  126       126          -
{txt}{c |}          {res}#   #             {txt}Positive       {res} 4068      4068          -
{txt}{c |}          {res}#   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #             {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     9                      4194
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}risk {c |}{res}      4194    5.515021    1.782574          0          9
@mean     5.515
@sd     1.783
@min     0.000
@max     9.000
@values 0, 1, 2, 3, 4, 5, 6, 7, 8, 9
@names "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"
@freq 126, 54, 18, 180, 360, 1548, 720, 648, 396, 144
@type float
@label Risk-aversion (HL)
@class category
@N_unique 10
@N 4194
 
_@NOTES

risk:
{txt}{p 2 6}
1.
"Risk aversion as measured by lottery: 0=Least risk averse, 9=Most risk averse"
{p_end}
{res} 
=====dropout_dummy=====

dropout_dummy:  1 if participant dropped ou     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     2                      4194
   (2 unique values)

      {txt}dropout_dummy is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
dropout_du~y {c |}{res}      4194    1.142108    .3492023          1          2
@mean     1.142
@sd     0.349
@min         1
@max         2
@values 1, 2
@names "false", "true"
@freq 3598, 596
@type long
@label 1 if participant dropped out, 0 otherwise
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

dropout_dummy:
{txt}{p 2 6}
1.
"1 if participant dropped out, 0 otherwise"
{p_end}
{res} 
=====BMI=====

BMI:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4194        54       4140
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194        54       4140
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}11.71875       61.72839                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}BMI {c |}{res}      4194    22.56614    5.277887   11.71875   61.72839
@mean    22.566
@sd     5.278
@min    11.719
@max    61.728
@example0 21.718065
@histh .00308953, .00308953, .0092686, .07105926, .13593945, .12667085, .09577552, .11122318, .06179066, .0278058, .02471626, .01235813, .0092686, .00617907, .00308953, .00308953, .00308953, .00617907, .00308953, .00308953
@histw 12.413328, 15.191642, 16.580799, 17.969955, 19.359112, 20.748268, 22.137426, 23.526583, 24.915739, 26.304895, 27.694054, 29.08321, 30.472366, 31.861523, 34.639835, 37.418152, 40.196465, 45.75309, 51.309719, 61.033813
@type float
@label 
@class other
@N_unique .
@N 4194
 
_@NOTES
 
=====alcohol_dummy=====

alcohol_dummy:  Alcohol                         {txt}Number of Observations
{hline 23}                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2556      2556          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1638      1638          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
alcohol_du~y {c |}{res}      4194    .3905579    .4879336          0          1
@mean     0.391
@sd     0.488
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2556, 1638
@type float
@label Alcohol
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====sessiontype=====
@freq 1026, 1062, 1080, 1026
@values "baseline", "high-stakes", "low-stakes", "wealth"
@type str11
@label Type (treatment) of session:  baseline, high-stakes, wealth, low-stakes
@class category
@N_unique 4
@N 4194
 
_@NOTES

sessiontype:
{txt}{p 2 6}
1.
"Type (treatment) of session:  baseline, high-stakes, wealth, low-stakes"
{p_end}
{res} 
=====sessiondate=====
@freq 504, 522, 540, 486, 504, 576, 540, 522
@values "Friday AM", "Monday AM", "Thursday AM", "Thursday PM", "Tuesday AM", "Tuesday PM", "Wednesday AM", "Wednesday PM"
@type str12
@label Date and time of session (week of August 30 through Sept 3 2010)
@class category
@N_unique 8
@N 4194
 
_@NOTES

sessiondate:
{txt}{p 2 6}
1.
"Date and time of session (week of August 30 through Sept 3 2010)"
{p_end}
{res} 
=====showupfee=====

showupfee:  Value of show-up fee, in dollar     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5                    20                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}showupfee {c |}{res}      4194    8.669528    6.448829          5         20
@mean     8.670
@sd     6.449
@min     5.000
@max    20.000
@values 5, 20
@names "5", "20"
@freq 3168, 1026
@type float
@label Value of show-up fee, in dollars
@class dummy
@N_unique 2
@N 4194
 
_@NOTES

showupfee:
{txt}{p 2 6}
1.
"Value of show-up fee, in dollars"
{p_end}
{res} 
=====self_esteem_composite=====

self_esteem_composite:  Self Esteem             {txt}Number of Observations
{hline 35}         {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4194       414       3780
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4194       414       3780
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2.4                 8.6                      4194
  (47 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
self_estee~e {c |}{res}      4194    4.675107    1.141733        2.4        8.6
@mean     4.675
@sd     1.142
@min     2.400
@max     8.600
@example0 5.5999999
@histh .14952235, .09968157, .07476117, .07476117, .19936314, .24920392, .2990447, .07476117, .34888548, .37380588, .2990447, .39872628, .42364666, .27412432, .17444274, .34888548, .2990447, .2990447, .27412432, .17444274, .22428353, .07476117, .12460196, .17444274, .17444274, .02492039, .02492039, .02492039, .02492039, .02492039
@histw 2.4861112, 2.6583335, 2.8305557, 3.0027778, 3.1750002, 3.3472223, 3.5194447, 3.6916668, 3.863889, 4.0361114, 4.2083335, 4.3805556, 4.5527778, 4.7250004, 4.8972225, 5.0694447, 5.2416668, 5.4138889, 5.5861115, 5.7583337, 5.9305558, 6.102778, 6.2750001, 6.4472227, 6.6194448, 7.3083339, 7.480556, 7.8250003, 8.169445, 8.5138893
@type float
@label Self Esteem
@class other
@N_unique 47
@N 4194
 
_@NOTES

self_esteem_composite:
{txt}{p 2 6}
1.
"Degree of self-esteem:  1=least to 11=most"
{p_end}
{res} 
=====locus_of_control_composite=====

locus_of_control_composite:  Locus of contr     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Positive       {res} 4194       630       3564
{txt}{c |}      {res}#   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #   #         {txt}Total          {res} 4194       630       3564
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3              10.71429                      4194
  (49 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
locus_of_c~e {c |}{res}      4194    7.540773    1.765279          3   10.71429
@mean     7.541
@sd     1.765
@min     3.000
@max    10.714
@example0 9
@histh .02002861, .02002861, .04005722, .06008584, .04005722, .08011445, .16022889, .10014306, .12017167, .14020029, .16022889, .06008584, .16022889, .22031473, .10014306, .02002861, .28040057, .34048641, .04005722, .12017167, .26037195, .20028612, .24034335, .30042917, .10014306, .30042917, .06008584, .10014306, .24034335, .12017167, .16022889, .10014306, .06008584, .14020029
@histw 3.1071429, 3.3214285, 3.75, 4.1785712, 4.3928571, 4.6071429, 4.8214288, 5.0357141, 5.25, 5.4642859, 5.6785717, 5.8928571, 6.1071429, 6.3214288, 6.5357141, 6.75, 6.9642859, 7.1785717, 7.3928571, 7.6071429, 7.8214288, 8.0357141, 8.25, 8.4642859, 8.6785717, 8.8928576, 9.1071434, 9.3214283, 9.5357141, 9.75, 9.9642859, 10.178572, 10.392858, 10.607143
@type float
@label Locus of control: 1=most internal to 11=most external
@class other
@N_unique 49
@N 4194
 
_@NOTES

locus_of_control_composite:
{txt}{p 2 6}
1.
"Locus of control: 1=most internal to 11=most external"
{p_end}
{res} 
=====SBI_anticipate=====

SBI_anticipate:  SBI Antacipate                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4194       612       3582
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194       612       3582
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1.5                8.25                      4194
  (44 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
SBI_antici~e {c |}{res}      4194    4.367489    1.334974        1.5       8.25
@mean     4.367
@sd     1.335
@min     1.500
@max     8.250
@example0 5.625
@histh .16022889, .02288984, .06866953, .02288984, .18311875, .04577969, .20600858, .11444921, .18311875, .13733906, .36623749, .18311875, .32045779, .20600858, .36623749, .22889842, .29756796, .27467811, .32045779, .06866953, .22889842, .11444921, .41201717, .27467811, .22889842, .11444921, .04577969, .02288984, .02288984, .02288984, .02288984, .02288984, .02288984
@histw 1.59375, 1.78125, 1.96875, 2.15625, 2.34375, 2.53125, 2.71875, 2.90625, 3.09375, 3.28125, 3.46875, 3.65625, 3.84375, 4.03125, 4.21875, 4.40625, 4.59375, 4.78125, 4.96875, 5.15625, 5.34375, 5.53125, 5.71875, 5.90625, 6.09375, 6.28125, 6.84375, 7.21875, 7.40625, 7.59375, 7.78125, 7.96875, 8.15625
@type float
@label SBI Antacipate
@class other
@N_unique 44
@N 4194
 
_@NOTES

SBI_anticipate:
{txt}{p 2 6}
1.
"Degree of ability to obtain pleasure from anticipation: 1=least to 11=most"
{p_end}
{res} 
=====SBI_moment=====

SBI_moment:  SBI Moment                         {txt}Number of Observations
{hline 23}                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4194       594       3600
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4194       594       3600
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1.5                9.25                      4194
  (49 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}SBI_moment {c |}{res}      4194    4.597639    1.342057        1.5       9.25
@mean     4.598
@sd     1.342
@min     1.500
@max     9.250
@example0 5.125
@histh .05980894, .01993631, .03987263, .03987263, .11961789, .11961789, .25917208, .11961789, .09968157, .25917208, .23923577, .35885367, .33891734, .21929947, .25917208, .31898102, .25917208, .05980894, .27910841, .25917208, .23923577, .09968157, .17942683, .09968157, .1395542, .05980894, .03987263, .01993631, .01993631, .01993631
@histw 1.6076388, 1.8229166, 2.0381944, 2.2534723, 2.46875, 2.6840277, 2.8993056, 3.1145833, 3.3298612, 3.5451388, 3.7604167, 3.9756944, 4.1909723, 4.40625, 4.6215277, 4.8368053, 5.0520835, 5.2673612, 5.4826388, 5.6979165, 5.9131947, 6.1284723, 6.34375, 6.5590277, 6.7743053, 7.2048612, 7.4201388, 7.6354165, 7.8506947, 9.1423607
@type float
@label SBI Moment
@class other
@N_unique 49
@N 4194
 
_@NOTES

SBI_moment:
{txt}{p 2 6}
1.
"Degree of ability to obtain pleasure from the present: 1=least to 11=most"
{p_end}
{res} 
=====SBI_reminisce=====

SBI_reminisce:  SBI Reminisce                   {txt}Number of Observations
{hline 29}               {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4194       504       3690
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4194       504       3690
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1.5                 8.5                      4194
  (47 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
SBI_remini~e {c |}{res}      4194    4.207082    1.381479        1.5        8.5
@mean     4.207
@sd     1.381
@min     1.500
@max     8.500
@example0 4.375
@histh .06621704, .0441447, .13243409, .11036174, .08828939, .28694052, .11036174, .30901289, .17657879, .17657879, .52973634, .15450644, .30901289, .28694052, .30901289, .15450644, .33108523, .17657879, .19865113, .19865113, .11036174, .17657879, .15450644, .08828939, .15450644, .0441447, .0441447, .02207235, .02207235, .08828939, .0441447, .02207235, .02207235
@histw 1.5972222, 1.7916666, 1.9861112, 2.1805556, 2.375, 2.5694444, 2.7638888, 2.9583333, 3.1527777, 3.3472223, 3.5416667, 3.7361112, 3.9305556, 4.125, 4.3194447, 4.5138888, 4.7083335, 4.9027777, 5.0972223, 5.2916665, 5.4861112, 5.6805553, 5.875, 6.0694447, 6.2638888, 6.4583335, 6.6527777, 6.8472223, 7.0416665, 7.4305553, 7.8194447, 8.208333, 8.4027777
@type float
@label SBI Reminisce
@class other
@N_unique 47
@N 4194
 
_@NOTES

SBI_reminisce:
{txt}{p 2 6}
1.
"Degree of ability to obtain pleasure from memories: 1=least to 11=most"
{p_end}
{res} 
=====SBI_total=====

SBI_total:  Degree of ability to obtain ple     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4194       162       4032
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 4194       162       4032
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1.5            7.666667                      4194
  (95 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}SBI_total {c |}{res}      4194    4.390737    1.165792        1.5   7.666667
@mean     4.391
@sd     1.166
@min     1.500
@max     7.667
@example0 5.0416665
@histh .0250551, .0250551, .0501102, .12527549, .0250551, .0250551, .0501102, .12527549, .20044079, .32571629, .2756061, .32571629, .22549589, .12527549, .40088159, .40088159, .25055099, .35077137, .40088159, .15033059, .22549589, .30066118, .15033059, .22549589, .30066118, .22549589, .15033059, .17538568, .0501102, .0501102, .0250551, .0250551, .0501102
@histw 1.5856482, 1.7569444, 1.9282408, 2.0995371, 2.2708333, 2.4421296, 2.613426, 2.7847221, 2.9560184, 3.1273148, 3.2986112, 3.4699073, 3.6412036, 3.8125, 3.9837961, 4.1550927, 4.3263888, 4.497685, 4.6689816, 4.8402777, 5.0115738, 5.1828704, 5.3541665, 5.5254626, 5.6967592, 5.8680553, 6.0393519, 6.2106481, 6.3819442, 6.5532408, 6.895833, 7.2384257, 7.5810184
@type float
@label Degree of ability to obtain pleasure in aggregate: 1=least to 11=most
@class other
@N_unique 95
@N 4194
 
_@NOTES

SBI_total:
{txt}{p 2 6}
1.
"Degree of ability to obtain pleasure in aggregate: 1=least to 11=most"
{p_end}
{res} 
=====droppedout=====

droppedout:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3598      3598          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  596       596          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}droppedout {c |}{res}      4194    .1421078    .3492023          0          1
@mean     0.142
@sd     0.349
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 3598, 596
@type float
@label 
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====dropoutfrac=====

dropoutfrac:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3435      3435          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  759       435        324
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      3870        324
{txt}{c |}  {res}#   .   .   .             {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (4 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}dropoutfrac {c |}{res}      4194    .1421078    .3236831          0          1
@mean     0.142
@sd     0.324
@min     0.000
@max     1.000
@values 0, .33333334, .66666669, 1
@names "0", ".3333333432674408", ".6666666865348816", "1"
@freq 3435, 165, 159, 435
@type float
@label 
@class category
@N_unique 4
@N 4194
 
_@NOTES
 
=====runsumdropout=====

runsumdropout:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3598      3598          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  596       596          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .   .   .             {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     3                      4194
   (4 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
runsumdrop~t {c |}{res}      4194    .2584645    .7025938          0          3
@mean     0.258
@sd     0.703
@min     0.000
@max     3.000
@values 0, 1, 2, 3
@names "0", "1", "2", "3"
@freq 3598, 253, 198, 145
@type float
@label 
@class category
@N_unique 4
@N 4194
 
_@NOTES
 
=====sbaseline=====

sbaseline:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3168      3168          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1026      1026          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}sbaseline {c |}{res}      4194    .2446352     .429922          0          1
@mean     0.245
@sd     0.430
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 3168, 1026
@type float
@label 
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====shistakes=====

shistakes:  High Treatment                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3132      3132          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1062      1062          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}shistakes {c |}{res}      4194    .2532189    .4349071          0          1
@mean     0.253
@sd     0.435
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 3132, 1062
@type float
@label High Treatment
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====slostakes=====

slostakes:  Low Treatment                       {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3114      3114          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1080      1080          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}slostakes {c |}{res}      4194    .2575107    .4373152          0          1
@mean     0.258
@sd     0.437
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 3114, 1080
@type float
@label Low Treatment
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====swealth=====

swealth:  Wealth Treatment                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3168      3168          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1026      1026          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}swealth {c |}{res}      4194    .2446352     .429922          0          1
@mean     0.245
@sd     0.430
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 3168, 1026
@type float
@label Wealth Treatment
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====blue=====

blue:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2931      2931          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1263      1263          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}blue {c |}{res}      4194    .3011445    .4588101          0          1
@mean     0.301
@sd     0.459
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2931, 1263
@type float
@label 
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====magenta=====

magenta:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3531      3531          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  663       663          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}magenta {c |}{res}      4194     .158083    .3648623          0          1
@mean     0.158
@sd     0.365
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 3531, 663
@type float
@label 
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====red=====

red:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2751      2751          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1443      1443          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}red {c |}{res}      4194    .3440629    .4751184          0          1
@mean     0.344
@sd     0.475
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2751, 1443
@type float
@label 
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====yellow=====

yellow:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3369      3369          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  825       825          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}yellow {c |}{res}      4194    .1967096    .3975583          0          1
@mean     0.197
@sd     0.398
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 3369, 825
@type float
@label 
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====weekinc_0=====

weekinc_0:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero           {res} 1944      1944          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 2250      2250          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}weekinc_0 {c |}{res}      4194    .5364807    .4987268          0          1
@mean     0.536
@sd     0.499
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1944, 2250
@type float
@label 
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====weekinc_1=====

weekinc_1:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3384      3384          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  810       810          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}weekinc_1 {c |}{res}      4194     .193133    .3948035          0          1
@mean     0.193
@sd     0.395
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 3384, 810
@type float
@label 
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====weekinc_2=====

weekinc_2:  Weekly Income Average               {txt}Number of Observations
{hline 33}           {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3510      3510          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  684       684          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}weekinc_2 {c |}{res}      4194    .1630901    .3694919          0          1
@mean     0.163
@sd     0.369
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 3510, 684
@type float
@label Weekly Income Average
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====weekinc_3=====

weekinc_3:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3744      3744          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  450       450          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}weekinc_3 {c |}{res}      4194    .1072961    .3095263          0          1
@mean     0.107
@sd     0.310
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 3744, 450
@type float
@label 
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====wealth_0=====

wealth_0:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3978      3978          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  216       216          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}wealth_0 {c |}{res}      4194    .0515021     .221046          0          1
@mean     0.052
@sd     0.221
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 3978, 216
@type float
@label 
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====wealth_1=====

wealth_1:  Wealth Level Average                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1206      1206          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2988      2988          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}wealth_1 {c |}{res}      4194    .7124464    .4526758          0          1
@mean     0.712
@sd     0.453
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1206, 2988
@type float
@label Wealth Level Average
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====wealth_2=====

wealth_2:  Wealth Level Poor                    {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3204      3204          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  990       990          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}wealth_2 {c |}{res}      4194    .2360515    .4247048          0          1
@mean     0.236
@sd     0.425
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 3204, 990
@type float
@label Wealth Level Poor
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====dad_school=====

dad_school:  Dad Schooled                       {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  972       972          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 3222      3222          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}dad_school {c |}{res}      4194    .7682403    .4220066          0          1
@mean     0.768
@sd     0.422
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 972, 3222
@type float
@label Dad Schooled
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====mum_school=====

mum_school:  Mum Schooled                       {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1458      1458          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2736      2736          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}mum_school {c |}{res}      4194    .6523605    .4762776          0          1
@mean     0.652
@sd     0.476
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1458, 2736
@type float
@label Mum Schooled
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====dad_qual=====

dad_qual:  Dad Qualified                        {txt}Number of Observations
{hline 24}                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1494      1494          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2700      2700          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}dad_qual {c |}{res}      4194    .6437768    .4789394          0          1
@mean     0.644
@sd     0.479
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1494, 2700
@type float
@label Dad Qualified
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====mum_qual=====

mum_qual:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1764      1764          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 2430      2430          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}mum_qual {c |}{res}      4194    .5793991    .4937144          0          1
@mean     0.579
@sd     0.494
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1764, 2430
@type float
@label 
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====dad_hiqual=====

dad_hiqual:  Dad Qual. Level                    {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2142      2142          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2052      2052          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     2                      4194
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}dad_hiqual {c |}{res}      4194    .6609442     .753379          0          2
@mean     0.661
@sd     0.753
@min     0.000
@max     2.000
@values 0, 1, 2
@names "0", "1", "2"
@freq 2142, 1332, 720
@type float
@label Dad Qual. Level
@class category
@N_unique 3
@N 4194
 
_@NOTES
 
=====mum_hiqual=====

mum_hiqual:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2574      2574          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1620      1620          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   .                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     2                      4194
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}mum_hiqual {c |}{res}      4194     .472103     .648842          0          2
@mean     0.472
@sd     0.649
@min     0.000
@max     2.000
@values 0, 1, 2
@names "0", "1", "2"
@freq 2574, 1260, 360
@type float
@label 
@class category
@N_unique 3
@N 4194
 
_@NOTES
 
=====age=====

age:  Age                                       {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 4194      4194          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}.   #   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}12                   47                      4194
  (21 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}age {c |}{res}      4194    22.12446    3.635852         12         47
@mean    22.124
@sd     3.636
@min    12.000
@max    47.000
@values 12, 15, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 32, 33, 34, 36, 38, 47
@names "12", "15", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "32", "33", "34", "36", "38", "47"
@freq 18, 36, 180, 486, 828, 558, 594, 378, 396, 306, 108, 90, 54, 18, 18, 18, 36, 18, 18, 18, 18
@type float
@label Age
@class category
@N_unique 21
@N 4194
 
_@NOTES
 
=====china=====

china:                                          {txt}Number of Observations
{hline 8}                                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3150      3150          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1044      1044          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}china {c |}{res}      4194     .248927     .432443          0          1
@mean     0.249
@sd     0.432
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 3150, 1044
@type float
@label 
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====aussie=====

aussie:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3492      3492          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  702       702          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}aussie {c |}{res}      4194     .167382    .3733611          0          1
@mean     0.167
@sd     0.373
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 3492, 702
@type float
@label 
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====malay=====

malay:                                          {txt}Number of Observations
{hline 8}                                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 3618      3618          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  576       576          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}malay {c |}{res}      4194    .1373391     .344246          0          1
@mean     0.137
@sd     0.344
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 3618, 576
@type float
@label 
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====lap=====

lap:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#   #   #                 {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   #                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3                     9                      4194
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}lap {c |}{res}      4194           6    2.449782          3          9
@mean     6.000
@sd     2.450
@min         3
@max         9
@values 3, 6, 9
@names "3", "6", "9"
@freq 1398, 1398, 1398
@type byte
@label 
@class category
@N_unique 3
@N 4194
 
_@NOTES
 
=====winpc=====

winpc:  Objectiv prob.                          {txt}Number of Observations
{hline 22}                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4194        91       4103
{txt}{c |}  {res}#               #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194        91       4103
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}7.89e-31              1                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}winpc {c |}{res}      4194    .4367585    .3491584   7.89e-31          1
@mean     0.437
@sd     0.349
@min     0.000
@max     1.000
@example0 .41
@histh 7.0386267, 1.0987124, .95278972, .84978539, .89270389, .80686694, .84978539, .69527894, .7639485, .78969955, .59227467, .73819745, .57510728, .66952789, .832618, .68669528, .72961372, .72103006, .60944206, .80686694, .71244633, .64377683, .69527894, .90128756, .69527894, .7639485, .78111589, .79828328, .70386267, .82403433, .77253217, .64377683, .75536484, .61802578, .99570817, 2.9957082
@histw .01388889, .04166667, .06944445, .09722222, .125, .15277778, .18055555, .20833333, .2361111, .2638889, .29166666, .31944445, .34722221, .375, .40277779, .43055555, .45833334, .4861111, .5138889, .54166669, .56944442, .59722221, .625, .65277779, .68055558, .70833331, .7361111, .7638889, .79166669, .81944442, .84722221, .875, .90277779, .93055558, .95833331, .9861111
@type float
@label Objectiv prob.
@class other
@N_unique .
@N 4194
 
_@NOTES
 
=====sdwin=====

sdwin:  SD of win                               {txt}Number of Observations
{hline 17}                           {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #   #             {txt}Zero           {res}  457       457          -
{txt}{c |}  {res}#       #   #             {txt}Positive       {res} 3737         -       3737
{txt}{c |}  {res}#       #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 4194       457       3737
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                .06915                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}sdwin {c |}{res}      4194    .0300935    .0183715          0     .06915
@mean     0.030
@sd     0.018
@min     0.000
@max     0.069
@example0 .05139435
@histh 65.541405, 13.65446, 13.157934, 10.551173, 10.675305, 8.9374647, 10.054647, 7.6961503, 10.427042, 9.0615959, 9.5581217, 9.6822529, 10.054647, 8.1926756, 12.289014, 14.647511, 14.026855, 17.502535, 20.854084, 23.584976, 23.957371, 25.322817, 26.564131, 29.170891, 23.212582, 25.322817, 20.729952, 16.633615, 9.1857271, 8.4409389, 4.9652581, 3.8480752, 1.4895774, .86892015, .49652582, .24826291
@histw .00096042, .00288125, .00480208, .00672292, .00864375, .01056458, .01248542, .01440625, .01632708, .01824792, .02016875, .02208959, .02401042, .02593125, .02785209, .02977292, .03169375, .03361459, .03553542, .03745626, .03937709, .04129792, .04321875, .04513959, .04706042, .04898126, .05090209, .05282292, .05474376, .05666459, .05858542, .06050626, .06242709, .06434792, .06626876, .06818959
@type float
@label SD of win
@class other
@N_unique .
@N 4194
 
_@NOTES
 
=====expectation_r=====

expectation_r:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero           {res}   78        78          -
{txt}{c |}          {res}#   #   #         {txt}Positive       {res} 4116       369       3747
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194       447       3747
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                    10                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
expectatio~r {c |}{res}      4194    6.015651     2.75599          0         10
@mean     6.016
@sd     2.756
@min     0.000
@max    10.000
@example0 8.6300001
@histh .16223176, .0360515, .02832618, .09270386, .01802575, .02832618, .0360515, .11845493, .03347639, .03090129, .06180257, .04635193, .05665236, .03347639, .08240344, .02575107, .02060086, .20085837, .19570816, .04377683, .04377683, .26523605, .07982833, .05922747, .09012876, .25751072, .06952789, .13133048, .42231759, .10042918, .08497854, .08755365, .24978541, .0360515, .07467811, .19570816
@histw .1388889, .41666666, .69444442, .97222221, 1.25, 1.5277778, 1.8055556, 2.0833333, 2.3611112, 2.6388888, 2.9166667, 3.1944444, 3.4722223, 3.75, 4.0277777, 4.3055553, 4.5833335, 4.8611112, 5.1388888, 5.4166665, 5.6944447, 5.9722223, 6.25, 6.5277777, 6.8055553, 7.0833335, 7.3611112, 7.6388888, 7.9166665, 8.1944447, 8.4722223, 8.75, 9.0277777, 9.3055553, 9.583333, 9.8611107
@type float
@label 
@class other
@N_unique .
@N 4194
 
_@NOTES
 
=====psexpectation_r=====

psexpectation_r:                                {txt}Number of Observations
{hline 18}                          {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #   #   #         {txt}Zero           {res}  166       166          -
{txt}{c |}  {res}#       #   #   #         {txt}Positive       {res} 4028       324       3704
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194       490       3704
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                    10                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
psexpectat~r {c |}{res}      4194    5.211361    3.135534          0         10
@mean     5.211
@sd     3.136
@min     0.000
@max    10.000
@example0 8.9200001
@histh .32103005, .08497854, .05751073, .14248927, .03690987, .04206008, .05407725, .12789699, .03261803, .0472103, .12274678, .05665236, .04806867, .03690987, .1167382, .03519313, .0583691, .16223176, .1751073, .06609442, .05321888, .19484979, .05493562, .06781116, .07296138, .2, .06609442, .07553648, .23433477, .07038627, .06008584, .05579399, .19914164, .05665236, .07038627, .24291846
@histw .1388889, .41666666, .69444442, .97222221, 1.25, 1.5277778, 1.8055556, 2.0833333, 2.3611112, 2.6388888, 2.9166667, 3.1944444, 3.4722223, 3.75, 4.0277777, 4.3055553, 4.5833335, 4.8611112, 5.1388888, 5.4166665, 5.6944447, 5.9722223, 6.25, 6.5277777, 6.8055553, 7.0833335, 7.3611112, 7.6388888, 7.9166665, 8.1944447, 8.4722223, 8.75, 9.0277777, 9.3055553, 9.583333, 9.8611107
@type float
@label 
@class other
@N_unique .
@N 4194
 
_@NOTES
 
=====winpc_r=====

winpc_r:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  366       366          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 3828       105       3723
{txt}{c |}  {res}#               #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194       471       3723
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                    10                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}winpc_r {c |}{res}      4194    4.367585    3.491584          0         10
@mean     4.368
@sd     3.492
@min     0.000
@max    10.000
@example0 4.0999999
@histh .70386267, .10987125, .09527897, .08497854, .08927038, .0806867, .08497854, .06952789, .07639485, .07896996, .05922747, .07381974, .05751073, .06695279, .0832618, .06866953, .07296138, .072103, .06094421, .0806867, .07124463, .06437768, .06952789, .09012876, .06952789, .07639485, .07811159, .07982833, .07038627, .08240344, .07725322, .06437768, .07553648, .06180257, .09957082, .29957083
@histw .1388889, .41666666, .69444442, .97222221, 1.25, 1.5277778, 1.8055556, 2.0833333, 2.3611112, 2.6388888, 2.9166667, 3.1944444, 3.4722223, 3.75, 4.0277777, 4.3055553, 4.5833335, 4.8611112, 5.1388888, 5.4166665, 5.6944447, 5.9722223, 6.25, 6.5277777, 6.8055553, 7.0833335, 7.3611112, 7.6388888, 7.9166665, 8.1944447, 8.4722223, 8.75, 9.0277777, 9.3055553, 9.583333, 9.8611107
@type float
@label 
@class other
@N_unique .
@N 4194
 
_@NOTES
 
=====expectconf=====

expectconf:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  171       171          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4022       643       3379
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4193       814       3379
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}    1
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  1000                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}expectconf {c |}{res}      4193    396.1276    302.3422          0       1000
@mean   396.128
@sd   302.342
@min     0.000
@max  1000.000
@example0 847.40002
@histh .0043358, .00116766, .00119342, .00128786, .00093585, .00139089, .00116766, .00116766, .00183735, .0012621, .00115049, .00074696, .00116766, .0007813, .00089292, .00087575, .00068686, .00157119, .00066969, .00059242, .00086716, .00060959, .00092726, .00101312, .00054949, .00075554, .00035202, .00051514, .0006611, .0009015, .0004207, .0004207, .00059242, .00021464, .00041212, .00190603
@histw 13.888889, 41.666668, 69.444443, 97.222221, 125, 152.77777, 180.55556, 208.33333, 236.11111, 263.88889, 291.66666, 319.44446, 347.22223, 375, 402.77777, 430.55554, 458.33334, 486.11111, 513.88892, 541.66669, 569.44446, 597.22223, 625, 652.77777, 680.55554, 708.33331, 736.11108, 763.88892, 791.66669, 819.44446, 847.22223, 875, 902.77777, 930.55554, 958.33331, 986.11108
@type float
@label 
@class other
@N_unique .
@N 4193
 
_@NOTES
 
=====fracbet=====

fracbet:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero           {res}    3         3          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4191         9       4182
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4194        12       4182
{txt}{c |}  {res}#   #   #   .   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0              1.000203                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}fracbet {c |}{res}      4194    .3225254    .2485915          0   1.000203
@mean     0.323
@sd     0.249
@min     0.000
@max     1.000
@example0 .46387312
@histh .20596685, 1.05558, 1.9566851, 2.2398894, 2.9607735, 1.5190054, 2.4458563, 2.6003313, 2.9607735, 2.4458563, 1.7507181, 1.5447513, 1.05558, 1.9566851, 1.05558, 1.0813259, .79812151, .97834253, .74662983, .20596685, .15447514, .18022099, .05149171, .20596685, .15447514, .15447514, .15447514, .15447514, .15447514, .07723757, .02574586, .12872928, .12872928, .28320441, 2.4201105
@histw .0138917, .04167511, .06945851, .09724192, .12502533, .15280874, .18059215, .20837556, .23615897, .26394236, .29172578, .31950918, .3472926, .375076, .40285939, .43064281, .45842621, .48620963, .51399302, .54177642, .56955987, .59734327, .62512666, .65291005, .68069345, .7084769, .73626029, .76404369, .79182708, .81961054, .84739393, .87517732, .93074411, .95852757, .98631096
@type float
@label 
@class other
@N_unique .
@N 4194
 
_@NOTES
 
=====fracexpect=====

fracexpect:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}   82        82          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 3746        83       3663
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 3828       165       3663
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  366
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  2940                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}fracexpect {c |}{res}      3828    20.68221    150.5516          0       2940
@mean    20.682
@sd   150.552
@min     0.000
@max  2940.000
@example0 2.1756098
@histh .01149114, .00017727, .00005598, .00003732, .00002177, 9.330e-06, 9.330e-06, .00001244, 3.110e-06, 9.330e-06, .00001866, 3.110e-06, 3.110e-06, 6.220e-06, 9.330e-06, 6.220e-06, 3.110e-06, 9.330e-06, 3.110e-06, 6.220e-06, 3.110e-06, 6.220e-06
@histw 42, 126, 210, 294, 378, 462, 546, 630, 714, 798, 882, 966, 1050, 1302, 1470, 1554, 1890, 2142, 2310, 2394, 2730, 2898
@type float
@label 
@class other
@N_unique .
@N 3828
 
_@NOTES
 
=====overconf=====

overconf:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative       {res} 1551        10       1541
{txt}{c |}          {res}#                 {txt}Zero           {res}  104       104          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 2539        11       2528
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #             {txt}Total          {res} 4194       125       4069
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}-9.953333            10                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}overconf {c |}{res}      4194     .843776    3.186557  -9.953333         10
@mean     0.844
@sd     3.187
@min    -9.953
@max    10.000
@example0 4.8200002
@histh .00387169, .00258113, .00301132, .00258113, .00817358, .01075471, .01677734, .00473207, .01376603, .02366036, .0258113, .0369962, .04689053, .04861128, .06839994, .08947917, .10969803, .20778096, .19272438, .12948669, .12088292, .12475462, .08001503, .08302635, .06194712, .04990185, .06108674, .0404377, .03398488, .01978866, .02279998, .01333584, .01548678, .0073132, .01032452, .01333584
@histw -9.6762037, -9.1219444, -8.5676851, -8.0134258, -7.4591665, -6.9049072, -6.3506479, -5.7963886, -5.2421293, -4.68787, -4.1336107, -3.5793517, -3.0250924, -2.4708331, -1.9165738, -1.3623146, -.80805534, -.25379607, .30046317, .85472244, 1.4089817, 1.9632409, 2.5175002, 3.0717595, 3.6260188, 4.1802778, 4.7345371, 5.2887964, 5.8430557, 6.397315, 6.9515743, 7.5058336, 8.0600929, 8.6143522, 9.1686115, 9.7228708
@type float
@label 
@class other
@N_unique .
@N 4194
 
_@NOTES
 
=====low_accuracy=====

low_accuracy:                                   {txt}Number of Observations
{hline 15}                             {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  104       104          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4090        21       4069
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194       125       4069
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                    10                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
low_accuracy {c |}{res}      4194    2.433563    2.223202          0         10
@mean     2.434
@sd     2.223
@min     0.000
@max    10.000
@example0 4.8200002
@histh .50815451, .29098713, .2360515, .24291846, .22918455, .18969958, .20171674, .18197425, .12961373, .12703863, .15107296, .11158799, .09871244, .09356223, .09012876, .06266095, .07982833, .09012876, .06180257, .04635193, .03776824, .04034335, .03433476, .03862661, .03175966, .03519313, .0223176, .02060086, .01974249, .01545064, .01030043, .01030043, .01545064, .0111588, .01373391, .01974249
@histw .1388889, .41666666, .69444442, .97222221, 1.25, 1.5277778, 1.8055556, 2.0833333, 2.3611112, 2.6388888, 2.9166667, 3.1944444, 3.4722223, 3.75, 4.0277777, 4.3055553, 4.5833335, 4.8611112, 5.1388888, 5.4166665, 5.6944447, 5.9722223, 6.25, 6.5277777, 6.8055553, 7.0833335, 7.3611112, 7.6388888, 7.9166665, 8.1944447, 8.4722223, 8.75, 9.0277777, 9.3055553, 9.583333, 9.8611107
@type float
@label 
@class other
@N_unique .
@N 4194
 
_@NOTES
 
=====winsd=====

winsd:                                          {txt}Number of Observations
{hline 8}                                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative       {res} 1479         -       1479
{txt}{c |}          {res}#                 {txt}Zero           {res}    1         1          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 2257         1       2256
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#                 {txt}Total          {res} 3737         2       3735
{txt}{c |}  {res}.   .   #   .   .         {txt}Missing        {res}  457
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}-505.9136      536.5856                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}winsd {c |}{res}      3737    5.618306    38.31589  -505.9136   536.5856
@mean     5.618
@sd    38.316
@min  -505.914
@max   536.586
@example0 9.3784637
@histh 8.984e-06, 8.984e-06, .00001797, 8.984e-06, .00003594, .00004492, .00008086, .00025155, .00053904, .01310764, .01727621, .00114097, .00036834, .0002246, .00014374, .00007187, .00006289, .00003594, 8.984e-06, .00002695, .00001797, .00002695, .00001797, .00001797, 8.984e-06, .00001797
@histw -491.02072, -342.09229, -282.5209, -193.16383, -163.37814, -133.59245, -103.80676, -74.021072, -44.235382, -14.449692, 15.335999, 45.121689, 74.907379, 104.69307, 134.47876, 164.26445, 194.05014, 223.83583, 253.62152, 283.4072, 342.97858, 372.76428, 402.54996, 432.33566, 491.90704, 521.69275
@type float
@label 
@class other
@N_unique .
@N 3737
 
_@NOTES
 
=====pse=====

pse:  Subjective prob.                          {txt}Number of Observations
{hline 22}                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #   #   #         {txt}Zero           {res}  166       166          -
{txt}{c |}  {res}#       #   #   #         {txt}Positive       {res} 4028       144       3884
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4194       310       3884
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}pse {c |}{res}      4194    .5211361    .3135534          0          1
@mean     0.521
@sd     0.314
@min     0.000
@max     1.000
@example0 .89200002
@histh 3.2103004, .84978539, .57510728, 1.4248927, .36909872, .42060086, .54077256, 1.27897, .32618025, .472103, 1.2274678, .56652361, .48068669, .36909872, 1.167382, .35193133, .583691, 1.6223176, 1.751073, .66094422, .53218883, 1.9484979, .54935622, .67811161, .72961372, 2, .66094422, .75536484, 2.3433475, .70386267, .60085839, .55793989, 1.9914163, .56652361, .70386267, 2.4291844
@histw .01388889, .04166667, .06944445, .09722222, .125, .15277778, .18055555, .20833333, .2361111, .2638889, .29166666, .31944445, .34722221, .375, .40277779, .43055555, .45833334, .4861111, .5138889, .54166669, .56944442, .59722221, .625, .65277779, .68055558, .70833331, .7361111, .7638889, .79166669, .81944442, .84722221, .875, .90277779, .93055558, .95833331, .9861111
@type float
@label Subjective prob.
@class other
@N_unique .
@N 4194
 
_@NOTES
 
=====female=====

female:  Gender (female=1)                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1890      1890          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 2304      2304          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4194
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}female {c |}{res}      4194    .5493562    .4976173          0          1
@mean     0.549
@sd     0.498
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1890, 2304
@type float
@label Gender (female=1)
@class dummy
@N_unique 2
@N 4194
 
_@NOTES
 
=====age2=====

age2:  Age$^2$                                  {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4194      4194          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4194      4194          -
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}144                2209                      4194
  (21 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}age2 {c |}{res}      4194    502.7082    195.5189        144       2209
@mean   502.708
@sd   195.519
@min   144.000
@max  2209.000
@values 144, 225, 324, 361, 400, 441, 484, 529, 576, 625, 676, 729, 784, 841, 900, 1024, 1089, 1156, 1296, 1444, 2209
@names "144", "225", "324", "361", "400", "441", "484", "529", "576", "625", "676", "729", "784", "841", "900", "1024", "1089", "1156", "1296", "1444", "2209"
@freq 18, 36, 180, 486, 828, 558, 594, 378, 396, 306, 108, 90, 54, 18, 18, 18, 36, 18, 18, 18, 18
@type float
@label Age$^2$
@class category
@N_unique 21
@N 4194
 
_@NOTES
 
{com}. 
. // noi profiler report
. // profiler off
. {c )-}
{txt}
{com}. 
. exit, clear STATA
