{smcl}
{txt}{sf}{ul off}

{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. cap noi {c -(}
. 
. use  "/Users/mas/Dropbox/National_Pride_Large_Data/Data/EVC_data/WORLDBANK/worldbank_Indicator_en_csv_v2.dta"
. 
. describe, short

{txt}Contains data from {res}/Users/mas/Dropbox/National_Pride_Large_Data/Data/EVC_data/WORLDBANK/worldbank_Indicator_en_csv_v2.dta
{txt}  obs:{res}           260                          
{txt} vars:{res}            59                          23 Sep 2015 19:14
{txt} size:{res}        88,140                          
{txt}Sorted by:  
{com}. 
. local N = r(N)
. local variables = r(k)
. 
. di "@N `N'"
{res}@N 260
{com}. di "@variables `variables'"
{res}@variables 59
{com}. 
. datasignature
  {res}260:59(96892):1798849092:1530843878
{com}. local datasig = "`r(datasignature)'"
. 
. di "@datasignature `datasig'"
{res}@datasignature 260:59(96892):1798849092:1530843878
{com}. 
. cap noi xtset
{err}panel variable not set; use {bf:xtset} {it:varname} ...
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
.     di "@panelvar `r(panelvar)'"
. {c )-}
. 
. notes _dta
{res}{com}. 
. qui {c -(}
. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====v1=====
@example0 ï»¿"Data Source"
@type str52
@label 
@class identifier
@N_unique 260
@N 260
{res} 
_@NOTES
 
=====v2=====
@example0 World Development Indicators
@type str28
@label 
@class identifier
@N_unique 260
@N 260
 
_@NOTES
 
=====v3=====
@freq 1, 258
@values "Indicator Name", "Public spending on education, total (% of government expenditure)"
@type str65
@label 
@class dummy
@N_unique 2
@N 259
 
_@NOTES
 
=====v4=====
@freq 1, 258
@values "Indicator Code", "SE.XPD.TOTL.GB.ZS"
@type str17
@label 
@class dummy
@N_unique 2
@N 259
 
_@NOTES
 
=====v5=====

v5:                                             {txt}Number of Observations
{hline 5}                                       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1960                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 10}v5 {c |}{res}         1        1960           .       1960       1960
@mean      1960
@sd         .
@min      1960
@max      1960
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v6=====

v6:                                             {txt}Number of Observations
{hline 5}                                       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1961                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 10}v6 {c |}{res}         1        1961           .       1961       1961
@mean      1961
@sd         .
@min      1961
@max      1961
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v7=====

v7:                                             {txt}Number of Observations
{hline 5}                                       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1962                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 10}v7 {c |}{res}         1        1962           .       1962       1962
@mean      1962
@sd         .
@min      1962
@max      1962
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v8=====

v8:                                             {txt}Number of Observations
{hline 5}                                       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1963                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 10}v8 {c |}{res}         1        1963           .       1963       1963
@mean      1963
@sd         .
@min      1963
@max      1963
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v9=====

v9:                                             {txt}Number of Observations
{hline 5}                                       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1964                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 10}v9 {c |}{res}         1        1964           .       1964       1964
@mean      1964
@sd         .
@min      1964
@max      1964
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v10=====

v10:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1965                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v10 {c |}{res}         1        1965           .       1965       1965
@mean      1965
@sd         .
@min      1965
@max      1965
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v11=====

v11:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1966                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v11 {c |}{res}         1        1966           .       1966       1966
@mean      1966
@sd         .
@min      1966
@max      1966
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v12=====

v12:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1967                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v12 {c |}{res}         1        1967           .       1967       1967
@mean      1967
@sd         .
@min      1967
@max      1967
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v13=====

v13:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1968                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v13 {c |}{res}         1        1968           .       1968       1968
@mean      1968
@sd         .
@min      1968
@max      1968
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v14=====

v14:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1969                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v14 {c |}{res}         1        1969           .       1969       1969
@mean      1969
@sd         .
@min      1969
@max      1969
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v15=====

v15:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1970                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v15 {c |}{res}         1        1970           .       1970       1970
@mean      1970
@sd         .
@min      1970
@max      1970
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v16=====

v16:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1971                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v16 {c |}{res}         1        1971           .       1971       1971
@mean      1971
@sd         .
@min      1971
@max      1971
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v17=====

v17:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1972                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v17 {c |}{res}         1        1972           .       1972       1972
@mean      1972
@sd         .
@min      1972
@max      1972
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v18=====

v18:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1973                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v18 {c |}{res}         1        1973           .       1973       1973
@mean      1973
@sd         .
@min      1973
@max      1973
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v19=====

v19:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1974                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v19 {c |}{res}         1        1974           .       1974       1974
@mean      1974
@sd         .
@min      1974
@max      1974
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v20=====

v20:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1975                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v20 {c |}{res}         1        1975           .       1975       1975
@mean      1975
@sd         .
@min      1975
@max      1975
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v21=====

v21:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1976                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v21 {c |}{res}         1        1976           .       1976       1976
@mean      1976
@sd         .
@min      1976
@max      1976
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v22=====

v22:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1977                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v22 {c |}{res}         1        1977           .       1977       1977
@mean      1977
@sd         .
@min      1977
@max      1977
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v23=====

v23:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1978                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v23 {c |}{res}         1        1978           .       1978       1978
@mean      1978
@sd         .
@min      1978
@max      1978
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v24=====

v24:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    1         1          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Missing        {res}  259
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1979                                          260
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v24 {c |}{res}         1        1979           .       1979       1979
@mean      1979
@sd         .
@min      1979
@max      1979
@values .
@type int
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====v25=====

v25:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   10         1          9
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   10         1          9
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  250
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}9.52143            1980                       260
  (10 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v25 {c |}{res}        10    208.1786    622.5558    9.52143       1980
@mean   208.179
@sd   622.556
@min     9.521
@max  1980.000
@example0 .
@histh .00137023, .00015225
@histw 337.93454, 1651.5869
@type float
@label 
@class identifier
@N_unique 10
@N 10
 
_@NOTES
 
=====v26=====

v26:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   18         1         17
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   18         1         17
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  242
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.67927            1981                       260
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v26 {c |}{res}        18    120.7983    464.2536    5.67927       1981
@mean   120.798
@sd   464.254
@min     5.679
@max  1981.000
@values 5.6792698, 6.8727198, 7.7481399, 8.9407797, 9.9140596, 10.63638, 10.79509, 10.82293, 11.63693, 12.0467, 12.89895, 12.9548, 12.98505, 14.12946, 14.61923, 16.07, 1981
@names "5.679269790649414", "6.872719764709473", "7.74813985824585", "8.940779685974121", "9.914059638977051", "10.63638019561768", "10.79508972167969", "10.82293033599854", "11.63693046569824", "12.04669952392578", "12.89894962310791", "12.95479965209961", "12.98505020141602", "14.12946033477783", "14.61923027038574", "16.06999969482422", "1981"
@freq 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1
@type float
@label 
@class category
@N_unique 17
@N 18
 
_@NOTES
 
=====v27=====

v27:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   19         1         18
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   19         1         18
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  241
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.53752            1982                       260
  (18 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v27 {c |}{res}        19    115.2008    452.0799    5.53752       1982
@mean   115.201
@sd   452.080
@min     5.538
@max  1982.000
@values 5.5375199, 6.8522401, 7.1534901, 7.3715401, 9.0267496, 9.3879099, 9.9033003, 10.24119, 10.6293, 11.84817, 13.12665, 13.37311, 13.83194, 14.47504, 14.57515, 15.63184, 19.27578, 1982
@names "5.537519931793213", "6.852240085601807", "7.15349006652832", "7.371540069580078", "9.026749610900879", "9.387909889221191", "9.903300285339355", "10.24118995666504", "10.62930011749268", "11.84817028045654", "13.12664985656738", "13.37310981750488", "13.83193969726563", "14.47504043579102", "14.57514953613281", "15.63183975219727", "19.27577972412109", "1982"
@freq 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1
@type float
@label 
@class category
@N_unique 18
@N 19
 
_@NOTES
 
=====v28=====

v28:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   20         1         19
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   20         1         19
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  240
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.26063            1983                       260
  (19 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v28 {c |}{res}        20    111.2274    440.5914    5.26063       1983
@mean   111.227
@sd   440.591
@min     5.261
@max  1983.000
@values 5.2606301, 6.8721299, 7.3994098, 9.8259802, 10.02139, 10.47023, 10.71068, 11.44925, 11.69784, 13.00258, 13.17164, 13.18845, 13.92048, 14.77622, 14.89639, 16.97831, 18.996059, 24.98954, 1983
@names "5.260630130767822", "6.872129917144775", "7.399409770965576", "9.825980186462402", "10.02138996124268", "10.47023010253906", "10.71068000793457", "11.44925022125244", "11.69783973693848", "13.00257968902588", "13.17164039611816", "13.18844985961914", "13.9204797744751", "14.77622032165527", "14.89638996124268", "16.97830963134766", "18.99605941772461", "24.98954010009766", "1983"
@freq 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1
@type float
@label 
@class category
@N_unique 19
@N 20
 
_@NOTES
 
=====v29=====

v29:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   21         1         20
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   21         1         20
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  239
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.33735            1984                       260
  (20 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v29 {c |}{res}        21    106.3873     430.232    5.33735       1984
@mean   106.387
@sd   430.232
@min     5.337
@max  1984.000
@values 5.3373499, 7.5023198, 8.3546801, 9.6667805, 9.8372498, 10.37157, 10.647, 10.77153, 11.49215, 12.80466, 13.26538, 13.4014, 14.07662, 14.09869, 14.53131, 14.559915, 15.9044, 16.31517, 23.79278, 1984
@names "5.337349891662598", "7.502319812774658", "8.354680061340332", "9.666780471801758", "9.837249755859375", "10.37156963348389", "10.64700031280518", "10.77153015136719", "11.49215030670166", "12.80465984344482", "13.26537990570068", "13.40139961242676", "14.07662010192871", "14.09869003295898", "14.53131008148193", "14.55991458892822", "15.90439987182617", "16.31517028808594", "23.79277992248535", "1984"
@freq 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1
@type float
@label 
@class category
@N_unique 20
@N 21
 
_@NOTES
 
=====v30=====

v30:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   24         1         23
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   24         1         23
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  236
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}7.86231            1985                       260
  (23 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v30 {c |}{res}        24    95.07311    402.5637    7.86231       1985
@mean    95.073
@sd   402.564
@min     7.862
@max  1985.000
@values 7.8623099, 8.9113998, 9.1052303, 9.3647404, 9.51686, 10.16115, 10.74267, 11.11064, 11.68732, 12.62269, 13.04482, 13.27659, 13.38765, 13.96752, 14.54739, 14.57089, 15.43377, 15.5666, 15.58241, 16.655479, 17.71825, 19.29546, 1985
@names "7.86230993270874", "8.911399841308594", "9.105230331420898", "9.364740371704102", "9.516860008239746", "10.1611499786377", "10.7426700592041", "11.11063957214355", "11.6873197555542", "12.62269020080566", "13.04481983184814", "13.27659034729004", "13.38764953613281", "13.96751976013184", "14.54738998413086", "14.57089042663574", "15.43377017974854", "15.56659984588623", "15.58240985870361", "16.65547943115234", "17.7182502746582", "19.29545974731445", "1985"
@freq 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1
@type float
@label 
@class category
@N_unique 23
@N 24
 
_@NOTES
 
=====v31=====

v31:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   26         1         25
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   26         1         25
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  234
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.1153             1986                       260
  (26 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v31 {c |}{res}        26    87.80862    387.1749     5.1153       1986
@mean    87.809
@sd   387.175
@min     5.115
@max  1986.000
@example0 .
@histh .00242704, .00009708
@histw 203.20377, 1787.9115
@type float
@label 
@class identifier
@N_unique 26
@N 26
 
_@NOTES
 
=====v32=====

v32:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   25         1         24
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   25         1         24
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  235
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.07802            1987                       260
  (24 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v32 {c |}{res}        25     90.3335    395.1549    5.07802       1987
@mean    90.333
@sd   395.155
@min     5.078
@max  1987.000
@values 5.0780201, 7.2985201, 7.4197202, 7.7700701, 7.869, 8.3055296, 8.30791, 9.2789097, 9.8665199, 10.15157, 10.85205, 10.92409, 11.0053, 11.11326, 11.39729, 12.6131, 12.71603, 12.79397, 13.46185, 14.69252, 17.620001, 18.142401, 19.865891, 1987
@names "5.078020095825195", "7.298520088195801", "7.41972017288208", "7.77007007598877", "7.86899995803833", "8.305529594421387", "8.307909965515137", "9.278909683227539", "9.866519927978516", "10.15157032012939", "10.85204982757568", "10.92409038543701", "11.00529956817627", "11.11326026916504", "11.39729022979736", "12.61310005187988", "12.71603012084961", "12.79397010803223", "13.4618501663208", "14.69252014160156", "17.6200008392334", "18.14240074157715", "19.86589050292969", "1987"
@freq 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1
@type float
@label 
@class category
@N_unique 24
@N 25
 
_@NOTES
 
=====v33=====

v33:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   34         1         33
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   34         1         33
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  226
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.20659            1988                       260
  (31 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v33 {c |}{res}        34    69.93531    338.9311    5.20659       1988
@mean    69.935
@sd   338.931
@min     5.207
@max  1988.000
@example0 .
@histh .00244753, .00007417
@histw 203.48593, 1789.7207
@type float
@label 
@class other
@N_unique 31
@N 34
 
_@NOTES
 
=====v34=====

v34:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   29         1         28
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   29         1         28
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  231
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.45885            1989                       260
  (27 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v34 {c |}{res}        29    80.61303    367.0507    5.45885       1989
@mean    80.613
@sd   367.051
@min     5.459
@max  1989.000
@values 5.4588499, 8.8329897, 9.0843801, 9.2728701, 9.4134798, 9.8491402, 10.38824, 10.58382, 10.7855, 10.97562, 11.26671, 11.321355, 11.376, 11.45314, 11.49052, 12.84042, 12.9871, 13.29353, 13.74664, 14.6512, 14.74586, 14.97688, 15.93138, 17.82284, 19.27758, 22.337049, 1989
@names "5.458849906921387", "8.832989692687988", "9.084380149841309", "9.272870063781738", "9.413479804992676", "9.849140167236328", "10.38823986053467", "10.58382034301758", "10.78549957275391", "10.97562026977539", "11.26671028137207", "11.32135486602783", "11.37600040435791", "11.45314025878906", "11.49051952362061", "12.84041976928711", "12.98709964752197", "13.29353046417236", "13.7466402053833", "14.65120029449463", "14.74586009979248", "14.97688007354736", "15.93138027191162", "17.82283973693848", "19.27758026123047", "22.33704948425293", "1989"
@freq 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1
@type float
@label 
@class category
@N_unique 27
@N 29
 
_@NOTES
 
=====v35=====

v35:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   31         1         30
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   31         1         30
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  229
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.00706            1990                       260
  (30 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v35 {c |}{res}        31    75.15451    355.3951    5.00706       1990
@mean    75.155
@sd   355.395
@min     5.007
@max  1990.000
@example0 .
@histh .00243765, .00008125
@histw 203.50635, 1791.5007
@type float
@label 
@class other
@N_unique 30
@N 31
 
_@NOTES
 
=====v36=====

v36:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   35         1         34
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   35         1         34
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  225
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.17871            1991                       260
  (33 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v36 {c |}{res}        35    68.38996    334.5549    5.17871       1991
@mean    68.390
@sd   334.555
@min     5.179
@max  1991.000
@example0 .
@histh .00244591, .00007194
@histw 203.76083, 1792.4178
@type float
@label 
@class other
@N_unique 33
@N 35
 
_@NOTES
 
=====v37=====

v37:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   33         1         32
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   33         1         32
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  227
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}6.78647            1992                       260
  (31 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v37 {c |}{res}        33    72.42817    344.6201    6.78647       1992
@mean    72.428
@sd   344.620
@min     6.786
@max  1992.000
@example0 .
@histh .0024423, .00007632
@histw 205.30782, 1793.4786
@type float
@label 
@class other
@N_unique 31
@N 33
 
_@NOTES
 
=====v38=====

v38:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   40         1         39
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   40         1         39
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  220
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}7.63921            1993                       260
  (35 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v38 {c |}{res}        40    61.74799    313.2041    7.63921       1993
@mean    61.748
@sd   313.204
@min     7.639
@max  1993.000
@example0 .
@histh .00294657, .00007555
@histw 173.08594, 1827.5532
@type float
@label 
@class other
@N_unique 35
@N 40
 
_@NOTES
 
=====v39=====

v39:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   48         1         47
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   48         1         47
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  212
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.86397            1994                       260
  (46 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v39 {c |}{res}        48     55.9962    285.7752    5.86397       1994
@mean    55.996
@sd   285.775
@min     5.864
@max  1994.000
@example0 .
@histh .00295503, .00006287
@histw 171.54198, 1828.322
@type float
@label 
@class other
@N_unique 46
@N 48
 
_@NOTES
 
=====v40=====

v40:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   65         1         64
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   65         1         64
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  195
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.8068             1995                       260
  (61 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v40 {c |}{res}        65    43.72448    245.8491     5.8068       1995
@mean    43.724
@sd   245.849
@min     5.807
@max  1995.000
@example0 .
@histh .00395986, .00006187
@histw 130.13138, 1870.6754
@type float
@label 
@class other
@N_unique 61
@N 65
 
_@NOTES
 
=====v41=====

v41:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   61         1         60
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   61         1         60
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  199
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2.85748            1996                       260
  (57 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v41 {c |}{res}        61    45.59052    253.9205    2.85748       1996
@mean    45.591
@sd   253.920
@min     2.857
@max  1996.000
@example0 .
@histh .00345447, .00005757
@histw 145.22481, 1853.6327
@type float
@label 
@class other
@N_unique 57
@N 61
 
_@NOTES
 
=====v42=====

v42:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   31         1         30
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   31         1         30
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  229
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}7.71022            1997                       260
  (29 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v42 {c |}{res}        31    78.90393     356.007    7.71022       1997
@mean    78.904
@sd   356.007
@min     7.710
@max  1997.000
@values 7.7102199, 9.1255598, 9.4815798, 10.92264, 11.08548, 11.10374, 12.02187, 12.53911, 12.80767, 12.89866, 12.92467, 13.16424, 14.2578, 14.39746, 14.7397, 15.3684, 15.8886, 16.27961, 16.71904, 17.35391, 17.54817, 18.21744, 18.448839, 18.69525, 18.98457, 20.69697, 23.27454, 26.086361, 1997
@names "7.710219860076904", "9.12555980682373", "9.481579780578613", "10.92263984680176", "11.08547973632813", "11.10373973846436", "12.02186965942383", "12.53911018371582", "12.8076696395874", "12.89865970611572", "12.92467021942139", "13.16423988342285", "14.25780010223389", "14.39745998382568", "14.73970031738281", "15.36839962005615", "15.88860034942627", "16.27960968017578", "16.71903991699219", "17.35391044616699", "17.54817008972168", "18.21743965148926", "18.44883918762207", "18.69524955749512", "18.98456954956055", "20.69696998596191", "23.27453994750977", "26.08636093139648", "1997"
@freq 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1
@type float
@label 
@class category
@N_unique 29
@N 31
 
_@NOTES
 
=====v43=====

v43:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   74         1         73
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   74         1         73
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  186
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}6.19878            1998                       260
  (71 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v43 {c |}{res}        74    40.19904    230.7451    6.19878       1998
@mean    40.199
@sd   230.745
@min     6.199
@max  1998.000
@example0 .
@histh .00396219, .00005428
@histw 130.68636, 1873.5125
@type float
@label 
@class other
@N_unique 71
@N 74
 
_@NOTES
 
=====v44=====

v44:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  108         1        107
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  108         1        107
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  152
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2.13243            1999                       260
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v44 {c |}{res}       108    32.86755     191.024    2.13243       1999
@mean    32.868
@sd   191.024
@min     2.132
@max  1999.000
@example0 .
@histh .00496147, .00004637
@histw 101.97581, 1899.1566
@type float
@label 
@class other
@N_unique .
@N 108
 
_@NOTES
 
=====v45=====

v45:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  132         1        131
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  132         1        131
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  128
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2.22308            2000                       260
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v45 {c |}{res}       132    29.49132    172.8944    2.22308       2000
@mean    29.491
@sd   172.894
@min     2.223
@max  2000.000
@example0 .
@histh .00546441, .00004171
@histw 93.03112, 1909.192
@type float
@label 
@class other
@N_unique .
@N 132
 
_@NOTES
 
=====v46=====

v46:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  137         1        136
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  137         1        136
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  123
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}4.20457            2001                       260
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v46 {c |}{res}       137     29.7076    169.7339    4.20457       2001
@mean    29.708
@sd   169.734
@min     4.205
@max  2001.000
@example0 .
@histh .00546862, .00004021
@histw 94.967995, 1910.2366
@type float
@label 
@class other
@N_unique .
@N 137
 
_@NOTES
 
=====v47=====

v47:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  139         1        138
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  139         1        138
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  121
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.57981            2002                       260
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v47 {c |}{res}       139     29.1556     168.617    5.57981       2002
@mean    29.156
@sd   168.617
@min     5.580
@max  2002.000
@example0 .
@histh .00547022, .00003964
@histw 96.32618, 1911.2537
@type float
@label 
@class other
@N_unique .
@N 139
 
_@NOTES
 
=====v48=====

v48:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  124         1        123
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  124         1        123
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  136
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3.29776            2003                       260
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v48 {c |}{res}       124    31.51577    178.5735    3.29776       2003
@mean    31.516
@sd   178.573
@min     3.298
@max  2003.000
@example0 .
@histh .00545646, .00004436
@histw 94.193314, 1912.1045
@type float
@label 
@class other
@N_unique .
@N 124
 
_@NOTES
 
=====v49=====

v49:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  142         1        141
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  142         1        141
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  118
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}4.77066            2004                       260
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v49 {c |}{res}       142    28.94645    166.9849    4.77066       2004
@mean    28.946
@sd   166.985
@min     4.771
@max  2004.000
@example0 .
@histh .00546337, .00003875
@histw 95.644722, 1913.126
@type float
@label 
@class other
@N_unique .
@N 142
 
_@NOTES
 
=====v50=====

v50:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  122         1        121
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  122         1        121
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  138
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.25027            2005                       260
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v50 {c |}{res}       122    31.38592    180.2187    5.25027       2005
@mean    31.386
@sd   180.219
@min     5.250
@max  2005.000
@example0 .
@histh .0054556, .00004509
@histw 96.147987, 1914.1023
@type float
@label 
@class other
@N_unique .
@N 122
 
_@NOTES
 
=====v51=====

v51:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  125         1        124
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  125         1        124
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  135
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.16807            2006                       260
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v51 {c |}{res}       125     30.9869    178.1272    5.16807       2006
@mean    30.987
@sd   178.127
@min     5.168
@max  2006.000
@example0 .
@histh .00545373, .00004398
@histw 96.114975, 1915.0531
@type float
@label 
@class other
@N_unique .
@N 125
 
_@NOTES
 
=====v52=====

v52:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  119         1        118
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  119         1        118
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  141
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}6.22791            2007                       260
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v52 {c |}{res}       119    31.38982    182.6808    6.22791       2007
@mean    31.390
@sd   182.681
@min     6.228
@max  2007.000
@example0 .
@histh .00495607, .000042
@histw 106.26652, 1906.9614
@type float
@label 
@class other
@N_unique .
@N 119
 
_@NOTES
 
=====v53=====

v53:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  141         1        140
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  141         1        140
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  119
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.6518             2008                       260
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v53 {c |}{res}       141    29.07014    167.8912     5.6518       2008
@mean    29.070
@sd   167.891
@min     5.652
@max  2008.000
@example0 .
@histh .00545459, .00003896
@histw 96.667625, 1916.9841
@type float
@label 
@class other
@N_unique .
@N 141
 
_@NOTES
 
=====v54=====

v54:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  127         1        126
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  127         1        126
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  133
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.503              2009                       260
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v54 {c |}{res}       127    30.44159    177.0046      5.503       2009
@mean    30.442
@sd   177.005
@min     5.503
@max  2009.000
@example0 .
@histh .00544717, .00004323
@histw 96.571045, 1917.932
@type float
@label 
@class other
@N_unique .
@N 127
 
_@NOTES
 
=====v55=====

v55:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  136         1        135
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  136         1        135
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  124
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5.29154            2010                       260
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v55 {c |}{res}       136    29.30244    171.1566    5.29154       2010
@mean    29.302
@sd   171.157
@min     5.292
@max  2010.000
@example0 .
@histh .00544674, .00004035
@histw 96.41465, 1918.8768
@type float
@label 
@class other
@N_unique .
@N 136
 
_@NOTES
 
=====v56=====

v56:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   99         1         98
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   99         1         98
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  161
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}4.42002            2011                       260
  (89 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v56 {c |}{res}        99    34.18973    200.7531    4.42002       2011
@mean    34.190
@sd   200.753
@min     4.420
@max  2011.000
@example0 .
@histh .00443994, .00004531
@histw 115.89668, 1899.5233
@type float
@label 
@class other
@N_unique 89
@N 99
 
_@NOTES
 
=====v57=====

v57:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   43         1         42
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   43         1         42
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  217
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}6.70776            2012                       260
  (41 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v57 {c |}{res}        43    61.03757    304.6398    6.70776       2012
@mean    61.038
@sd   304.640
@min     6.708
@max  2012.000
@example0 .
@histh .0029225, .00006958
@histw 173.81544, 1844.8923
@type float
@label 
@class other
@N_unique 41
@N 43
 
_@NOTES
 
=====v58=====

v58:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    4         1          3
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#           #             {txt}Total          {res}    4         1          3
{txt}{c |}  {res}#   .   .   #             {txt}Missing        {res}  256
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}9.67139            2013                       260
   (4 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v58 {c |}{res}         4    514.9265    998.7244    9.67139       2013
@mean   514.927
@sd   998.724
@min     9.671
@max  2013.000
@example0 .
@histh .00074875, .00024958
@histw 510.50354, 1512.1678
@type float
@label 
@class identifier
@N_unique 4
@N 4
 
_@NOTES
 
=====v59=====

v59:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res}  260
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                       260
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v59 {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
{com}. 
. // noi profiler report
. // profiler off
. {c )-}
{txt}
{com}. 
. exit, clear STATA
