{smcl}
{txt}{sf}{ul off}

{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. cap noi {c -(}
. 
. import excel  "/Users/mas/Dropbox/National_Pride_Large_Data/Data/EVC_data/OECD data/Education/Education at a Glance/Indicator B1_how much is spent per student.xls"
{res}{com}. 
. describe, short

{txt}Contains data
  obs:{res}            33                          
{txt} vars:{res}            13                          
{txt} size:{res}         9,339                          
{txt}Sorted by:  
{res}     Note:  dataset has changed since last saved
{com}. 
. local N = r(N)
. local variables = r(k)
. 
. di "@N `N'"
{res}@N 33
{com}. di "@variables `variables'"
{res}@variables 13
{com}. 
. datasignature
  {res}33:13(44340):279005960:601836635
{com}. local datasig = "`r(datasignature)'"
. 
. di "@datasignature `datasig'"
{res}@datasignature 33:13(44340):279005960:601836635
{com}. 
. cap noi xtset
{err}panel variable not set; use {bf:xtset} {it:varname} ...
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
.     di "@panelvar `r(panelvar)'"
. {c )-}
. 
. notes _dta
{res}{com}. 
. qui {c -(}
. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====A=====
@freq 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1
@values "B1", "Chart B1.1. Annual expenditure by educational institutions per student, by type of services (2010)
", "Chart B1.2. Annual expenditure per student by educational institutions for all services, by level of education (2010)", "Chart B1.3. Expenditure per student by educational institutions for all services, at various levels of education relative to primary education (2010)

", "Chart B1.4. Cumulative expenditure by educational institutions per student over the average duration of tertiary studies (2010)
", "Chart B1.5. Annual expenditure per student by educational institutions relative to GDP per capita (2010)
", "Chart B1.6. Changes in the number of students and changes in expenditure per student by educational institutions, by level of education (2005, 2010)", "Chart B1.7. (Web only) Cumulative expenditure per student by educational institutions over the theoretical duration of primary and secondary studies (2010)
", "Charts", "Education at a Glance 2013", "Education at a Glance 2013 - © OECD 2013", "Indicator B1: How much is spent per student?", "Table B1.1a. Annual expenditure per student by educational institutions for all services (2010)   
                    ", "Table B1.1b. (Web only) Annual expenditure per student by educational institutions for core services (2010)   
            ", "Table B1.2. Annual expenditure per student by educational institutions for core services, ancillary services and R&D (2010)", "Table B1.3a. Cumulative expenditure per student by educational institutions for all services over the average duration of tertiary studies (2010)      
                                                ", "Table B1.3b. (Web only) Cumulative expenditure per student by educational institutions for all services over the theoretical duration of primary and secondary studies (2010)  
                                            ", "Table B1.4. Annual expenditure per student by educational institutions for all services, relative to GDP per capita (2010)                     ", "Table B1.5a. Change in expenditure per student by educational institutions for all services, relative to different factors, at the primary, secondary and post-secondary non-tertiary levels of education (1995, 2000, 2005, 2010)
", "Table B1.5b. Change in expenditure per student by educational institutions for all services, relative to different factors, at the tertiary level of education (1995, 2000, 2005, 2010)
", "Table B1.6. Annual expenditure per student by educational institutions for all services, by type of programme, at the secondary level (2010)   
             ", "Table B1.7. (Web only) Distribution of expenditure (as a percentage) by educational institutions compared to the proportion of students enrolled at each level of education (2010)                      ", "Tables", "This document and any map included herein are without prejudice to the status of or sovereignty over any territory, to the delimitation of international frontiers and boundaries and to the name of any territory, city or area.", "Version 1 - Last updated: 24-Jun-2013", "© OECD 2013"
@example0 Education at a Glance 2013 - © OECD 2013
@type str227
@label 
@class identifier
@N_unique 26
@N 26
{res} 
_@NOTES
 
=====B=====
@freq 1
@values "Indicator B1: How much is spent per student? "
@example0 
@type str45
@label 
@class constant
@N_unique 1
@N 1
 
_@NOTES
 
=====C=====

C:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                        33
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}C {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====D=====

D:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                        33
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}D {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====E=====

E:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                        33
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}E {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====F=====

F:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                        33
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}F {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====G=====

G:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                        33
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}G {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====H=====

H:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                        33
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}H {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====I=====

I:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                        33
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}I {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====J=====

J:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                        33
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}J {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====K=====

K:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                        33
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}K {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====L=====

L:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                        33
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}L {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====M=====

M:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res}   33
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                        33
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}M {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
{com}. 
. // noi profiler report
. // profiler off
. {c )-}
{txt}
{com}. 
. exit, clear STATA
