{smcl}
{txt}{sf}{ul off}

{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. cap noi {c -(}
. 
. import excel  "/Users/mas/Dropbox/National_Pride_Large_Data/Data/Data_directory.xlsx"
{res}{com}. 
. describe, short

{txt}Contains data
  obs:{res}            47                          
{txt} vars:{res}             5                          
{txt} size:{res}        29,610                          
{txt}Sorted by:  
{res}     Note:  dataset has changed since last saved
{com}. 
. local N = r(N)
. local variables = r(k)
. 
. di "@N `N'"
{res}@N 47
{com}. di "@variables `variables'"
{res}@variables 5
{com}. 
. datasignature
  {res}47:5(92177):1149745584:184050503
{com}. local datasig = "`r(datasignature)'"
. 
. di "@datasignature `datasig'"
{res}@datasignature 47:5(92177):1149745584:184050503
{com}. 
. cap noi xtset
{err}panel variable not set; use {bf:xtset} {it:varname} ...
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
.     di "@panelvar `r(panelvar)'"
. {c )-}
. 
. notes _dta
{res}{com}. 
. qui {c -(}
. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====A=====
@freq 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1
@values "Better Life Index", "Capital stock", "Education by funding source and type", "Educational attainment", "Educational expenditure", "Enabling environment index", "Health expenditure", "Key short term indicators", "Migration - Immigrants by citizenship and age", "Migration - Immigrants by duration of stay", "Migration - Immigrants by labour force status", "Migration - Immigrants by occupation", "Migration - Immigrants by sector", "Migration - Immigrants by sex and age", "Migration - Immigration - by field of study", "Migration - International migration database", "Population - historical and projected", "Population - total", "Revenue - taxation revenue", "Social expenditure", "Taxing wages", "Topic", "World Bank World Governance Indicators"
@example0 Topic
@type str45
@label 
@class identifier
@N_unique 23
@N 23
{res} 
_@NOTES
 
=====B=====
@freq 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1
@values "AWCOMP_data_taxing_wages2013.csv", "BLI_Data_Better_Life_Index_2013.csv", "BLI_Data_Better_Life_Index_2014.csv", "CHAPTER_A_EAG2014_data.csv", "CHAPTER_B_EAG2014_data.csv", "CapitalStocks103Countries.xlsx", "DIOC_CITIZEN_AGE_Data_Immigrants_by_citizenship_and_age.csv", "DIOC_DURATION_STAY_Data_Immigrants_by_duration_of_stay.csv", "DIOC_FIELD_STUDY_Data_Immigrants_by_field_of_study.csv", "DIOC_LFS_Data_Immigrants_by_labour_force_status.csv", "DIOC_OCCUPATION_DET_Data_Immigrants_by_detailed_occupation.csv", "DIOC_SECTOR_Data_23ab2a1d-61d4-4aad-ab94-59b2ef6e905b.csv", "DIOC_SEX_AGE_Data_0c235453-be88-40ea-9f17-f434f9e0a061.csv", "EnablingEnvironmentIndex109.xlsx", "EnablingEnvironmentIndexdata223.xlsx", "Filename", "KEI_Data_Key_Short_Term_Indicators.csv", "MIG_Data_International_Migration_Database.csv", "RFIN1_education_funding_type2011.csv", "SHA_Data_Health_Expenditure2013.csv", "wgi_data.dta"
@example0 Filename
@type str62
@label 
@class identifier
@N_unique 21
@N 21
 
_@NOTES
 
=====C=====
@freq 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1
@values "1950-2050", "1970-2011", "1973-2012", "1995-2009, although not a complete dataset for all these years", "1995-2012", "1996-2012", "2000-2011", "2000-2013", "2010-2011", "2011-2012", "2013", "2014", "?", "Data is very patchy, one ob for 1995, then 2000, then 2008, then yearly to 2011", "In most cases, 2000, then 2005-2012, but some cases have an ob for 1995 as well", "In some cases, 2005-20011, in some cases, from 1998-2011", "Index calculated in 2013", "Years"
@example0 Years
@type str79
@label 
@class identifier
@N_unique 18
@N 18
 
_@NOTES
 
=====D=====
@freq 1, 1, 1, 19, 1, 1
@values "(109 means on 109 countries, 223 means calculated for 223 countries)", "Berlemann and Wesselhoeft, personal communication", "Civicus website", "OECD stats database", "Source", "World Bank"
@type str68
@label 
@class category
@N_unique 6
@N 24
 
_@NOTES
 
=====E=====
@freq 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1
@values "A breakdown of age and sex of immigrants -might be useful in determining the different EVC achieveable from moving about between countries, as in the citizenship premium if we wanted to do  ", "A breakdown of immigrants by labour force status - might be useful in determining the different EVC achieveable from moving about between countries, as in the citizenship premium if we wanted to do such a thing of course", "A breakdown of occupation of immigrants -might be useful in determining the different EVC achieveable from moving about between countries, as in the citizenship premium if we wanted to do  ", "A breakdown of sectors of immigrants -might be useful in determining the different EVC achieveable from moving about between countries, as in the citizenship premium if we wanted to do  ", "A dataset that contains all the inflows of immigrants, stock of foreign born, acquisition of nationality", "Another possible test of how the index is correlated with WDIs or measures of wellbeing or self reported happiness", "Gives a breakdown of how long immigrants have been in the country  might be useful in determining the different EVC achieveable from moving about between countries, as in the citizenship premium if we wanted to do such a thing of course", "Gives a breakdown of the field of study for immigrants - might be useful in determining the different EVC achieveable from moving about between countries, as in the citizenship premium if we wanted to do such a thing of course", "Historical breakdown of population data as well as projected population until 2050. Breakdown by gender, and then by all persons", "I don't know whether we would use this directly to estimate anything in the EVC. This might also be a test to see if EVC is correlated", "In case we wanted to compare the different levels of education spending with where the spending is coming from, eg, local, state, federal", "Information on tax rates, broken down by specific family types", "Net public spending as a percentage of GDP", "Not sure how useful this is, but it gives a breakdown of immigrants, their country of origin, and level of education", "Population taken at mid year, at 1 jan, at 31 Dec, net growth in population, net migration, natural increase in population, broken down by gender and also figures for all persons", "The access to capital stocks across countries would have a differential effect on opportunities and ability to access infrastructure - increased access to infrastructure reduces the transaction costs of activities (business or otherwise)", "This gives the US PPP expenditure on different types of students (primary, secondary, tertiary) but only in the year 2011. It also gives the change in expenditure, and it gives the percentage of Public expenditure on education as a percentage of total public expenditure, but only for selected years. I don't know if the WDI is any better", "This has health expenditure per capita, in national currency units, in US PPP$, general govt expenditure per capita (which would obviously be handy for calculation of EVC, the problem is that the data is only for a few years", "Total taxation revenue collected, broken down by level of government and whether it was a social security collection", "Use in EVC", "Various indicators, not sure how useful they are", "We can use this to work out the educational attainment for different cohorts, ages, or even as the probability that someone 25 years old who comes from a specific country will have tertiary education", "We could test how the EEI is correlated with the EVC, although some of the factors that go into making up the EEI will also be used to calculate the EVC. The idea is that some of these indicators of wellbeing might have more in common with the EVC than does GDP per capita -maybe it's not how much money people are making, it's what they are getting in return for their money "
@example0 Use in EVC
@type str376
@label 
@class identifier
@N_unique 23
@N 23
 
_@NOTES
 
{com}. 
. // noi profiler report
. // profiler off
. {c )-}
{txt}
{com}. 
. exit, clear STATA
