{smcl}
{txt}{sf}{ul off}

{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. use  "/Users/mas/Dropbox/Public/cameron/t2_mcout_G_20.dta"
{txt}
{com}. 
. describe, short

{txt}Contains data from {res}/Users/mas/Dropbox/Public/cameron/t2_mcout_G_20.dta
{txt}  obs:{res}         1,000                          
{txt} vars:{res}            20                          3 Jul 2014 02:13
{txt} size:{res}        96,000                          
{txt}Sorted by:  

{com}. 
. local N = r(N)
{txt}
{com}. local variables = r(k)
{txt}
{com}. 
. di "@N `N'"
{res}@N 1000
{txt}
{com}. di "@variables `variables'"
{res}@variables 20
{txt}
{com}. 
. datasignature
  {res}1000:20(34788):1272345700:244939731
{txt}
{com}. local datasig = "`r(datasignature)'"
{txt}
{com}. 
. di "@datasignature `datasig'"
{res}@datasignature 1000:20(34788):1272345700:244939731
{txt}
{com}. 
. cap noi xtset
{err}panel variable not set; use {bf:xtset} {it:varname} ...
{txt}
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
.     di "@panelvar `r(panelvar)'"
. {c )-}
{txt}
{com}. 
. notes _dta
{res}{txt}
{com}. 
. qui {c -(}
{txt}
{com}. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====numobs=====

{res}numobs:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 1000      1000          -
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 1000      1000          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3545               7878                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}numobs {c |}{res}      1000    5209.657    811.1138       3545       7878
@mean  5209.657
@sd   811.114
@min  3545.000
@max  7878.000
@example0 4384
@histh 6.693e-06, .00004685, .00014055, .00029448, .00026102, .0004618, .00051535, .00053543, .00042834, .00041495, .00052204, .00035472, .0004685, .00035472, .00034133, .00022756, .00027441, .00024763, .00016063, .00014724, .00016063, .00010709, .00006024, .00003346, .00005354, .00001339, .00001339, .00002008, .00002677
@histw 3619.7068, 3769.1206, 3918.5344, 4067.9482, 4217.3623, 4366.7759, 4516.1895, 4665.6035, 4815.0171, 4964.4312, 5113.8447, 5263.2588, 5412.6724, 5562.0864, 5711.5, 5860.9136, 6010.3276, 6159.7412, 6309.1553, 6458.5688, 6607.9829, 6757.3965, 6906.8105, 7056.2241, 7205.6377, 7355.0518, 7504.4653, 7653.8794, 7803.293
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====numstates=====

numstates:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1000      1000          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1000      1000          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}20                                           1000
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}numstates {c |}{res}      1000          20           0         20         20
@mean    20.000
@sd     0.000
@min    20.000
@max    20.000
@values 20
@type float
@label 
@class constant
@N_unique 1
@N 1000
 
_@NOTES
 
=====K=====

K:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1000      1000          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1000      1000          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5                                            1000
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}K {c |}{res}      1000           5           0          5          5
@mean     5.000
@sd     0.000
@min     5.000
@max     5.000
@values 5
@type float
@label 
@class constant
@N_unique 1
@N 1000
 
_@NOTES
 
=====numbsreps=====

numbsreps:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1000      1000          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1000      1000          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}399                                          1000
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}numbsreps {c |}{res}      1000         399           0        399        399
@mean   399.000
@sd     0.000
@min   399.000
@max   399.000
@values 399
@type float
@label 
@class constant
@N_unique 1
@N 1000
 
_@NOTES
 
=====b=====

b:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative       {res}  499         -        499
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Positive       {res}  501         -        501
{txt}{c |}          {res}#   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 1000         -       1000
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}-.1344988      .1076575                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}b {c |}{res}      1000    .0003078    .0396045  -.1344988   .1076575
@mean     0.000
@sd     0.040
@min    -0.134
@max     0.108
@example0 -.03114652
@histh .1197574, .1197574, .35927218, .2395148, .35927218, .59878701, 1.3173314, 2.0358758, 2.5149055, 4.4310236, 4.7902961, 6.1076274, 6.7064142, 9.5805922, 9.9398642, 9.7003489, 10.299136, 9.3410769, 8.1435032, 6.1076274, 7.0656867, 6.586657, 4.0717516, 2.395148, 3.3532071, 1.9161184, .4790296, .71854436, .35927218
@histw -.13032365, -.12197344, -.11362322, -.10527301, -.09692279, -.08857258, -.08022236, -.07187215, -.06352194, -.05517172, -.0468215, -.03847129, -.03012107, -.02177086, -.01342065, -.00507043, .00327978, .01163, .01998021, .02833043, .03668064, .04503086, .05338107, .06173129, .0700815, .07843172, .08678193, .09513215, .10348237
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====se_rob=====

se_rob:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 1000         -       1000
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 1000         -       1000
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0120799       .0176928                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}se_rob {c |}{res}      1000     .014795    .0010363   .0120799   .0176928
@mean     0.015
@sd     0.001
@min     0.012
@max     0.018
@example0 .01566758
@histh 20.666609, 20.666609, 20.666609, 46.49987, 113.66634, 175.66617, 149.83292, 216.99939, 222.16603, 247.9993, 294.49918, 392.66556, 294.49918, 320.33243, 304.83246, 418.49881, 351.33234, 289.33252, 304.83246, 196.33278, 242.83264, 170.49951, 129.16631, 98.166389, 41.333218, 41.333218, 20.666609, 10.333304, 10.333304
@histw .01217669, .01237024, .01256379, .01275734, .01295089, .01314443, .01333798, .01353153, .01372508, .01391863, .01411218, .01430573, .01449928, .01469283, .01488637, .01507992, .01527347, .01546702, .01566057, .01585412, .01604767, .01624122, .01643477, .01662832, .01682186, .01701541, .01720896, .01740251, .01759606
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====se_clu=====

se_clu:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 1000         -       1000
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 1000         -       1000
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0137879       .0576535                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}se_clu {c |}{res}      1000    .0341612    .0070052   .0137879   .0576535
@mean     0.034
@sd     0.007
@min     0.014
@max     0.058
@example0 .02636647
@histh .66111112, 1.3222222, 3.9666667, 5.9499998, 9.2555552, 15.866667, 15.866667, 25.783333, 29.75, 40.327778, 56.194443, 46.277779, 49.583332, 59.5, 64.127777, 46.938889, 46.277779, 41.650002, 27.105555, 23.799999, 12.561111, 13.883333, 7.9333334, 5.2888889, 4.6277776, 3.9666667, .66111112, 1.9833333
@histw .01454421, .01605682, .01756942, .01908203, .02059463, .02210724, .02361984, .02513245, .02664505, .02815766, .02967026, .03118287, .03269547, .03420808, .03572068, .03723329, .0387459, .0402585, .0417711, .04328371, .04479631, .04630892, .04782153, .04933413, .05084673, .05235934, .05387194, .05689716
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====se_CR2=====

se_CR2:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 1000         -       1000
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 1000         -       1000
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0140999       .0697468                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}se_CR2 {c |}{res}      1000    .0365972    .0085678   .0140999   .0697468
@mean     0.037
@sd     0.009
@min     0.014
@max     0.070
@example0 .02735146
@histh .52114272, 2.0845709, 4.1691418, 6.7748556, 15.113139, 17.19771, 27.620565, 31.268564, 42.212563, 47.945133, 41.691418, 50.550846, 43.254848, 45.860561, 34.916565, 22.930281, 25.014851, 19.803425, 12.507425, 5.7325702, 6.7748556, 5.2114272, 4.1691418, 2.6057136, 2.6057136, 1.0422854, .52114272, 1.0422854
@histw .0150593, .01697816, .01889702, .02081588, .02273474, .0246536, .02657246, .02849132, .03041018, .03232904, .0342479, .03616676, .03808562, .04000448, .04192334, .0438422, .04576106, .04767992, .04959878, .05151764, .0534365, .05535536, .05727422, .05919309, .06111195, .0630308, .06686852, .06878738
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====se_CR3=====

se_CR3:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 1000         -       1000
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 1000         -       1000
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0144347       .0865232                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}se_CR3 {c |}{res}      1000    .0395389    .0108763   .0144347   .0865232
@mean     0.040
@sd     0.011
@min     0.014
@max     0.087
@example0 .02842619
@histh .40228343, 2.815984, 5.631968, 11.263936, 16.493622, 29.366692, 34.596375, 38.619209, 39.826061, 42.239761, 33.791809, 34.194092, 27.757557, 18.505039, 14.482203, 14.079921, 8.4479523, 7.2411017, 6.0342517, 4.0228343, 3.6205509, 1.6091337, 2.0114172, 2.4137006, 1.6091337, .40228343, .40228343, .40228343
@histw .01567763, .01816344, .02064925, .02313506, .02562087, .02810668, .03059249, .0330783, .03556411, .03804992, .04053573, .04302154, .04550735, .04799316, .05047897, .05296478, .05545058, .0579364, .0604222, .06290802, .06539383, .06787963, .07036544, .07285126, .07533706, .07782287, .08279449, .0852803
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====dof_CR2_IK=====

dof_CR2_IK:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #             {txt}Positive       {res} 1000         -       1000
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 1000         -       1000
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3.685857       16.55169                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}dof_CR2_IK {c |}{res}      1000    9.367156    3.113214   3.685857   16.55169
@mean     9.367
@sd     3.113
@min     3.686
@max    16.552
@example0 11.77699
@histh .00901613, .05409678, .10143147, .10819356, .12171776, .15327422, .08114517, .07889114, .07438307, .07663711, .07663711, .10593953, .10819356, .1036855, .10819356, .1172097, .10143147, .07663711, .07663711, .09241533, .08565324, .08565324, .06536695, .04958872, .05409678, .03381049, .03606452, .00901613, .00901613
@histw 3.9076819, 4.3513312, 4.7949805, 5.2386298, 5.6822791, 6.1259284, 6.5695777, 7.013227, 7.4568763, 7.9005256, 8.3441753, 8.7878246, 9.2314739, 9.6751232, 10.118773, 10.562422, 11.006071, 11.44972, 11.89337, 12.337019, 12.780668, 13.224318, 13.667967, 14.111616, 14.555265, 14.998915, 15.442564, 15.886213, 16.329863
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====dof_CSS=====

dof_CSS:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#       #                 {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #             {txt}Positive       {res} 1000         -       1000
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1000         -       1000
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3.317022       18.49244                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dof_CSS {c |}{res}      1000    9.898162    3.820893   3.317022   18.49244
@mean     9.898
@sd     3.821
@min     3.317
@max    18.492
@example0 12.641039
@histh .03630872, .08599434, .09554926, .07643941, .10510419, .08599434, .0649735, .05350759, .07452843, .07643941, .06306252, .07835039, .10319321, .07643941, .10319321, .09746026, .05541857, .0649735, .0649735, .07261744, .06879547, .08217237, .05541857, .04395266, .04586365, .03057577, .03630872, .00573296, .00764394
@histw 3.5786669, 4.1019573, 4.6252475, 5.1485376, 5.6718278, 6.1951184, 6.7184086, 7.2416987, 7.7649889, 8.2882795, 8.8115692, 9.3348598, 9.8581505, 10.38144, 10.904731, 11.42802, 11.951311, 12.474602, 12.997891, 13.521182, 14.044472, 14.567762, 15.091053, 15.614343, 16.137632, 16.660923, 17.184214, 17.707504, 18.230795
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====se_clu_bs=====

se_clu_bs:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 1000         -       1000
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 1000         -       1000
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0156567        .061449                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}se_clu_bs {c |}{res}      1000    .0354053    .0073075   .0156567    .061449
@mean     0.035
@sd     0.007
@min     0.016
@max     0.061
@example0 .02505583
@histh 1.2665906, 3.799772, 3.1664767, 9.4994297, 13.932497, 14.565792, 24.698517, 31.664766, 42.430786, 50.030331, 43.697376, 59.529758, 47.49715, 62.696236, 41.797493, 39.897606, 42.430786, 27.231699, 22.798632, 15.832383, 6.9662485, 10.132725, 8.2328396, 3.799772, 2.5331812, 1.2665906, .6332953, 1.2665906
@histw .01644627, .01802531, .01960435, .02118339, .02276244, .02434148, .02592052, .02749956, .0290786, .03065765, .03223669, .03381573, .03539477, .03697382, .03855286, .0401319, .04171094, .04328999, .04486903, .04644807, .04802711, .04960615, .05118519, .05276424, .05434328, .05750136, .05908041, .06065945
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====bs_misreps=====

bs_misreps:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1000      1000          -
{txt}{c |}  {res}#                         {txt}Positive           {res}-         -          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1000      1000          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                                            1000
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}bs_misreps {c |}{res}      1000           0           0          0          0
@mean     0.000
@sd     0.000
@min     0.000
@max     0.000
@values 0
@type float
@label 
@class constant
@N_unique 1
@N 1000
 
_@NOTES
 
=====p_pairs_bs=====

p_pairs_bs:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero           {res}    2         2          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res}  998         -        998
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1000         2        998
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  .995                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}p_pairs_bs {c |}{res}      1000    .4709425    .2922623          0       .995
@mean     0.471
@sd     0.292
@min     0.000
@max     0.995
@example0 .43000001
@histh .9035176, .9035176, 1.5155779, 1.5447236, 1.2241206, 1.1949749, 1.1075376, .81608039, .96180904, 1.1366835, 1.3115578, 1.1658292, .99095476, .64120603, .84522611, .99095476, .87437183, .78693467, 1.0783919, 1.0492462, .72864324, .9035176, .87437183, .93266332, 1.0201005, .75778896, .72864324, .9035176, 1.2532663
@histw .01715517, .05146552, .08577586, .12008621, .15439655, .1887069, .22301725, .25732759, .29163793, .32594827, .36025861, .39456898, .42887932, .46318966, .4975, .53181034, .56612068, .60043103, .63474137, .66905171, .70336205, .73767239, .77198279, .80629313, .84060347, .87491381, .90922415, .94353449, .97784483
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====p_rad_res=====

p_rad_res:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Zero           {res}    9         9          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res}  991         4        987
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1000        13        987
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}p_rad_res {c |}{res}      1000    .4922875    .2940217          0          1
@mean     0.492
@sd     0.294
@min     0.000
@max     1.000
@example0 .285
@histh 1.189, .986, 1.102, 1.015, 1.276, .84100002, 1.16, 1.189, 1.073, .667, .95700002, .89899999, .92799997, .81199998, .89899999, 1.073, 1.131, .75400001, 1.102, .986, .986, 1.015, .89899999, .986, 1.189, .986, 1.131, .87, .89899999
@histw .01724138, .05172414, .0862069, .12068965, .15517241, .18965517, .22413793, .25862068, .29310346, .3275862, .36206895, .39655173, .43103448, .46551725, .5, .53448278, .56896549, .60344827, .63793105, .67241377, .70689654, .74137932, .7758621, .81034482, .84482759, .87931037, .91379309, .94827586, .98275864
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====p_rad_res_high=====

p_rad_res_high:                                 {txt}Number of Observations
{hline 17}                           {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Zero           {res}    9         9          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res}  991         4        987
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1000        13        987
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
p_rad_res_~h {c |}{res}      1000      .49233    .2940444          0          1
@mean     0.492
@sd     0.294
@min     0.000
@max     1.000
@example0 .285
@histh 1.189, .986, 1.102, 1.015, 1.276, .84100002, 1.16, 1.189, 1.073, .667, .95700002, .89899999, .92799997, .78299999, .92799997, 1.073, 1.131, .75400001, 1.102, .95700002, 1.015, 1.015, .87, 1.015, 1.189, .986, 1.131, .87, .89899999
@histw .01724138, .05172414, .0862069, .12068965, .15517241, .18965517, .22413793, .25862068, .29310346, .3275862, .36206895, .39655173, .43103448, .46551725, .5, .53448278, .56896549, .60344827, .63793105, .67241377, .70689654, .74137932, .7758621, .81034482, .84482759, .87931037, .91379309, .94827586, .98275864
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====p_rad_res_low=====

p_rad_res_low:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Zero           {res}    9         9          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res}  991         4        987
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1000        13        987
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
p_rad_res_~w {c |}{res}      1000     .492245    .2939994          0          1
@mean     0.492
@sd     0.294
@min     0.000
@max     1.000
@example0 .285
@histh 1.189, .986, 1.102, 1.015, 1.276, .84100002, 1.16, 1.189, 1.073, .667, .95700002, .89899999, .92799997, .81199998, .89899999, 1.073, 1.131, .75400001, 1.102, .986, .986, 1.015, .89899999, .986, 1.189, .986, 1.131, .87, .89899999
@histw .01724138, .05172414, .0862069, .12068965, .15517241, .18965517, .22413793, .25862068, .29310346, .3275862, .36206895, .39655173, .43103448, .46551725, .5, .53448278, .56896549, .60344827, .63793105, .67241377, .70689654, .74137932, .7758621, .81034482, .84482759, .87931037, .91379309, .94827586, .98275864
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====p_rad_unres=====

p_rad_unres:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #       #   #         {txt}Zero           {res}    3         3          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res}  997         4        993
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1000         7        993
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}p_rad_unres {c |}{res}      1000    .4872125    .2937572          0          1
@mean     0.487
@sd     0.294
@min     0.000
@max     1.000
@example0 .29499999
@histh 1.073, .89899999, 1.2180001, 1.276, 1.131, 1.015, 1.131, 1.102, 1.363, .667, .95700002, .81199998, .78299999, .92799997, .95700002, 1.044, 1.102, .89899999, .95700002, 1.102, .89899999, .667, .84100002, 1.16, 1.102, 1.131, 1.131, .75400001, .89899999
@histw .01724138, .05172414, .0862069, .12068965, .15517241, .18965517, .22413793, .25862068, .29310346, .3275862, .36206895, .39655173, .43103448, .46551725, .5, .53448278, .56896549, .60344827, .63793105, .67241377, .70689654, .74137932, .7758621, .81034482, .84482759, .87931037, .91379309, .94827586, .98275864
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====p_webb_res=====

p_webb_res:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Zero           {res}    9         9          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res}  991         4        987
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1000        13        987
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}p_webb_res {c |}{res}      1000    .4922725    .2957973          0          1
@mean     0.492
@sd     0.296
@min     0.000
@max     1.000
@example0 .28999999
@histh 1.2180001, 1.073, 1.102, 1.102, 1.044, .95700002, 1.102, 1.131, 1.131, .81199998, .89899999, .78299999, .87, .89899999, .89899999, 1.015, 1.131, .89899999, 1.189, .81199998, .92799997, .84100002, .92799997, .87, 1.363, .986, 1.044, 1.015, .95700002
@histw .01724138, .05172414, .0862069, .12068965, .15517241, .18965517, .22413793, .25862068, .29310346, .3275862, .36206895, .39655173, .43103448, .46551725, .5, .53448278, .56896549, .60344827, .63793105, .67241377, .70689654, .74137932, .7758621, .81034482, .84482759, .87931037, .91379309, .94827586, .98275864
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====datetime=====
@freq 1000
@values " 3 Jul 2014 02:13:05"
@example0  3 Jul 2014 02:13:05
@type str20
@label 
@class constant
@N_unique 1
@N 1000
 
_@NOTES
 
{txt}
{com}. 
. // noi profiler report
. // profiler off
. 
. exit, clear STATA
