{smcl}
{txt}{sf}{ul off}

{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. cap noi {c -(}
. 
. use  "/Users/mas/Dropbox/Public/cameron/t4_post_G20__5_Jul_2014.dta"
. 
. describe, short

{txt}Contains data from {res}/Users/mas/Dropbox/Public/cameron/t4_post_G20__5_Jul_2014.dta
{txt}  obs:{res}         1,000                          
{txt} vars:{res}            13                          5 Jul 2014 21:47
{txt} size:{res}        52,000                          
{txt}Sorted by:  
{com}. 
. local N = r(N)
. local variables = r(k)
. 
. di "@N `N'"
{res}@N 1000
{com}. di "@variables `variables'"
{res}@variables 13
{com}. 
. datasignature
  {res}1000:13(60387):2211497762:1951321700
{com}. local datasig = "`r(datasignature)'"
. 
. di "@datasignature `datasig'"
{res}@datasignature 1000:13(60387):2211497762:1951321700
{com}. 
. cap noi xtset
{err}panel variable not set; use {bf:xtset} {it:varname} ...
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
.     di "@panelvar `r(panelvar)'"
. {c )-}
. 
. notes _dta
{res}{com}. 
. qui {c -(}
. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====numobs=====

{res}numobs:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1000      1000          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1000      1000          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}720                                          1000
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}numobs {c |}{res}      1000         720           0        720        720
@mean   720.000
@sd     0.000
@min   720.000
@max   720.000
@values 720
@type float
@label 
@class constant
@N_unique 1
@N 1000
 
_@NOTES
 
=====numstates=====

numstates:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1000      1000          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1000      1000          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}20                                           1000
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}numstates {c |}{res}      1000          20           0         20         20
@mean    20.000
@sd     0.000
@min    20.000
@max    20.000
@values 20
@type float
@label 
@class constant
@N_unique 1
@N 1000
 
_@NOTES
 
=====K=====

K:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1000      1000          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1000      1000          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                                            1000
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}K {c |}{res}      1000           1           0          1          1
@mean     1.000
@sd     0.000
@min     1.000
@max     1.000
@values 1
@type float
@label 
@class constant
@N_unique 1
@N 1000
 
_@NOTES
 
=====numbsreps=====

numbsreps:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1000      1000          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1000      1000          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}399                                          1000
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}numbsreps {c |}{res}      1000         399           0        399        399
@mean   399.000
@sd     0.000
@min   399.000
@max   399.000
@values 399
@type float
@label 
@class constant
@N_unique 1
@N 1000
 
_@NOTES
 
=====b=====

b:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative       {res}  478         -        478
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res}  522         -        522
{txt}{c |}          {res}#   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 1000         -       1000
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}-.0603909       .055098                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}b {c |}{res}      1000    .0004481    .0187921  -.0603909    .055098
@mean     0.000
@sd     0.019
@min    -0.060
@max     0.055
@example0 -.00478897
@histh .25110629, .25110629, .25110629, 1.0044252, 2.0088503, 2.7621691, 4.2688069, 6.277657, 5.5243382, 11.299783, 12.555314, 14.815271, 14.061953, 20.339609, 21.092928, 23.352884, 25.863949, 17.326334, 14.815271, 16.070803, 10.044251, 7.0309763, 6.77987, 3.2643819, 3.5154881, 2.2599566, 1.5066377, 1.7577441, .75331885
@histw -.05839976, -.05441738, -.050435, -.04645263, -.04247025, -.03848787, -.03450549, -.03052312, -.02654074, -.02255836, -.01857598, -.01459361, -.01061123, -.00662885, -.00264647, .0013359, .00531828, .00930066, .01328303, .01726541, .02124779, .02523017, .02921254, .03319492, .0371773, .04115968, .04514205, .04912443, .05310681
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====se_def=====

se_def:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 1000         -       1000
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 1000         -       1000
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.003968        .0088862                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}se_def {c |}{res}      1000    .0056108    .0008851    .003968   .0088862
@mean     0.006
@sd     0.001
@min     0.004
@max     0.009
@example0 .00585479
@histh 11.792938, 53.068222, 153.3082, 271.23758, 442.23517, 713.47278, 725.26569, 636.81866, 412.75284, 300.71991, 206.37642, 100.23997, 165.10114, 259.44464, 277.13403, 389.16696, 265.34109, 112.03291, 64.86116, 58.964691, 64.86116, 76.654099, 47.171753, 29.482346, 23.585876, 11.792938, 5.8964691, 11.792938, 5.8964691
@histw .00405282, .00422241, .00439201, .0045616, .00473119, .00490078, .00507038, .00523997, .00540956, .00557916, .00574875, .00591834, .00608794, .00625753, .00642712, .00659672, .00676631, .0069359, .00710549, .00727509, .00744468, .00761427, .00778387, .00795346, .00812305, .00829265, .00846224, .00863183, .00880142
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====se_clu=====

se_clu:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1000         -       1000
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 1000         -       1000
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0085048       .0377771                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}se_clu {c |}{res}      1000    .0177494    .0058163   .0085048   .0377771
@mean     0.018
@sd     0.006
@min     0.009
@max     0.038
@example0 .02327405
@histh 7.9255719, 22.786018, 33.683681, 76.28363, 124.82776, 123.83706, 119.87428, 75.292931, 60.432487, 20.804626, 8.9162683, 1.981393, 6.9348755, 23.776716, 62.413879, 65.385971, 61.423183, 23.776716, 11.888358, 5.9441791, 6.9348755, 18.823233, 12.879054, 3.962786, .99069649, 1.981393, 1.981393, 3.962786, .99069649
@histw .00900947, .01001886, .01102825, .01203764, .01304703, .01405643, .01506582, .01607521, .0170846, .01809399, .01910338, .02011277, .02112216, .02213155, .02314094, .02415033, .02515972, .02616912, .02717851, .0281879, .02919729, .03020668, .03121607, .03222546, .03323485, .03424424, .03525363, .03626303, .03727242
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====se_clu_bs=====

se_clu_bs:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1000         -       1000
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 1000         -       1000
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0081414        .038693                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}se_clu_bs {c |}{res}      1000    .0179188    .0058141   .0081414    .038693
@mean     0.018
@sd     0.006
@min     0.008
@max     0.039
@example0 .02263964
@histh 2.8476403, 16.136629, 31.324043, 68.343369, 98.718201, 113.90561, 112.9564, 98.718201, 64.546516, 22.781122, 12.339775, 10.441348, 18.984268, 35.120895, 58.851234, 61.698872, 33.222469, 18.035055, 16.136629, 5.6952806, 12.339775, 9.4921341, 11.390561, 3.7968538, 1.8984269, 2.8476403, 1.8984269, 1.8984269, 2.8476403
@histw .00866816, .00972166, .01077517, .01182867, .01288217, .01393568, .01498918, .01604269, .01709619, .01814969, .0192032, .0202567, .0213102, .02236371, .02341721, .02447072, .02552422, .02657772, .02763123, .02868473, .02973824, .03079174, .03184524, .03289875, .03395225, .03500576, .03605926, .03711276, .03816627
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====bs_misreps_b=====

bs_misreps_b:                                   {txt}Number of Observations
{hline 15}                             {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1000      1000          -
{txt}{c |}  {res}#                         {txt}Positive           {res}-         -          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1000      1000          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                                            1000
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
bs_misreps_b {c |}{res}      1000           0           0          0          0
@mean     0.000
@sd     0.000
@min     0.000
@max     0.000
@values 0
@type float
@label 
@class constant
@N_unique 1
@N 1000
 
_@NOTES
 
=====bs_misreps_t=====

bs_misreps_t:                                   {txt}Number of Observations
{hline 15}                             {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1000      1000          -
{txt}{c |}  {res}#                         {txt}Positive           {res}-         -          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1000      1000          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                                            1000
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
bs_misreps_t {c |}{res}      1000           0           0          0          0
@mean     0.000
@sd     0.000
@min     0.000
@max     0.000
@values 0
@type float
@label 
@class constant
@N_unique 1
@N 1000
 
_@NOTES
 
=====p_pairs_bs=====

p_pairs_bs:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #       #   #         {txt}Zero           {res}    2         2          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res}  998         2        996
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1000         4        996
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}p_pairs_bs {c |}{res}      1000      .48798    .2936038          0          1
@mean     0.488
@sd     0.294
@min     0.000
@max     1.000
@example0 .76999998
@histh 1.102, .81199998, 1.334, 1.16, 1.131, 1.3049999, 1.16, 1.044, 1.044, .46399999, 1.131, .92799997, .69599998, 1.015, .986, 1.015, .95700002, .986, 1.131, .63800001, .81199998, 1.131, 1.131, 1.2180001, .92799997, .84100002, .986, .84100002, 1.073
@histw .01724138, .05172414, .0862069, .12068965, .15517241, .18965517, .22413793, .25862068, .29310346, .3275862, .36206895, .39655173, .43103448, .46551725, .5, .53448278, .56896549, .60344827, .63793105, .67241377, .70689654, .74137932, .7758621, .81034482, .84482759, .87931037, .91379309, .94827586, .98275864
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====p_rad_res=====

p_rad_res:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Zero           {res}    2         2          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res}  998         1        997
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1000         3        997
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}p_rad_res {c |}{res}      1000     .493955    .2913667          0          1
@mean     0.494
@sd     0.291
@min     0.000
@max     1.000
@example0 .83499998
@histh 1.044, .986, 1.073, .84100002, 1.334, 1.247, 1.247, .92799997, 1.073, .81199998, .667, .72500002, 1.2180001, .89899999, .84100002, 1.189, 1.131, .69599998, .95700002, 1.044, 1.044, 1.2180001, .986, .75400001, 1.073, 1.189, .87, 1.102, .81199998
@histw .01724138, .05172414, .0862069, .12068965, .15517241, .18965517, .22413793, .25862068, .29310346, .3275862, .36206895, .39655173, .43103448, .46551725, .5, .53448278, .56896549, .60344827, .63793105, .67241377, .70689654, .74137932, .7758621, .81034482, .84482759, .87931037, .91379309, .94827586, .98275864
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
=====p_webb_res=====

p_webb_res:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Zero           {res}    1         1          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res}  999         4        995
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1000         5        995
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      1000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}p_webb_res {c |}{res}      1000    .4955775    .2923091          0          1
@mean     0.496
@sd     0.292
@min     0.000
@max     1.000
@example0 .815
@histh 1.073, .95700002, 1.073, .89899999, 1.044, 1.363, 1.102, 1.247, 1.16, .75400001, .551, .92799997, .84100002, .87, 1.16, .986, .986, .89899999, 1.044, .92799997, 1.247, 1.131, .87, .667, 1.363, .89899999, .92799997, 1.102, .92799997
@histw .01724138, .05172414, .0862069, .12068965, .15517241, .18965517, .22413793, .25862068, .29310346, .3275862, .36206895, .39655173, .43103448, .46551725, .5, .53448278, .56896549, .60344827, .63793105, .67241377, .70689654, .74137932, .7758621, .81034482, .84482759, .87931037, .91379309, .94827586, .98275864
@type float
@label 
@class other
@N_unique .
@N 1000
 
_@NOTES
 
{com}. 
. // noi profiler report
. // profiler off
. {c )-}
{txt}
{com}. 
. exit, clear STATA
