{smcl}
{txt}{sf}{ul off}

{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. cap noi {c -(}
. 
. use  "/Users/mas/Dropbox/Public/cameron/t2_mcout_G_6.dta"
. 
. describe, short

{txt}Contains data from {res}/Users/mas/Dropbox/Public/cameron/t2_mcout_G_6.dta
{txt}  obs:{res}         4,000                          
{txt} vars:{res}            20                          29 Jun 2014 21:26
{txt} size:{res}       384,000                          
{txt}Sorted by:  
{com}. 
. local N = r(N)
. local variables = r(k)
. 
. di "@N `N'"
{res}@N 4000
{com}. di "@variables `variables'"
{res}@variables 20
{com}. 
. datasignature
  {res}4000:20(34788):3680999469:40161886
{com}. local datasig = "`r(datasignature)'"
. 
. di "@datasignature `datasig'"
{res}@datasignature 4000:20(34788):3680999469:40161886
{com}. 
. cap noi xtset
{err}panel variable not set; use {bf:xtset} {it:varname} ...
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
.     di "@panelvar `r(panelvar)'"
. {c )-}
. 
. notes _dta
{res}{com}. 
. qui {c -(}
. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====numobs=====

{res}numobs:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 4000      4000          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 4000      4000          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}751                4268                      4000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}numobs {c |}{res}      4000    1554.337    434.0818        751       4268
@mean  1554.337
@sd   434.082
@min   751.000
@max  4268.000
@example0 1235
@histh .00002559, .00012027, .00035314, .00080608, .00118993, .00123856, .00126415, .00100569, .00091612, .0006679, .00043759, .00041712, .00029428, .00023799, .00029428, .0002431, .00020216, .00012795, .00010748, .00006142, .00005374, .00005886, .0000435, .00001791, .00002303, 7.677e-06, .00001024, 5.118e-06, 2.559e-06, 2.559e-06
@histw 799.84723, 897.54169, 995.23608, 1092.9305, 1190.625, 1288.3195, 1386.0139, 1483.7084, 1581.4028, 1679.0972, 1776.7916, 1874.4861, 1972.1805, 2069.875, 2167.5693, 2265.2639, 2362.9583, 2460.6528, 2558.3472, 2656.0417, 2753.7361, 2851.4307, 2949.125, 3046.8193, 3144.5139, 3242.2083, 3339.9028, 3437.5972, 3535.2917, 4219.1528
@type float
@label 
@class other
@N_unique .
@N 4000
 
_@NOTES
 
=====numstates=====

numstates:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4000      4000          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4000      4000          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}6                                            4000
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}numstates {c |}{res}      4000           6           0          6          6
@mean     6.000
@sd     0.000
@min     6.000
@max     6.000
@values 6
@type float
@label 
@class constant
@N_unique 1
@N 4000
 
_@NOTES
 
=====K=====

K:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4000      4000          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4000      4000          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5                                            4000
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}K {c |}{res}      4000           5           0          5          5
@mean     5.000
@sd     0.000
@min     5.000
@max     5.000
@values 5
@type float
@label 
@class constant
@N_unique 1
@N 4000
 
_@NOTES
 
=====numbsreps=====

numbsreps:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 4000      4000          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 4000      4000          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}399                                          4000
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}numbsreps {c |}{res}      4000         399           0        399        399
@mean   399.000
@sd     0.000
@min   399.000
@max   399.000
@values 399
@type float
@label 
@class constant
@N_unique 1
@N 4000
 
_@NOTES
 
=====b=====

b:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative       {res} 2021         -       2021
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 1979         -       1979
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 4000         -       4000
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}-.2103293      .2281088                      4000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}b {c |}{res}      4000   -.0012482    .0674836  -.2103293   .2281088
@mean    -0.001
@sd     0.067
@min    -0.210
@max     0.228
@example0 -.05181335
@histh .08210966, .08210966, .06158225, .24632899, .41054833, .6774047, .98531598, 1.5395561, 1.9295771, 2.5043447, 2.9559479, 3.8386269, 3.7975719, 4.9676347, 5.0497441, 5.3987103, 5.6039844, 5.3781829, 5.3781829, 5.3987103, 5.1934361, 4.1670656, 3.6949348, 3.3459687, 2.7506738, 2.2785432, 1.6011385, 1.1084805, .57476765, .39002091, .36949348, .1231645, .06158225, .10263708, .04105483, .02052741
@histw -.20423986, -.19206102, -.1798822, -.16770336, -.15552452, -.14334568, -.13116686, -.11898802, -.10680918, -.09463035, -.08245151, -.07027268, -.05809385, -.04591502, -.03373618, -.02155734, -.00937851, .00280032, .01497916, .02715799, .03933683, .05151566, .0636945, .07587333, .08805217, .100231, .11240984, .12458867, .13676751, .14894634, .16112517, .17330401, .18548284, .19766168, .20984051, .22201934
@type float
@label 
@class other
@N_unique .
@N 4000
 
_@NOTES
 
=====se_rob=====

se_rob:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 4000         -       4000
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 4000         -       4000
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.016615        .0415112                      4000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}se_rob {c |}{res}      4000    .0278946    .0032324    .016615   .0415112
@mean     0.028
@sd     0.003
@min     0.017
@max     0.042
@example0 .03076103
@histh .3615014, 3.6150141, 6.8685265, 9.3990364, 15.54456, 24.582096, 28.558611, 36.150139, 59.286228, 65.793259, 82.060822, 108.81192, 119.65697, 139.17804, 115.31895, 124.71799, 112.78844, 91.821358, 70.492775, 62.178242, 54.225208, 45.187675, 22.051586, 21.690084, 9.7605381, 6.8685265, 1.807507, 3.2535126, .72300279, 1.0845042, 1.0845042, .3615014, .3615014, .3615014
@histw .01696083, .01903551, .01972707, .02041863, .02111019, .02180175, .02249331, .02318487, .02387643, .02456799, .02525955, .02595111, .02664267, .02733423, .02802579, .02871735, .02940891, .03010047, .03079204, .03148359, .03217516, .03286672, .03355828, .03424983, .0349414, .03563296, .03632452, .03701608, .03770764, .0383992, .03909076, .03978232, .04047388, .04116544
@type float
@label 
@class other
@N_unique .
@N 4000
 
_@NOTES
 
=====se_clu=====

se_clu:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4000         -       4000
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 4000         -       4000
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0021927       .1273222                      4000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}se_clu {c |}{res}      4000    .0493174    .0195178   .0021927   .1273222
@mean     0.049
@sd     0.020
@min     0.002
@max     0.127
@example0 .06822716
@histh .14385103, .79118067, 2.08584, 3.8120522, 7.5521789, 8.3433599, 12.802741, 13.234295, 15.607837, 18.053305, 19.923367, 19.419889, 17.334049, 19.635666, 19.060261, 18.628708, 17.262123, 12.586965, 13.30622, 9.9976463, 9.4222422, 7.1925511, 4.4593821, 4.6751585, 3.4524245, 2.948946, 2.3016164, 1.0788827, .86310613, .57540411, .35962757, .07192551, .21577653, .07192551, .14385103, .28770205
@histw .00393061, .00740643, .01088225, .01435806, .01783388, .0213097, .02478552, .02826134, .03173716, .03521297, .03868879, .04216461, .04564043, .04911625, .05259207, .05606788, .0595437, .06301951, .06649534, .06997115, .07344697, .07692279, .08039861, .08387443, .08735024, .09082606, .09430188, .0977777, .10125352, .10472933, .10820515, .11168097, .11515679, .11863261, .12210842, .12558424
@type float
@label 
@class other
@N_unique .
@N 4000
 
_@NOTES
 
=====se_CR2=====

se_CR2:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4000         -       4000
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 4000         -       4000
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0026841       .1551014                      4000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}se_CR2 {c |}{res}      4000    .0582083    .0235895   .0026841   .1551014
@mean     0.058
@sd     0.024
@min     0.003
@max     0.155
@example0 .0763998
@histh .11809683, .8266778, 2.1257429, 3.7790985, 6.9677129, 8.5620193, 11.042053, 11.750634, 14.525909, 15.647829, 15.529733, 14.407813, 16.887846, 15.293539, 14.703054, 15.116394, 12.518264, 11.219198, 10.156327, 8.266778, 6.8496161, 4.5467277, 4.1924372, 3.0705175, 2.3619366, 1.5352588, 1.5352588, .70858097, .53143573, .47238731, .29524207, .11809683, .05904841, .11809683, .35429049
@histw .00480102, .00903483, .01326865, .01750246, .02173628, .02597009, .0302039, .03443772, .03867153, .04290535, .04713916, .05137298, .05560679, .0598406, .06407441, .06830823, .07254204, .07677586, .08100967, .08524349, .0894773, .09371112, .09794493, .10217874, .10641256, .11064637, .11488018, .119114, .12334781, .12758163, .13181545, .14028306, .14451689, .14875069, .15298451
@type float
@label 
@class other
@N_unique .
@N 4000
 
_@NOTES
 
=====se_CR3=====

se_CR3:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 4000         -       4000
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 4000         -       4000
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0032846       .2176846                      4000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}se_CR3 {c |}{res}      4000     .071146    .0314166   .0032846   .2176846
@mean     0.071
@sd     0.031
@min     0.003
@max     0.218
@example0 .08632328
@histh .08395521, 1.1333953, 2.6445892, 4.9953351, 7.7238793, 9.0671625, 9.9486923, 12.929102, 12.299438, 12.425371, 12.719214, 12.803169, 10.998133, 9.9067144, 9.1930952, 7.8917899, 6.5485063, 5.9188423, 4.3236933, 3.8619397, 2.1408579, 2.5606339, 1.595149, .96548492, .88152969, .75559688, .33582085, .25186563, .08395521, .41977605, .20988803, .25186563, .04197761
@histw .00626234, .0122179, .01817345, .02412901, .03008457, .03604012, .04199568, .04795124, .05390679, .05986235, .06581791, .07177346, .07772902, .08368457, .08964013, .09559569, .10155124, .1075068, .11346236, .11941791, .12537347, .13132903, .13728458, .14324014, .1491957, .15515125, .16110681, .16706237, .17301792, .18492904, .19088459, .19684015, .21470682
@type float
@label 
@class other
@N_unique .
@N 4000
 
_@NOTES
 
=====dof_CR2_IK=====

dof_CR2_IK:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4000         -       4000
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4000         -       4000
{txt}{c |}  {res}.   .   .   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.5729263        4.06574                      4000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}dof_CR2_IK {c |}{res}      4000    3.333978    .3468129   .5729263    4.06574
@mean     3.334
@sd     0.347
@min     0.573
@max     4.066
@example0 3.2863421
@histh .00257672, .00257672, .00257672, .00257672, .00773016, .00773016, .00773016, .00515344, .01803703, .04895766, .06184126, .11337564, .13656612, .27570894, .34012693, .65190995, .73694164, 1.017804, 1.0203807, 1.0281109, 1.0281109, 1.0538781, .98172998, .76013213, .62871945, .2963227, .06957141
@histw .62143761, 1.3005959, 1.4946411, 1.7857089, 1.8827314, 1.9797541, 2.0767767, 2.1737993, 2.2708218, 2.3678446, 2.4648671, 2.5618896, 2.6589124, 2.755935, 2.8529575, 2.94998, 3.0470028, 3.1440253, 3.2410479, 3.3380706, 3.4350932, 3.5321157, 3.6291385, 3.726161, 3.8231835, 3.9202063, 4.0172286
@type float
@label 
@class other
@N_unique .
@N 4000
 
_@NOTES
 
=====dof_CSS=====

dof_CSS:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 4000         -       4000
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 4000         -       4000
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0115636       5.999156                      4000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dof_CSS {c |}{res}      4000    4.669961    .8436908   .0115636   5.999156
@mean     4.670
@sd     0.844
@min     0.012
@max     5.999
@example0 4.9664574
@histh .00150311, .00300622, .00300622, .00150311, .00300622, .00300622, .00150311, .00150311, .00601243, .00450933, .00300622, .00300622, .02104352, .04208703, .07665852, .08868339, .11423624, .13527974, .13678285, .180373, .19239786, .23147868, .27356571, .29160303, .34872115, .38780195, .47798845, .45844805, .48700711, .56817496, .50354129, .48700711, .30513099, .16985124
@histw .0947246, .42736864, .59369063, .76001263, .92633468, 1.0926566, 1.4253007, 1.5916227, 1.7579447, 1.9242667, 2.0905888, 2.2569108, 2.4232328, 2.5895548, 2.7558768, 2.9221988, 3.0885208, 3.2548428, 3.4211648, 3.5874867, 3.7538087, 3.920131, 4.086453, 4.2527747, 4.4190969, 4.5854187, 4.7517409, 4.9180632, 5.0843849, 5.2507071, 5.4170289, 5.5833511, 5.7496729, 5.9159951
@type float
@label 
@class other
@N_unique .
@N 4000
 
_@NOTES
 
=====se_clu_bs=====

se_clu_bs:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4000         -       4000
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 4000         -       4000
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0023811       .1465599                      4000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}se_clu_bs {c |}{res}      4000    .0558262    .0215145   .0023811   .1465599
@mean     0.056
@sd     0.022
@min     0.002
@max     0.147
@example0 .0786505
@histh .12484502, .56180257, 1.6229852, 4.1823082, 5.6804485, 9.5506439, 9.9876013, 12.109967, 12.859037, 15.231092, 16.354698, 15.792895, 17.103767, 18.227373, 17.041346, 17.041346, 15.231092, 12.609347, 11.42332, 9.1761093, 7.4907012, 5.3683357, 4.3695755, 2.9962804, 2.5593228, 1.4981402, 1.0611826, .81149262, .62422508, .18726753, .37453505, .18726753, .18726753, .06242251
@histw .00438359, .00838855, .01239352, .01639849, .02040345, .02440842, .02841338, .03241835, .03642331, .04042828, .04443324, .04843821, .05244318, .05644814, .06045311, .06445807, .06846303, .07246801, .07647297, .08047793, .0844829, .08848786, .09249283, .0964978, .10050276, .10450773, .10851269, .11251765, .11652263, .12052759, .12453255, .12853752, .13254249, .14455739
@type float
@label 
@class other
@N_unique .
@N 4000
 
_@NOTES
 
=====bs_misreps=====

bs_misreps:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 4000      4000          -
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 4000      4000          -
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                    27                      4000
  (25 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}bs_misreps {c |}{res}      4000    12.46875    3.505438          2         27
@mean    12.469
@sd     3.505
@min     2.000
@max    27.000
@values 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 27
@names "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "27"
@freq 1, 5, 11, 48, 79, 134, 203, 323, 402, 448, 440, 422, 399, 325, 228, 191, 143, 91, 52, 21, 18, 8, 5, 2, 1
@type float
@label 
@class category
@N_unique 25
@N 4000
 
_@NOTES
 
=====p_pairs_bs=====

p_pairs_bs:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #   #             {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #   #   #         {txt}Positive       {res} 4000         5       3995
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4000         5       3995
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.005168               1                      4000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}p_pairs_bs {c |}{res}      4000    .5199485    .2623313    .005168          1
@mean     0.520
@sd     0.262
@min     0.005
@max     1.000
@example0 .5984655
@histh .20807533, .21712208, .49757144, .49757144, .7780208, 1.3117793, 1.3298727, 1.3208259, 1.0765636, 1.4836675, 1.3208259, 1.1398909, 1.1308441, 1.0403767, 1.0856104, 1.176078, .93181556, 1.0946572, 1.1489377, .84134805, 1.0041896, 1.0403767, 1.1489377, 1.2574987, 1.1670312, 1.1489377, 1.0675169, 1.1308441, 1.0675169, 1.0222831, 1.1037039, .93181556, .89562857, .94086236, .89562857, .73278701
@histw .01898507, .04661929, .07425351, .10188774, .12952197, .15715618, .18479042, .21242464, .24005885, .26769307, .29532731, .32296154, .35059574, .37822998, .40586421, .43349841, .46113265, .48876688, .51640111, .54403532, .57166952, .59930378, .62693799, .65457219, .68220645, .70984066, .73747486, .76510912, .79274333, .82037753, .84801179, .875646, .9032802, .93091446, .95854867, .98618287
@type float
@label 
@class other
@N_unique .
@N 4000
 
_@NOTES
 
=====p_rad_res=====

p_rad_res:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #   #             {txt}Positive       {res} 4000         5       3995
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4000         5       3995
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0025                 1                      4000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}p_rad_res {c |}{res}      4000    .4514044    .2902531      .0025          1
@mean     0.451
@sd     0.290
@min     0.002
@max     1.000
@example0 .505
@histh 1.3984963, 1.7864661, 1.7593985, 1.2902255, 1.4526316, .99248123, 1.0736842, 1.0105263, .84812027, 1.0105263, .80300754, .7218045, 1.0736842, .8661654, .76691729, .9744361, 1.0556391, .90225565, 1.0917293, .91127819, 1.037594, 1.1187969, .93834585, .95639098, 1.1639098, .92932332, .94736844, .92932332, .99248123, 1.0015037, .95639098, .76691729, .76691729, .56842107, .63157892, .59548873
@histw .01635417, .0440625, .07177083, .09947917, .12718751, .15489583, .18260416, .2103125, .23802084, .26572916, .29343751, .32114583, .34885415, .37656251, .40427083, .43197918, .4596875, .48739582, .51510417, .54281253, .57052082, .59822917, .62593752, .65364581, .68135417, .70906252, .73677081, .76447916, .79218751, .8198958, .84760416, .87531251, .90302086, .93072915, .9584375, .98614585
@type float
@label 
@class other
@N_unique .
@N 4000
 
_@NOTES
 
=====p_rad_res_high=====

p_rad_res_high:                                 {txt}Number of Observations
{hline 17}                           {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #             {txt}Positive       {res} 4000        17       3983
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4000        17       3983
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.005                  1                      4000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
p_rad_res_~h {c |}{res}      4000    .4670563    .2901327       .005          1
@mean     0.467
@sd     0.290
@min     0.005
@max     1.000
@example0 .52499998
@histh .64221108, 1.682412, 1.7005025, 1.6914573, 1.2572864, 1.3025125, .97688442, 1.157789, .79597992, 1.0402009, .76884425, .84120601, .81407034, .97688442, .74170852, 1.0221106, .81407034, 1.0944724, 1.1035175, .88643217, 1.121608, .93165827, 1.2030151, .8050251, 1.1849246, .79597992, 1.0492462, .89547741, 1.0492462, .89547741, 1.1125628, .8050251, .88643217, .56080401, .66030151, .91356784
@histw .01881944, .04645833, .07409722, .10173611, .129375, .15701389, .18465278, .21229167, .23993056, .26756945, .29520833, .32284722, .3504861, .37812501, .40576389, .43340278, .46104166, .48868054, .51631945, .54395831, .57159722, .59923613, .62687498, .6545139, .68215275, .70979166, .73743057, .76506943, .79270834, .82034725, .8479861, .87562501, .90326387, .93090278, .95854169, .98618054
@type float
@label 
@class other
@N_unique .
@N 4000
 
_@NOTES
 
=====p_rad_res_low=====

p_rad_res_low:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}   62        62          -
{txt}{c |}  {res}#       #   #             {txt}Positive       {res} 3938         -       3938
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4000        62       3938
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                   .99                      4000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
p_rad_res_~w {c |}{res}      4000      .43557    .2901711          0        .99
@mean     0.436
@sd     0.290
@min     0.000
@max     0.990
@example0 .48500001
@histh 2.0818181, 2.1909091, 1.2727273, 1.5636363, 1.0909091, .85454547, 1.2272727, 1.0727272, .78181815, .86363637, .85454547, .81818181, .9909091, .87272727, .78181815, 1.1454545, .79090911, .89999998, 1.2363636, .87272727, 1.1363636, 1.0454545, 1, .88181818, 1.1181818, .9909091, .97272724, .92727274, 1.0363636, 1.0090909, .80000001, .86363637, .68181819, .61818182, .5272727, .4909091
@histw .01375, .04125, .06875, .09625, .12375, .15125, .17875001, .20625, .23375, .26124999, .28874999, .31625, .34375, .37125, .39875001, .42625001, .45375001, .48125002, .50875002, .53625, .56375003, .59125, .61874998, .64625001, .67374998, .70125002, .72874999, .75625002, .78375, .81125003, .83875, .86625004, .89375001, .92124999, .94875002, .97624999
@type float
@label 
@class other
@N_unique .
@N 4000
 
_@NOTES
 
=====p_rad_unres=====

p_rad_unres:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Zero           {res}   99        99          -
{txt}{c |}  {res}#   #   #   #             {txt}Positive       {res} 3901         9       3892
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4000       108       3892
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}p_rad_unres {c |}{res}      4000    .4473219    .2789251          0          1
@mean     0.447
@sd     0.279
@min     0.000
@max     1.000
@example0 .58999997
@histh 2.2409999, 1.206, 1.026, .972, .89999998, .87300003, .74699998, 1.179, 1.143, 1.413, 1.17, .792, 1.242, .89999998, 1.179, .77399999, 1.404, 1.143, 1.4400001, 1.404, .94499999, .87300003, .78299999, .99000001, .82800001, .87300003, .82800001, 1.08, .972, .78299999, .89099997, .77399999, .81, .44999999, .62099999, .35100001
@histw .01388889, .04166667, .06944445, .09722222, .125, .15277778, .18055555, .20833333, .2361111, .2638889, .29166666, .31944445, .34722221, .375, .40277779, .43055555, .45833334, .4861111, .5138889, .54166669, .56944442, .59722221, .625, .65277779, .68055558, .70833331, .7361111, .7638889, .79166669, .81944442, .84722221, .875, .90277779, .93055558, .95833331, .9861111
@type float
@label 
@class other
@N_unique .
@N 4000
 
_@NOTES
 
=====p_webb_res=====

p_webb_res:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}    1         1          -
{txt}{c |}  {res}#       #   #             {txt}Positive       {res} 3999         4       3995
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 4000         5       3995
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      4000
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}p_webb_res {c |}{res}      4000    .4531975    .2943024          0          1
@mean     0.453
@sd     0.294
@min     0.000
@max     1.000
@example0 .55500001
@histh 1.4579999, 1.971, 1.386, 1.6109999, 1.08, 1.1339999, .90899998, 1.053, .89999998, 1.026, .93599999, .639, .93599999, .82800001, .92699999, .88200003, .99000001, .81, 1.107, 1.215, .90899998, 1.1160001, .81900001, 1.089, .94499999, 1.089, .77399999, 1.044, .954, .85500002, .85500002, .76499999, .93599999, .63, .67500001, .74699998
@histw .01388889, .04166667, .06944445, .09722222, .125, .15277778, .18055555, .20833333, .2361111, .2638889, .29166666, .31944445, .34722221, .375, .40277779, .43055555, .45833334, .4861111, .5138889, .54166669, .56944442, .59722221, .625, .65277779, .68055558, .70833331, .7361111, .7638889, .79166669, .81944442, .84722221, .875, .90277779, .93055558, .95833331, .9861111
@type float
@label 
@class other
@N_unique .
@N 4000
 
_@NOTES
 
=====datetime=====
@freq 4000
@values "29 Jun 2014 21:26:57"
@example0 29 Jun 2014 21:26:57
@type str20
@label 
@class constant
@N_unique 1
@N 4000
 
_@NOTES
 
{com}. 
. // noi profiler report
. // profiler off
. {c )-}
{txt}
{com}. 
. exit, clear STATA
