{smcl}
{txt}{sf}{ul off}

{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. cap noi {c -(}
. 
. use  "/Users/mas/Dropbox/Public/cameron/t2_post_G6_25_Jun_2014.dta"
. 
. describe, short

{txt}Contains data from {res}/Users/mas/Dropbox/Public/cameron/t2_post_G6_25_Jun_2014.dta
{txt}  obs:{res}         1,052                          
{txt} vars:{res}            19                          25 Jun 2014 19:14
{txt} size:{res}        79,952                          
{txt}Sorted by:  
{com}. 
. local N = r(N)
. local variables = r(k)
. 
. di "@N `N'"
{res}@N 1052
{com}. di "@variables `variables'"
{res}@variables 19
{com}. 
. datasignature
  {res}1052:19(101143):3034725897:3224802375
{com}. local datasig = "`r(datasignature)'"
. 
. di "@datasignature `datasig'"
{res}@datasignature 1052:19(101143):3034725897:3224802375
{com}. 
. cap noi xtset
{err}panel variable not set; use {bf:xtset} {it:varname} ...
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
.     di "@panelvar `r(panelvar)'"
. {c )-}
. 
. notes _dta
{res}{com}. 
. qui {c -(}
. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====numobs=====

{res}numobs:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1052      1052          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 1052      1052          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}856                3392                      1052
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}numobs {c |}{res}      1052    1549.551    424.2669        856       3392
@mean  1549.551
@sd   424.267
@min   856.000
@max  3392.000
@example0 1235
@histh .00014618, .00030361, .00064096, .00109076, .00113574, .00148433, .00119196, .00096706, .00097831, .00073092, .00047229, .00042731, .00037108, .00019116, .00030361, .00025863, .00025863, .00019116, .00019116, .00013494, .00007871, .00005622, .00005622, .00005622, .00004498, .00001124, .00003373, .00001124, .00001124
@histw 898.26666, 982.79999, 1067.3334, 1151.8667, 1236.4, 1320.9333, 1405.4667, 1490, 1574.5333, 1659.0667, 1743.6, 1828.1333, 1912.6666, 1997.2, 2081.7334, 2166.2666, 2250.8, 2335.3333, 2419.8667, 2504.3999, 2588.9333, 2673.4666, 2758, 2842.5334, 2927.0667, 3011.6001, 3096.1333, 3265.2, 3349.7334
@type float
@label 
@class other
@N_unique .
@N 1052
 
_@NOTES
 
=====numstates=====

numstates:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1052      1052          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1052      1052          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}6                                            1052
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}numstates {c |}{res}      1052           6           0          6          6
@mean     6.000
@sd     0.000
@min     6.000
@max     6.000
@values 6
@type float
@label 
@class constant
@N_unique 1
@N 1052
 
_@NOTES
 
=====K=====

K:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1052      1052          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1052      1052          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5                                            1052
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}K {c |}{res}      1052           5           0          5          5
@mean     5.000
@sd     0.000
@min     5.000
@max     5.000
@values 5
@type float
@label 
@class constant
@N_unique 1
@N 1052
 
_@NOTES
 
=====numbsreps=====

numbsreps:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1052      1052          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1052      1052          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}399                                          1052
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}numbsreps {c |}{res}      1052         399           0        399        399
@mean   399.000
@sd     0.000
@min   399.000
@max   399.000
@values 399
@type float
@label 
@class constant
@N_unique 1
@N 1052
 
_@NOTES
 
=====b=====

b:                                              {txt}Number of Observations
{hline 4}                                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative       {res}  544         -        544
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res}  508         -        508
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 1052         -       1052
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}-.2103293      .2055007                      1052
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 11}b {c |}{res}      1052   -.0034536    .0687644  -.2103293   .2055007
@mean    -0.003
@sd     0.069
@min    -0.210
@max     0.206
@example0 -.05181335
@histh .20573631, .06857877, .06857877, .34289384, .4800514, 1.3715754, 1.7144693, 2.1945207, 2.674572, 2.9488871, 3.9089899, 4.1833048, 5.4863014, 5.4177227, 5.0748291, 5.7606168, 4.731935, 5.8977742, 4.3890414, 4.1833048, 2.6059933, 2.4002569, 2.3316782, 1.2344179, 1.0286815, .61720896, .54863018, .13715754, .06857877, .06857877
@histw -.20339878, -.18953778, -.17567678, -.16181578, -.14795478, -.13409378, -.12023278, -.10637178, -.09251078, -.07864978, -.06478878, -.05092778, -.03706678, -.02320578, -.00934478, .00451622, .01837722, .03223822, .04609922, .05996022, .07382122, .08768222, .10154322, .11540422, .12926522, .14312622, .15698722, .17084822, .18470922, .19857022
@type float
@label 
@class other
@N_unique .
@N 1052
 
_@NOTES
 
=====se_rob=====

se_rob:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 1052         -       1052
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 1052         -       1052
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0188415        .037377                      1052
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}se_rob {c |}{res}      1052    .0279298    .0031735   .0188415    .037377
@mean     0.028
@sd     0.003
@min     0.019
@max     0.037
@example0 .03076103
@histh 4.6155243, 1.5385082, 6.1540327, 20.000607, 24.616131, 33.847179, 24.616131, 33.847179, 47.693752, 80.002426, 78.463913, 110.77259, 123.08065, 150.7738, 129.23468, 120.00364, 116.92662, 93.848999, 106.15707, 72.309883, 64.61734, 43.078228, 38.462704, 26.154638, 23.077621, 20.000607, 10.769557, 3.0770164, 10.769557
@histw .01915039, .01976824, .02038609, .02100394, .0216218, .02223965, .0228575, .02347535, .02409321, .02471106, .02532891, .02594676, .02656461, .02718246, .02780032, .02841817, .02903602, .02965387, .03027172, .03088958, .03150743, .03212528, .03274313, .03336098, .03397883, .03459669, .03521454, .03583239, .0370681
@type float
@label 
@class other
@N_unique .
@N 1052
 
_@NOTES
 
=====se_clu=====

se_clu:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 1052         -       1052
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 1052         -       1052
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0083007       .1207492                      1052
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}se_clu {c |}{res}      1052    .0495931    .0192062   .0083007   .1207492
@mean     0.050
@sd     0.019
@min     0.008
@max     0.121
@example0 .06822716
@histh 3.2968187, 2.282413, 6.3400364, 7.6080437, 10.651261, 13.94808, 17.752102, 20.034515, 21.556124, 19.27371, 15.216087, 19.27371, 17.752102, 19.020109, 14.455282, 14.962485, 8.8760509, 9.3832541, 4.8184276, 7.3544421, 3.5504203, 3.0432174, 2.7896159, .76080436, 1.5216087, .25360146, .25360146, .25360146, .50720292
@histw .01017483, .01392312, .0176714, .02141969, .02516797, .02891625, .03266454, .03641282, .04016111, .04390939, .04765768, .05140596, .05515425, .05890253, .06265081, .0663991, .07014738, .07389566, .07764395, .08139224, .08514052, .0888888, .09263708, .09638537, .10013366, .10388194, .11137851, .1151268, .11887508
@type float
@label 
@class other
@N_unique .
@N 1052
 
_@NOTES
 
=====se_CR2=====

se_CR2:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 1052         -       1052
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 1052         -       1052
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0090336       .1530534                      1052
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}se_CR2 {c |}{res}      1052    .0586485    .0235054   .0090336   .1530534
@mean     0.059
@sd     0.024
@min     0.009
@max     0.153
@example0 .0763998
@histh 2.3760989, 2.1780906, 6.3362637, 7.1282964, 10.09842, 13.464561, 15.246634, 17.226717, 15.642651, 15.444643, 15.444643, 12.870536, 15.642651, 11.682487, 12.672527, 8.1183376, 7.1282964, 5.5442305, 4.7521977, 2.9701235, 1.9800824, 1.3860576, .9900412, .39601648, .19800824, .59402472, .39601648, .39601648
@histw .01143392, .01623458, .02103524, .0258359, .03063656, .03543722, .04023788, .04503854, .0498392, .05463986, .05944052, .06424119, .06904184, .0738425, .07864317, .08344383, .08824448, .09304515, .09784581, .10264647, .10744713, .11224779, .11704845, .12184911, .12664977, .13145043, .14105175, .15065308
@type float
@label 
@class other
@N_unique .
@N 1052
 
_@NOTES
 
=====se_CR3=====

se_CR3:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 1052         -       1052
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 1052         -       1052
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0097992       .1998091                      1052
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}se_CR3 {c |}{res}      1052    .0718949    .0323027   .0097992   .1998091
@mean     0.072
@sd     0.032
@min     0.010
@max     0.200
@example0 .08632328
@histh 1.8009866, 1.5008222, 5.5530419, 6.6036177, 11.256166, 12.15666, 12.606907, 12.15666, 13.957646, 11.406249, 10.956002, 10.80592, 9.0049334, 8.404604, 7.2039466, 5.7031245, 3.6019733, 2.7014799, 3.0016444, 1.8009866, 1.2006577, .75041109, .60032886, .75041109, .15008222, .45024666, 1.0505755, .30016443, .45024666
@histw .01296602, .01929968, .02563335, .03196701, .03830067, .04463434, .050968, .05730167, .06363533, .06996899, .07630266, .08263632, .08896998, .09530365, .10163731, .10797098, .11430464, .1206383, .12697197, .13330564, .1396393, .14597297, .15230663, .1586403, .16497396, .17130762, .18397495, .19030862, .19664228
@type float
@label 
@class other
@N_unique .
@N 1052
 
_@NOTES
 
=====dof_CR2_IK=====

dof_CR2_IK:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 1052         -       1052
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 1052         -       1052
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1.793297       4.017489                      1052
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}dof_CR2_IK {c |}{res}      1052    3.332032    .3453972   1.793297   4.017489
@mean     3.332
@sd     0.345
@min     1.793
@max     4.017
@example0 3.2863421
@histh .02564267, .01282133, .01282133, .01282133, .05128534, .05128534, .038464, .076928, .076928, .12821335, .16667734, .25642669, .4102827, .67953068, .7564587, .87185073, 1.1282774, .93595737, 1.0513494, .93595737, 1.076992, .97442138, 1.076992, .93595737, .71799469, .51285338, .38464001, .12821335
@histw 1.8303672, 1.9045069, 2.0527864, 2.2010658, 2.2752056, 2.3493452, 2.423485, 2.4976249, 2.5717645, 2.6459043, 2.7200441, 2.7941837, 2.8683236, 2.9424632, 3.016603, 3.0907426, 3.1648824, 3.2390223, 3.3131618, 3.3873017, 3.4614415, 3.5355811, 3.6097209, 3.6838605, 3.7580004, 3.83214, 3.9062798, 3.9804196
@type float
@label 
@class other
@N_unique .
@N 1052
 
_@NOTES
 
=====dof_CSS=====

dof_CSS:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 1052         -       1052
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 1052         -       1052
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1.692142       5.999156                      1052
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}dof_CSS {c |}{res}      1052    4.685394    .8317333   1.692142   5.999156
@mean     4.685
@sd     0.832
@min     1.692
@max     5.999
@example0 4.9664574
@histh .01324217, .00662109, .01324217, .01986326, .02648434, .05296868, .10593736, .08607411, .09269519, .09269519, .15228496, .15228496, .19201148, .19201148, .21849582, .23835908, .29132774, .29132774, .3641597, .39726511, .49658141, .46347597, .48333922, .59589767, .47009706, .57603443, .46347597, .25160125, .16552714
@histw 1.7639251, 1.9074923, 2.1946266, 2.3381937, 2.4817607, 2.6253281, 2.7688951, 2.9124622, 3.0560296, 3.1995966, 3.3431637, 3.4867308, 3.6302981, 3.7738652, 3.9174323, 4.0609994, 4.2045665, 4.3481336, 4.4917011, 4.6352682, 4.7788353, 4.9224024, 5.0659695, 5.2095366, 5.3531036, 5.4966712, 5.6402383, 5.7838054, 5.9273725
@type float
@label 
@class other
@N_unique .
@N 1052
 
_@NOTES
 
=====se_clu_bs=====

se_clu_bs:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 1052         -       1052
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 1052         -       1052
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0091242        .131384                      1052
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}se_clu_bs {c |}{res}      1052    .0560748    .0213504   .0091242    .131384
@mean     0.056
@sd     0.021
@min     0.009
@max     0.131
@example0 .0786505
@histh 2.0992508, 3.7320015, 4.6650019, 6.7642527, 7.4640031, 10.729505, 14.694756, 15.627756, 18.893257, 14.461506, 17.960257, 20.759258, 14.228255, 17.260508, 14.228255, 13.062005, 13.062005, 8.1637535, 8.1637535, 4.1985016, 4.898252, 3.2655013, 2.0992508, 1.1662505, 1.1662505, .46650019, .93300039, .2332501, .46650019, .46650019
@histw .01116181, .01523714, .01931247, .0233878, .02746312, .03153845, .03561378, .0396891, .04376443, .04783976, .05191508, .05599041, .06006574, .06414106, .06821639, .07229172, .07636704, .08044237, .0845177, .08859302, .09266835, .09674368, .10081901, .10489433, .10896966, .11304498, .11712031, .12119564, .12527096, .1293463
@type float
@label 
@class other
@N_unique .
@N 1052
 
_@NOTES
 
=====bs_misreps=====

bs_misreps:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 1052      1052          -
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 1052      1052          -
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                    24                      1052
  (23 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}bs_misreps {c |}{res}      1052    12.56274    3.470257          2         24
@mean    12.563
@sd     3.470
@min     2.000
@max    24.000
@values 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24
@names "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24"
@freq 1, 3, 3, 9, 21, 30, 48, 84, 103, 117, 114, 111, 116, 94, 52, 54, 40, 23, 18, 4, 4, 1, 2
@type float
@label 
@class category
@N_unique 23
@N 1052
 
_@NOTES
 
=====p_pairs_bs=====

p_pairs_bs:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#       #             {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #   #   #         {txt}Positive       {res} 1052         1       1051
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1052         1       1051
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.005168               1                      1052
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}p_pairs_bs {c |}{res}      1052    .5213569    .2631759    .005168          1
@mean     0.521
@sd     0.263
@min     0.005
@max     1.000
@example0 .5984655
@histh .28665251, .14332625, .60197026, .48730928, 1.2899363, 1.261271, 1.2039405, 1.4332626, 1.3472668, 1.3472668, 1.031949, 1.1179448, 1.2899363, .94595331, 1.0606143, 1.0032837, .88862276, .97461855, .97461855, 1.2039405, 1.3472668, .97461855, 1.2039405, .94595331, 1.0606143, 1.0892795, .94595331, .97461855, .97461855, .74529654
@histw .02174849, .05490956, .08807063, .1212317, .15439276, .18755384, .2207149, .25387597, .28703704, .32019812, .35335916, .38652024, .41968131, .45284238, .48600346, .5191645, .55232561, .58548665, .61864769, .6518088, .68496984, .71813095, .75129199, .78445303, .81761414, .85077518, .88393629, .91709733, .95025837, .98341948
@type float
@label 
@class other
@N_unique .
@N 1052
 
_@NOTES
 
=====p_rad_res=====

p_rad_res:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #                 {txt}Positive       {res} 1052         1       1051
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1052         1       1051
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.01                   1                      1052
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}p_rad_res {c |}{res}      1052    .4503826    .2918835        .01          1
@mean     0.450
@sd     0.292
@min     0.010
@max     1.000
@example0 .505
@histh 1.6706994, 2.4196336, .86415488, 1.6995045, .72012907, 1.2674271, .74893421, 1.0081806, .92176521, .83534968, .92176521, 1.0081806, .97937548, .92176521, .66251874, 1.4114529, .83534968, 1.0945961, .86415488, .74893421, 1.1522064, 1.1234013, .89296001, .83534968, 1.065791, .86415488, .86415488, .66251874, .60490841, .63371354
@histw .0265, .0595, .0925, .12549999, .1585, .19149999, .2245, .25749999, .29049999, .32350001, .3565, .38949999, .42250001, .45550001, .4885, .52149999, .55449998, .58749998, .62050003, .65350002, .68650001, .71950001, .7525, .78549999, .81849998, .85149997, .88450003, .91750002, .95050001, .9835
@type float
@label 
@class other
@N_unique .
@N 1052
 
_@NOTES
 
=====p_rad_res_high=====

p_rad_res_high:                                 {txt}Number of Observations
{hline 17}                           {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #             {txt}Positive       {res} 1052         6       1046
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1052         6       1046
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.015                  1                      1052
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
p_rad_res_~h {c |}{res}      1052    .4660076    .2913827       .015          1
@mean     0.466
@sd     0.291
@min     0.015
@max     1.000
@example0 .52499998
@histh 1.3028121, 2.2582078, 1.0712011, 1.4765204, 1.0422497, .95539558, .95539558, 1.0422497, 1.0132984, .69483316, 1.1001525, .78168726, 1.1870066, .63693041, .83959007, 1.3896663, .98434693, .75273591, 1.1870066, .83959007, .92644417, 1.1291039, .92644417, .81063867, 1.2449094, .69483316, .83959007, .72378451, .72378451, .92644417
@histw .03141667, .06425, .09708333, .12991667, .16275001, .19558333, .22841667, .26124999, .29408333, .32691666, .35975, .39258334, .42541668, .45824999, .49108332, .52391666, .55675, .58958334, .62241668, .65525001, .68808335, .72091669, .75375003, .7865833, .81941664, .85224998, .88508332, .91791666, .95074999, .98358333
@type float
@label 
@class other
@N_unique .
@N 1052
 
_@NOTES
 
=====p_rad_res_low=====

p_rad_res_low:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}   13        13          -
{txt}{c |}  {res}#       #                 {txt}Positive       {res} 1039         -       1039
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1052        13       1039
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  .985                      1052
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
p_rad_res_~w {c |}{res}      1052    .4344724    .2919883          0       .985
@mean     0.434
@sd     0.292
@min     0.000
@max     0.985
@example0 .48500001
@histh 2.200305, 2.1713536, .98434693, 1.447569, .69483316, 1.215958, .83959001, 1.1580552, .86854142, .83959001, .95539558, .92644417, .92644417, .78168726, .86854142, 1.4186176, .81063867, 1.0712011, .86854142, .89749283, .92644417, 1.0712011, 1.1001525, .78168726, 1.0132983, .89749283, .78168726, .72378451, .57902759, .63693035
@histw .01641667, .04925, .08208334, .11491667, .14775001, .18058334, .21341667, .24625, .27908334, .31191668, .34475002, .37758332, .41041666, .44325, .47608334, .50891668, .54175001, .57458335, .60741669, .64025003, .67308336, .7059167, .73874998, .77158332, .80441666, .83724999, .87008333, .90291667, .93575001, .96858335
@type float
@label 
@class other
@N_unique .
@N 1052
 
_@NOTES
 
=====p_rad_unres=====

p_rad_unres:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #                 {txt}Zero           {res}   28        28          -
{txt}{c |}  {res}#   #   #   #             {txt}Positive       {res} 1024         2       1022
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1052        30       1022
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      1052
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}p_rad_unres {c |}{res}      1052    .4492467    .2806356          0          1
@mean     0.449
@sd     0.281
@min     0.000
@max     1.000
@example0 .58999997
@histh 1.9106464, 1.3117871, .8840304, .82699621, .91254753, .79847908, 1.2547529, 1.3973384, 1.3403041, .91254753, 1.1692015, .8840304, .82699621, 1.2262357, 1.2262357, 1.3403041, 1.1406844, .82699621, 1.0551331, 1.026616, .8840304, .76996195, 1.026616, .82699621, .85551333, .68441063, 1.1121674, .51330799, .48479086, .57034218
@histw .01666667, .05, .08333334, .11666667, .15000001, .18333334, .21666667, .25, .28333333, .31666666, .34999999, .38333333, .41666666, .44999999, .48333332, .51666665, .55000001, .58333331, .61666667, .64999998, .68333334, .71666664, .75, .78333336, .81666666, .85000002, .88333333, .91666669, .94999999, .98333335
@type float
@label 
@class other
@N_unique .
@N 1052
 
_@NOTES
 
=====p_webb_res=====

p_webb_res:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#       #                 {txt}Positive       {res} 1052         3       1049
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1052         3       1049
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.005                  1                      1052
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}p_webb_res {c |}{res}      1052    .4526925    .2972315       .005          1
@mean     0.453
@sd     0.297
@min     0.005
@max     1.000
@example0 .55500001
@histh 1.8342664, 2.2068517, 1.0890957, 1.1464165, 1.0317749, 1.1177561, .94579363, 1.0604353, .85981238, .77383113, .77383113, 1.0317749, .97445405, .80249155, .83115196, 1.0890957, 1.0604353, 1.0604353, .97445405, .77383113, 1.1177561, .85981238, .97445405, .83115196, .8884728, .83115196, 1.0317749, .60186863, .74517071, .83115196
@histw .02158333, .05475, .08791666, .12108333, .15425, .18741667, .22058333, .25375, .28691667, .32008332, .35325, .38641667, .41958332, .45275, .48591667, .51908332, .55225003, .58541667, .61858332, .65175003, .68491668, .71808332, .75125003, .78441668, .81758332, .85075003, .88391668, .91708332, .95025003, .98341668
@type float
@label 
@class other
@N_unique .
@N 1052
 
_@NOTES
 
{com}. 
. // noi profiler report
. // profiler off
. {c )-}
{txt}
{com}. 
. exit, clear STATA
