{smcl}
{txt}{sf}{ul off}
{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. use  "/usr/local/stata/ado/base/u/uslifeexp.dta"
{txt}(U.S. life expectancy, 1900-1999)

{com}. 
. describe, short

{txt}Contains data from {res}/usr/local/stata/ado/base/u/uslifeexp.dta
{txt}  obs:{res}           100                          U.S. life expectancy, 1900-1999
{txt} vars:{res}            10                          30 Mar 2011 04:31
{txt} size:{res}         3,800                          
{txt}Sorted by:  {res}year
{txt}
{com}. 
. local N = r(N)
{txt}
{com}. local variables = r(k)
{txt}
{com}. 
. di "@N `N'"
{res}@N 100
{txt}
{com}. di "@variables `variables'"
{res}@variables 10
{txt}
{com}. 
. datasignature
  {res}100:10(80528):3408826358:1963332528
{txt}
{com}. local datasig = "`r(datasignature)'"
{txt}
{com}. 
. di "@datasignature `datasig'"
{res}@datasignature 100:10(80528):3408826358:1963332528
{txt}
{com}. 
. cap noi xtset
{err}panel variable not set; use {bf:xtset} {it:varname} ...
{txt}
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
.     di "@panelvar `r(panelvar)'"
. {c )-}
{txt}
{com}. 
. notes _dta
{res}
_dta:
{txt}{p 2 6}
1.
National Vital Statistics Report, Vol. 50 No. 6, 21mar2000
{p_end}
{p 2 6}
2.
Source: http://www.cdc.gov/nchs/fastats/pdf/nvsr50_06tb12.pdf
{p_end}
{p 2 6}
3.
Table 12. Estimated life expectancy at birth in years, by race and sex.
{p_end}
{p 2 6}
4.
For selected years, life table values shown are estimates.
{p_end}

{com}. 
. qui {c -(}
{txt}
{com}. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====year=====

{res}year:  Year                                     {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#   #   #   #   #         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res}  100       100          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res}  100       100          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1900               1999                       100
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}year {c |}{res}       100      1949.5    29.01149       1900       1999
@mean  1949.500
@sd    29.011
@min      1900
@max      1999
@example0 1900
@histh .01010101, .01010101, .01010101, .01010101, .01010101, .01010101, .01010101, .01010101, .01010101, .01010101
@histw 1904.95, 1914.85, 1924.75, 1934.65, 1944.55, 1954.45, 1964.35, 1974.25, 1984.15, 1994.05
@type int
@label Year
@class other
@N_unique .
@N 100
 
_@NOTES
 
=====le=====

le:  life expectancy                            {txt}Number of Observations
{hline 20}                        {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}  100         5         95
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #   #         {txt}Total          {res}  100         5         95
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}39.1               76.7                       100
  (80 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 10}le {c |}{res}       100      64.829    9.158628       39.1       76.7
@mean    64.829
@sd     9.159
@min    39.100
@max    76.700
@example0 47.299999
@histh .00265957, .01861702, .02659575, .01861702, .02659575, .02393617, .02659575, .06117022, .06117022
@histw 40.98, 48.5, 52.259998, 56.019997, 59.779999, 63.539997, 67.299995, 71.059998, 74.82
@type float
@label life expectancy
@class other
@N_unique 80
@N 100
 
_@NOTES
 
=====le_male=====

le_male:  Life expectancy, males                {txt}Number of Observations
{hline 32}            {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}  100        11         89
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#       #   #         {txt}Total          {res}  100        11         89
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}36.6               73.9                       100
  (81 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}le_male {c |}{res}       100      62.302    8.436369       36.6       73.9
@mean    62.302
@sd     8.436
@min    36.600
@max    73.900
@example0 46.299999
@histh .00268097, .01608579, .02680965, .01072386, .02680965, .02949061, .03485255, .06970509, .05093833
@histw 38.465, 45.924999, 49.654999, 53.384998, 57.115002, 60.845001, 64.574997, 68.305, 72.035004
@type float
@label Life expectancy, males
@class other
@N_unique 81
@N 100
 
_@NOTES
 
=====le_female=====

le_female:  Life expectancy, females            {txt}Number of Observations
{hline 36}        {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}  100         9         91
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #   #         {txt}Total          {res}  100         9         91
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}42.2               79.5                       100
  (85 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}le_female {c |}{res}       100       67.51    9.834987       42.2       79.5
@mean    67.510
@sd     9.835
@min    42.200
@max    79.500
@example0 48.299999
@histh .00268097, .00536193, .01876676, .02949062, .01608579, .02949062, .02144772, .02144772, .0536193, .0697051
@histw 44.065002, 47.795002, 51.525002, 55.255001, 58.985001, 62.715, 66.445, 70.175003, 73.904999, 77.635002
@type float
@label Life expectancy, females
@class other
@N_unique 85
@N 100
 
_@NOTES
 
=====le_w=====

le_w:  Life expectancy, whites                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}  100        12         88
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #   #         {txt}Total          {res}  100        12         88
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}39.8               77.3                       100
  (79 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}le_w {c |}{res}       100      65.688    9.171269       39.8       77.3
@mean    65.688
@sd     9.171
@min    39.800
@max    77.300
@example0 47.599998
@histh .00266667, .02133333, .02133333, .01866666, .024, .024, .032, .05866666, .064
@histw 41.674999, 49.174999, 52.924999, 56.674999, 60.425003, 64.175003, 67.925003, 71.675003, 75.425003
@type float
@label Life expectancy, whites
@class other
@N_unique 79
@N 100
 
_@NOTES
 
=====le_wmale=====

le_wmale:  Life expectancy, white males         {txt}Number of Observations
{hline 39}     {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}  100         9         91
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#       #   #         {txt}Total          {res}  100         9         91
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}37.1               74.6                       100
  (79 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}le_wmale {c |}{res}       100      63.143    8.503954       37.1       74.6
@mean    63.143
@sd     8.504
@min    37.100
@max    74.600
@example0 46.599998
@histh .00266667, .016, .02666667, .01066667, .02133333, .03466666, .032, .072, .05066667
@histw 38.974998, 46.474998, 50.224998, 53.974998, 57.724998, 61.474998, 65.224998, 68.974998, 72.724998
@type float
@label Life expectancy, white males
@class other
@N_unique 79
@N 100
 
_@NOTES
 
=====le_wfemale=====

le_wfemale:  Life expectancy, white females     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}  100         9         91
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #   #         {txt}Total          {res}  100         9         91
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}43.2                 80                       100
  (84 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}le_wfemale {c |}{res}       100      68.434    9.797167       43.2         80
@mean    68.434
@sd     9.797
@min    43.200
@max    80.000
@example0 48.700001
@histh .00271739, .00815217, .02173913, .02445652, .01086957, .0326087, .01902174, .02445652, .05706522, .07065217
@histw 45.040001, 48.720001, 52.400002, 56.080002, 59.760002, 63.439999, 67.120003, 70.800003, 74.480003, 78.160004
@type float
@label Life expectancy, white females
@class other
@N_unique 84
@N 100
 
_@NOTES
 
=====le_b=====

le_b:  Life expectancy, blacks                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}  100         7         93
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#       #       #         {txt}Total          {res}  100         7         93
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}30.8               71.4                       100
  (82 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}le_b {c |}{res}       100      56.033    12.48937       30.8       71.4
@mean    56.033
@sd    12.489
@min    30.800
@max    71.400
@example0 33
@histh .02216749, .02216749, .00246305, .01724138, .01477832, .02463054, .01231527, .01970443, .05418719, .05665024
@histw 32.829998, 36.889999, 40.950001, 45.009998, 49.07, 53.130001, 57.190002, 61.25, 65.309998, 69.370003
@type float
@label Life expectancy, blacks
@class other
@N_unique 82
@N 100
 
_@NOTES
 
=====le_bmale=====

le_bmale:  Life expectancy, black males         {txt}Number of Observations
{hline 39}     {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}  100         9         91
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#       #   #   #         {txt}Total          {res}  100         9         91
{txt}{c |}  {res}#   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}29.1               67.8                       100
  (85 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}le_bmale {c |}{res}       100      53.589     11.4569       29.1       67.8
@mean    53.589
@sd    11.457
@min    29.100
@max    67.800
@example0 32.5
@histh .02325581, .01550387, .01033592, .00516796, .02583979, .01808785, .02067183, .02325581, .06459948, .05167958
@histw 31.035, 34.905003, 38.775002, 42.645, 46.515003, 50.385002, 54.255001, 58.125004, 61.995003, 65.865005
@type float
@label Life expectancy, black males
@class other
@N_unique 85
@N 100
 
_@NOTES
 
=====le_bfemale=====

le_bfemale:  Life expectancy, black females     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}  100         9         91
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#       #   #   #         {txt}Total          {res}  100         9         91
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}32.5               74.8                       100
  (86 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}le_bfemale {c |}{res}       100      58.567     13.5409       32.5       74.8
@mean    58.567
@sd    13.541
@min    32.500
@max    74.800
@example0 33.5
@histh .02364066, .01891253, .00472813, .0212766, .01182033, .02364066, .00945626, .02836879, .03546099, .05910165
@histw 34.615002, 38.845001, 43.075001, 47.305, 51.535, 55.765003, 59.995003, 64.225006, 68.455002, 72.685005
@type float
@label Life expectancy, black females
@class other
@N_unique 86
@N 100
 
_@NOTES
 
{txt}
{com}. 
. // noi profiler report
. // profiler off
. 
. exit, clear STATA
