{smcl}
{txt}{sf}{ul off}
{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. use  "/usr/local/stata/ado/base/p/pop2000.dta"
{txt}
{com}. 
. describe, short

{txt}Contains data from {res}/usr/local/stata/ado/base/p/pop2000.dta
{txt}  obs:{res}            17                          
{txt} vars:{res}            20                          19 Apr 2011 18:42
{txt} size:{res}         1,462                          
{txt}Sorted by:  

{com}. 
. local N = r(N)
{txt}
{com}. local variables = r(k)
{txt}
{com}. 
. di "@N `N'"
{res}@N 17
{txt}
{com}. di "@variables `variables'"
{res}@variables 20
{txt}
{com}. 
. datasignature
  {res}17:20(31425):833915977:2655854943
{txt}
{com}. local datasig = "`r(datasignature)'"
{txt}
{com}. 
. di "@datasignature `datasig'"
{res}@datasignature 17:20(31425):833915977:2655854943
{txt}
{com}. 
. cap noi xtset
{err}panel variable not set; use {bf:xtset} {it:varname} ...
{txt}
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
.     di "@panelvar `r(panelvar)'"
. {c )-}
{txt}
{com}. 
. notes _dta
{res}
_dta:
{txt}{p 2 6}
1.
Source: U.S. Census Bureau, Census 2000, PHC-T-9, Tables 1-3:
{p_end}
{p 2 6}
2.
Table 1. Total Pop. by Age, Race and Hispanic or Latino Origin
{p_end}
{p 2 6}
3.
Table 2. Male Pop. by Age, Race and Hispanic or Latino Origin
{p_end}
{p 2 6}
4.
Table 3. Female Pop. by Age, Race and Hispanic or Latino Origin
{p_end}

{com}. 
. qui {c -(}
{txt}
{com}. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====agestr=====
@freq 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1
@values "10 to 14", "15 to 19", "20 to 24", "25 to 29", "30 to 34", "35 to 39", "40 to 44", "45 to 49", "5 to 9", "50 to 54", "55 to 59", "60 to 64", "65 to 69", "70 to 74", "75 to 79", "80 to 84", "Under 5"
@example0 Under 5
@type str10
@label Age category
@class identifier
@N_unique 17
@N 17
{res} 
_@NOTES
 
=====agegrp=====

agegrp:  Age category                           {txt}Number of Observations
{hline 21}                       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#               #         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#               #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res}   17        17          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    17                        17
  (17 unique values)

      {txt}agegrp is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}agegrp {c |}{res}        17           9    5.049752          1         17
@mean     9.000
@sd     5.050
@min     1.000
@max    17.000
@example0 1
@histh .05882353, .05882353, .05882353, .07352941
@histw 3, 7, 11, 15
@type float
@label Age category
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====total=====

total:  Total                                   {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}   17        17          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#           #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   .   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}4945367        2.27e+07                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}total {c |}{res}        17    1.63e+07     5787531    4945367   2.27e+07
@mean  1.63e+07
@sd  5.79e+06
@min  4.95e+06
@max  2.27e+07
@example0 19175798
@histh 3.974e-08, 3.974e-08, 1.325e-08, 1.325e-07
@histw 7165529, 11605853, 16046178, 20486502
@type float
@label Total
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====white=====

white:  White                                   {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res}   17        17          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#       #   #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   .   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}4408597        1.73e+07                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}white {c |}{res}        17    1.22e+07     3790714    4408597   1.73e+07
@mean  1.22e+07
@sd  3.79e+06
@min  4.41e+06
@max  1.73e+07
@example0 12859892
@histh 3.660e-08, 5.490e-08, 9.150e-08, 1.281e-07
@histw 6015772, 9230122, 12444471, 15658821
@type float
@label White
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====black=====

black:  Black                                   {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#           #   #         {txt}Positive       {res}   17        17          -
{txt}{c |}  {res}#           #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #       #   #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}346465          3205512                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}black {c |}{res}        17     2020288    988574.4     346465    3205512
@mean  2.02e+06
@sd  9.89e+05
@min  3.46e+05
@max  3.21e+06
@example0 2804786
@histh 3.292e-07, 1.646e-07, 1.646e-07, 7.407e-07
@histw 703845.88, 1418607.6, 2133369.5, 2848131
@type float
@label Black
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====indian=====

indian:  Indian                                 {txt}Number of Observations
{hline 15}                             {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#   #         {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#           #   #         {txt}Positive       {res}   17        17          -
{txt}{c |}  {res}#           #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #       #   #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}14646            245677                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}indian {c |}{res}        17    144921.6    80755.11      14646     245677
@mean  1.45e+05
@sd 80755.113
@min 14646.000
@max  2.46e+05
@example0 213052
@histh 5.092e-06, 2.037e-06, 3.055e-06, 7.129e-06
@histw 43524.875, 101282.63, 159040.38, 216798.13
@type float
@label Indian
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====asian=====

asian:  Asian                                   {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#   #         {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res}   17        17          -
{txt}{c |}  {res}#   #       #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #       #   #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}88183            986222                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}asian {c |}{res}        17    598853.1    289512.5      88183     986222
@mean  5.99e+05
@sd  2.90e+05
@min 88183.000
@max  9.86e+05
@example0 670406
@histh 1.048e-06, 5.240e-07, 1.572e-06, 1.310e-06
@histw 200437.88, 424947.63, 649457.38, 873967.13
@type float
@label Asian
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====island=====

island:  Island                                 {txt}Number of Observations
{hline 15}                             {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}   17        17          -
{txt}{c |}  {res}#               #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#               #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   #   .   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2155              38693                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}island {c |}{res}        17    23353.53    13491.46       2155      38693
@mean 23353.529
@sd 13491.459
@min  2155.000
@max 38693.000
@example0 33391
@histh .0000322, .00001288, .00001288, .00005152
@histw 6722.25, 15856.75, 24991.25, 34125.75
@type float
@label Island
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====maletotal=====

maletotal:  Male Total                          {txt}Number of Observations
{hline 22}                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}   17        17          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}                  {res}#         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   .   .   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1834897        1.13e+07                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}maletotal {c |}{res}        17     8048621     3168453    1834897   1.13e+07
@mean  8.05e+06
@sd  3.17e+06
@min  1.83e+06
@max  1.13e+07
@example0 9810733
@histh 7.443e-08, 7.443e-08, 2.481e-08, 2.481e-07
@histw 3020372, 5391321.5, 7762271.5, 10133221
@type float
@label Male Total
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====malewhite=====

malewhite:  Male White                          {txt}Number of Observations
{hline 22}                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res}   17        17          -
{txt}{c |}      {res}#       #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #       #   #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1643745         8631912                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}malewhite {c |}{res}        17     6040283     2112306    1643745    8631912
@mean  6.04e+06
@sd  2.11e+06
@min  1.64e+06
@max  8.63e+06
@example0 6597764
@histh 6.734e-08, 1.010e-07, 1.347e-07, 2.694e-07
@histw 2517266, 4264307.5, 6011349.5, 7758391
@type float
@label Male White
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====maleblack=====

maleblack:  Male Black                          {txt}Number of Observations
{hline 22}                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#   #         {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#           #   #         {txt}Positive       {res}   17        17          -
{txt}{c |}  {res}#           #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #       #   #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}116030          1627475                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}maleblack {c |}{res}        17    963553.2    516744.1     116030    1627475
@mean  9.64e+05
@sd  5.17e+05
@min  1.16e+05
@max  1.63e+06
@example0 1424275
@histh 7.784e-07, 3.113e-07, 4.670e-07, 1.090e-06
@histw 304960.63, 682821.88, 1060683.1, 1438544.4
@type float
@label Male Black
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====maleindian=====

maleindian:  Male Indian                        {txt}Number of Observations
{hline 24}                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#   #         {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#           #   #         {txt}Positive       {res}   17        17          -
{txt}{c |}  {res}#           #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #       #   #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}5488             125260                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}maleindian {c |}{res}        17    72348.06    41940.87       5488     125260
@mean 72348.059
@sd 41940.875
@min  5488.000
@max  1.25e+05
@example0 108659
@histh 9.823e-06, 3.929e-06, 5.894e-06, .00001375
@histw 20459.5, 50402.5, 80345.5, 110288.5
@type float
@label Male Indian
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====maleasian=====

maleasian:  Male Asian                          {txt}Number of Observations
{hline 22}                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#   #         {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#           #   #         {txt}Positive       {res}   17        17          -
{txt}{c |}  {res}#           #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #       #   #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}36339            484136                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}maleasian {c |}{res}        17    289642.2    146272.5      36339     484136
@mean  2.90e+05
@sd  1.46e+05
@min 36339.000
@max  4.84e+05
@example0 337149
@histh 2.102e-06, 1.051e-06, 2.627e-06, 3.153e-06
@histw 92313.625, 204262.88, 316212.13, 428161.38
@type float
@label Male Asian
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====maleisland=====

maleisland:  Male Island                        {txt}Number of Observations
{hline 24}                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}   17        17          -
{txt}{c |}  {res}#               #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#               #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   #   .   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}907               20243                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}maleisland {c |}{res}        17    11878.47    7096.633        907      20243
@mean 11878.471
@sd  7096.633
@min   907.000
@max 20243.000
@example0 17254
@histh .00006084, .00002434, .00002434, .00009735
@histw 3324, 8158, 12992, 17826
@type float
@label Male Island
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====femtotal=====

femtotal:  Female Total                         {txt}Number of Observations
{hline 23}                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}   17        17          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#       #   #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   .   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3110470        1.14e+07                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}femtotal {c |}{res}        17     8256221     2627942    3110470   1.14e+07
@mean  8.26e+06
@sd  2.63e+06
@min  3.11e+06
@max  1.14e+07
@example0 9365065
@histh 1.137e-07, 5.685e-08, 5.685e-08, 2.558e-07
@histw 4145157.3, 6214532, 8283906, 10353281
@type float
@label Female Total
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====femwhite=====

femwhite:  Female White                         {txt}Number of Observations
{hline 23}                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res}   17        17          -
{txt}{c |}              {res}#                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#       #   #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2764852         8634083                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}femwhite {c |}{res}        17     6176312     1689314    2764852    8634083
@mean  6.18e+06
@sd  1.69e+06
@min  2.76e+06
@max  8.63e+06
@example0 6262128
@histh 8.018e-08, 1.604e-07, 2.405e-07, 2.004e-07
@histw 3498506, 4965813.5, 6433121.5, 7900429
@type float
@label Female White
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====femblack=====

femblack:  Female Black                         {txt}Number of Observations
{hline 23}                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}   17        17          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #           #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   .   .   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}230435          1578037                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}femblack {c |}{res}        17     1056735    474303.8     230435    1578037
@mean  1.06e+06
@sd  4.74e+05
@min  2.30e+05
@max  1.58e+06
@example0 1380511
@histh 6.984e-07, 3.492e-07, 3.492e-07, 1.571e-06
@histw 398885.25, 735785.75, 1072686.3, 1409586.8
@type float
@label Female Black
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====femindian=====

femindian:  Female Indian                       {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#   #         {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#           #   #         {txt}Positive       {res}   17        17          -
{txt}{c |}  {res}#           #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #       #   #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}9158             120417                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}femindian {c |}{res}        17    72573.59    38864.73       9158     120417
@mean 72573.588
@sd 38864.732
@min  9158.000
@max  1.20e+05
@example0 104393
@histh .00001057, 2.115e-06, 8.459e-06, .0000148
@histw 23065.375, 50880.125, 78694.875, 106509.63
@type float
@label Female Indian
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====femasian=====

femasian:  Female Asian                         {txt}Number of Observations
{hline 23}                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res}   17        17          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #       #   #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   .   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}51844            502086                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}femasian {c |}{res}        17    309210.9    144190.6      51844     502086
@mean  3.09e+05
@sd  1.44e+05
@min 51844.000
@max  5.02e+05
@example0 333257
@histh 2.090e-06, 1.045e-06, 2.613e-06, 3.136e-06
@histw 108124.25, 220684.75, 333245.25, 445805.75
@type float
@label Female Asian
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
=====femisland=====

femisland:  Female Island                       {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res}   17        17          -
{txt}{c |}  {res}#               #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#               #         {txt}Total          {res}   17        17          -
{txt}{c |}  {res}#   #   .   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1248              18450                        17
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}femisland {c |}{res}        17    11475.06    6399.442       1248      18450
@mean 11475.059
@sd  6399.442
@min  1248.000
@max 18450.000
@example0 16137
@histh .00006839, .00002736, .00002736, .00010943
@histw 3398.25, 7698.75, 11999.25, 16299.75
@type float
@label Female Island
@class identifier
@N_unique 17
@N 17
 
_@NOTES
 
{txt}
{com}. 
. // noi profiler report
. // profiler off
. 
. exit, clear STATA
