{smcl}
{txt}{sf}{ul off}
{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. use  "/usr/local/stata/ado/base/c/citytemp.dta"
{txt}(City Temperature Data)

{com}. 
. describe, short

{txt}Contains data from {res}/usr/local/stata/ado/base/c/citytemp.dta
{txt}  obs:{res}           956                          City Temperature Data
{txt} vars:{res}             6                          3 Mar 2011 19:17
{txt} size:{res}        15,296                          
{txt}Sorted by:  {res}region
{txt}
{com}. 
. local N = r(N)
{txt}
{com}. local variables = r(k)
{txt}
{com}. 
. di "@N `N'"
{res}@N 956
{txt}
{com}. di "@variables `variables'"
{res}@variables 6
{txt}
{com}. 
. datasignature
  {res}956:6(53956):3867030984:1470213064
{txt}
{com}. local datasig = "`r(datasignature)'"
{txt}
{com}. 
. di "@datasignature `datasig'"
{res}@datasignature 956:6(53956):3867030984:1470213064
{txt}
{com}. 
. cap noi xtset
{err}panel variable not set; use {bf:xtset} {it:varname} ...
{txt}
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
.     di "@panelvar `r(panelvar)'"
. {c )-}
{txt}
{com}. 
. notes _dta
{res}{txt}
{com}. 
. qui {c -(}
{txt}
{com}. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====division=====

{res}division:  Census Division                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#           #         {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#           #         {txt}Positive       {res}  956       956          -
{txt}{c |}  {res}#   #           #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res}  956       956          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     9                       956
   (9 unique values)

      {txt}division is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}division {c |}{res}       956    5.135983    2.694249          1          9
@mean     5.136
@sd     2.694
@min         1
@max         9
@values 1, 2, 3, 4, 5, 6, 7, 8, 9
@names "N. Eng.", "Mid Atl", "E.N.C.", "W.N.C.", "S. Atl.", "E.S.C.", "W.S.C.", "Mountain", "Pacific"
@freq 69, 97, 206, 78, 115, 46, 89, 61, 195
@type int
@label Census Division
@class category
@N_unique 9
@N 956
 
_@NOTES
 
=====region=====

region:  Census Region                          {txt}Number of Observations
{hline 22}                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #   #             {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #   #             {txt}Positive       {res}  956       956          -
{txt}{c |}  {res}#   #   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res}  956       956          -
{txt}{c |}  {res}#   #   #   #             {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     4                       956
   (4 unique values)

      {txt}region is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}region {c |}{res}       956    2.623431    1.057724          1          4
@mean     2.623
@sd     1.058
@min         1
@max         4
@values 1, 2, 3, 4
@names "NE", "N Cntrl", "South", "West"
@freq 166, 284, 250, 256
@type int
@label Census Region
@class category
@N_unique 4
@N 956
 
_@NOTES
 
=====heatdd=====

heatdd:  Heating degree days                    {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero           {res}    7         7          -
{txt}{c |}          {res}#                 {txt}Positive       {res}  946       946          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res}  953       953          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing        {res}    3
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 10816                       956
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}heatdd {c |}{res}       953    4425.533    2199.605          0      10816
@mean  4425.533
@sd  2199.605
@min         0
@max     10816
@example0 .
@histh .00009284, .00004502, .00002813, .00009284, .00019975, .00011816, .00014067, .00015193, .00012661, .00005908, .00007315, .0000422, .00010691, .00021945, .00015755, .00019975, .0002504, .0002504, .00011535, .0000619, .0000422, .00006752, .00001125, 5.627e-06, .00001407, 5.627e-06, 2.813e-06
@histw 186.48276, 559.4483, 932.41382, 1305.3793, 1678.3448, 2051.3103, 2424.2759, 2797.2415, 3170.2068, 3543.1724, 3916.1379, 4289.1035, 4662.0688, 5035.0347, 5408, 5780.9653, 6153.9312, 6526.8965, 6899.8623, 7272.8276, 7645.793, 8018.7588, 8391.7246, 9137.6553, 9510.6211, 9883.5859, 10629.518
@type int
@label Heating degree days
@class other
@N_unique .
@N 953
 
_@NOTES
 
=====cooldd=====

cooldd:  Cooling degree days                    {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}    1         1          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  952       952          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res}  953       953          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing        {res}    3
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  4389                       956
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}cooldd {c |}{res}       953    1240.413    937.6679          0       4389
@mean  1240.413
@sd   937.668
@min         0
@max      4389
@example0 .
@histh .00018027, .0001872, .00040906, .00059626, .00136586, .00054773, .00046453, .0005616, .00030506, .0002912, .0001664, .000208, .00013867, .00011093, .0000832, .00011787, .00006933, .00011787, .00018027, .0000416, .00004853, .00009013, .0000208, .00001387, .00006933, .00009707, .0000624, .00002773, .00003467
@histw 75.672417, 227.01724, 378.36206, 529.70691, 681.0517, 832.39655, 983.74139, 1135.0862, 1286.431, 1437.7759, 1589.1207, 1740.4656, 1891.8103, 2043.1552, 2194.5, 2345.8447, 2497.1897, 2648.5344, 2799.8794, 2951.2241, 3102.5688, 3253.9138, 3405.2585, 3556.6035, 3707.9482, 3859.2932, 4010.6379, 4161.9829, 4313.3276
@type int
@label Cooling degree days
@class other
@N_unique .
@N 953
 
_@NOTES
 
=====tempjan=====

tempjan:  Average January temperature           {txt}Number of Observations
{hline 37}       {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res}  954        78        876
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res}  954        78        876
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing        {res}    2
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2.2                72.6                       956
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}tempjan {c |}{res}       954    35.74895    14.18813        2.2       72.6
@mean    35.749
@sd    14.188
@min     2.200
@max    72.600
@example0 16.6
@histh .00129538, .00172718, .00086359, .00906768, .00474974, .00388615, .0073405, .0384297, .02633946, .03022561, .03886149, .04533841, .01683998, .00949948, .01079486, .02029433, .01252204, .02029433, .01338563, .01727177, .02245331, .02547587, .01252204, .00388615, .00345436, .00172718, .00949948, .00086359, .00302256
@histw 3.4137931, 5.8413792, 8.2689657, 10.696551, 13.124138, 15.551723, 17.979311, 20.406897, 22.834482, 25.262068, 27.689655, 30.117241, 32.544827, 34.972412, 37.399998, 39.827587, 42.255173, 44.682758, 47.110344, 49.53793, 51.965515, 54.393101, 56.82069, 59.248276, 61.675861, 64.103447, 66.531036, 68.958618, 71.386208
@type float
@label Average January temperature
@class other
@N_unique .
@N 954
 
_@NOTES
 
=====tempjuly=====

tempjuly:  Average July temperature             {txt}Number of Observations
{hline 35}         {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res}  954       103        851
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res}  954       103        851
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing        {res}    2
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}58.1               93.6                       956
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}tempjuly {c |}{res}       954    75.05377    5.495036       58.1       93.6
@mean    75.054
@sd     5.495
@min    58.100
@max    93.600
@example0 69.599998
@histh .00085629, .00256887, .00428145, .0094192, .00599404, .0094192, .01541323, .02055098, .03168276, .03168276, .0462397, .08991053, .13101248, .0830602, .03425163, .05052116, .05737148, .02397614, .03082647, .07535359, .02311985, .01455694, .00342516, .01284436, .00085629, .00428145, .00256887, .00085629
@histw 58.712067, 59.936207, 61.160343, 62.38448, 63.60862, 64.832756, 66.056892, 67.281036, 68.505173, 69.729309, 70.953445, 72.177582, 73.401726, 74.625862, 75.849998, 77.074135, 78.298271, 79.522415, 80.746552, 81.970688, 83.194824, 84.418961, 85.643105, 86.867241, 89.315514, 90.53965, 91.763794, 92.98793
@type float
@label Average July temperature
@class other
@N_unique .
@N 954
 
_@NOTES
 
{txt}
{com}. 
. // noi profiler report
. // profiler off
. 
. exit, clear STATA
