{smcl}
{txt}{sf}{ul off}
{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. use  "/usr/local/stata/ado/base/i/icd9_cop.dta"
{txt}
{com}. 
. describe, short

{txt}Contains data from {res}/usr/local/stata/ado/base/i/icd9_cop.dta
{txt}  obs:{res}         4,618                          
{txt} vars:{res}             2                          10 Oct 2012 15:26
{txt} size:{res}       133,922                          
{txt}Sorted by:  {res}__code9
{txt}
{com}. 
. local N = r(N)
{txt}
{com}. local variables = r(k)
{txt}
{com}. 
. di "@N `N'"
{res}@N 4618
{txt}
{com}. di "@variables `variables'"
{res}@variables 2
{txt}
{com}. 
. datasignature
  {res}4618:2(46248):3625253690:4043829248
{txt}
{com}. local datasig = "`r(datasignature)'"
{txt}
{com}. 
. di "@datasignature `datasig'"
{res}@datasignature 4618:2(46248):3625253690:4043829248
{txt}
{com}. 
. cap noi xtset
{err}panel variable not set; use {bf:xtset} {it:varname} ...
{txt}
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
.     di "@panelvar `r(panelvar)'"
. {c )-}
{txt}
{com}. 
. notes _dta
{res}
_dta:
{txt}{p 2 6}
1.
ICD9 Procedure Code Mapping Data for use with Stata, History
{p_end}
{p 2 6}
2.
{dup 5:{c -}} V16 {dup 50:{c -}}
{p_end}
{p 2 6}
3.
Dataset obtained 24aug1999 from http://www.hcfa.gov/stats/pufiles.htm, file http://www.hcfa.gov/stats/icd9v16.exe
{p_end}
{p 2 6}
4.
{dup 5:{c -}} V18 {dup 50:{c -}}
{p_end}
{p 2 6}
5.
Dataset obtained 10may2001 from http://www.hcfa.gov/stats/pufiles.htm, file http://www.hcfa.gov/stats/icd9v18.zip, file V18SURG.TXT
{p_end}
{p 2 6}
6.
11jun2001: V18 data put into Stata distribution
{p_end}
{p 2 6}
7.
BETWEEN V16 and V18: 9 codes added: 3971 3979 4107 4108 4109 4697 6096 6097 9975
{p_end}
{p 2 6}
8.
BETWEEN V16 and V18: 0 codes deleted.
{p_end}
{p 2 6}
9.
BETWEEN V16 and V18: 5 codes had discription changes: 4101 [aut bone marrow trnsplnt] [auto bone mt w/o purg], 4104 [aut hem stem cell trans] [auto hem stem ct w/o pur], 4105 [allo hem stem cell trans] [allo hem stem ct w/o pur], 8659 [skin suture nec] [skin closure nec], 8667 [dermal rener graft] [dermal regener graft]
{p_end}
{p 1 6}
10.
----- V19 --------------------------------------------------
{p_end}
{p 1 6}
11.
Dataset obtained 3jan2002 from http://www.hcfa.gov/stats/pufiles.htm, file http://www.hcfa.gov/stats/icd9v19.zip, file 9v19proc.txt
{p_end}
{p 1 6}
12.
27feb2002: V19 put into Stata distribution
{p_end}
{p 1 6}
13.
BETWEEN V18 and V19: 16 codes were added: 3728 4432 6751 6759 7538 8130 8131 8132 8133 8134 8135 8136 8137 8138 8139 9744
{p_end}
{p 1 6}
14.
BETWEEN V18 and V19: 1 code deleted but left in this dataset: 8109
{p_end}
{p 1 6}
15.
BETWEEN V18 and V19: 2 codes had description changes: 675 [int cervical os repair] [int cervical os repair*], 7534 [fetal monitoring nos] [other fetal monitoring]
{p_end}
{p 1 6}
16.
----- Note -------------------------------------------------
{p_end}
{p 1 6}
17.
The website http://www.hcfa.gov/ mentioned in the items above is no longer available. It has been replaced by http://www.cms.hhs.gov/
{p_end}
{p 1 6}
18.
----- V21 --------------------------------------------------
{p_end}
{p 1 6}
19.
Dataset obtained 8apr2004 from http://www.cms.hhs.gov/providers/pufdownload/, file http://www.cms.hhs.gov/providers/hipps/icd9_v21.zip, file v21icd9_surg.txt
{p_end}
{p 1 6}
20.
14apr2004: V21 put into Stata distribution
{p_end}
{p 1 6}
21.
BETWEEN V19 and V21: 36 codes were added: 0001 0002 0003 0009 0010 0011 0012 0013 0014 0015 0050 0051 0052 0053 0054 0055 3607 3751 3752 3753 3754 3972 4975 4976 6831 6839 8161 8162 8163 8164 8451 8452 8896 8960 9976 9977
{p_end}
{p 1 6}
22.
BETWEEN V19 and V21: 718 two and three digit codes with descriptions ending in '*' were deleted but left in this dataset: 01 010 011 012 013 ... 999
{p_end}
{p 1 6}
23.
BETWEEN V19 and V21: 2 other codes deleted but left in this dataset: 375 683
{p_end}
{p 1 6}
24.
BETWEEN V19 and V21: 7 codes had description changes: 0241 [irrigate ventricle shunt] [irrigate/expl vent shunt], 3606 [insert of cor art stent] [ins nondrug elut cor st], 3733 [exc/dest oth hrt lesion] [exc/dest hrt lesion open], 3734 [cath ablation les heart] [exc/dest hrt les other], 3979 [oth endo grft rep aneury] [endo repair other vessel], 3990 [ins non-coro art stent] [ins nondrug noncor stent], 9999 [non-op procedure nec] [miscellaneous proc nec]
{p_end}
{p 1 6}
25.
----- V22 --------------------------------------------------
{p_end}
{p 1 6}
26.
Dataset obtained 27jun2005 from http://www.cms.hhs.gov/providers/pufdownload/, file http://www.cms.hhs.gov/providers/hipps/V22_icd9.zip, file V22ICD9_FILE2.TXT
{p_end}
{p 1 6}
27.
05jul2005: V22 put into Stata distribution
{p_end}
{p 1 6}
28.
BETWEEN V21 and V22: 54 codes were added: 0016 0017 0021 0022 0023 0024 0025 0028 0029 0031 0032 0033 0034 0035 0039 0061 0062 0063 0064 0065 0091 0092 0093 2764 3768 3790 4438 4467 4468 4495 4496 4497 4498 8165 8166 8453 8454 8455 8459 8460 8461 8462 8463 8464 8465 8466 8467 8468 8469 8694 8695 8696 8949 9978
{p_end}
{p 1 6}
29.
BETWEEN V21 and V22: 0 codes deleted.
{p_end}
{p 1 6}
30.
BETWEEN V21 and V22: 14 codes had description changes: 0055 [ins drug-elut non-cor st] [ins d-e peripheral stent], 0122 [remov intracran stimulat] [removal brain stim lead], 0293 [implant brain stimulator] [imp/repl brain stim lead], 0393 [insert spinal stimulator] [imp/repl spine stim lead], 0394 [remove spinal stimulator] [removal spine stim lead], 0492 [implant periph stimulat] [imp/repl peri stim lead], 0493 [remove periph stimulator] [removal peri stim lead], 3762 [implant hrt asst sys nec] [ins non-impl hrt assist], 3763 [replace hrt assist syst] [repair heart assist sys], 3765 [imp ext pul hrt asst sys] [imp ext hrt assist syst], 3766 [imp imp pul hrt asst sys] [implantable hrt assist], 3950 [angio/ath non-coro ves] [angio oth non-coronary], 3990 [ins nondrug noncor stent] [ins non-d-e perphrl sten], 8605 [skin incis & fb removal] [removal fb/dev from skin]
{p_end}
{p 1 6}
31.
----- V24 --------------------------------------------------
{p_end}
{p 1 6}
32.
Dataset obtained from <http://www.cms.hhs.gov/ICD9ProviderDiagnosticCodes/06_codes.asp>, by selecting the 'Version 24...' file. Can be gotten directly via <http://www.cms.hhs.gov/ICD9ProviderDiagnosticCodes/Downloads/v24_icd9.zip>. After unzipping, file name is I9surgery.txt
{p_end}
{p 1 6}
33.
Note that the site has changed once again...
{p_end}
{p 1 6}
34.
07mar2007: V24 put into Stata distribution
{p_end}
{p 1 6}
35.
BETWEEN V22 and V24: 73 codes were added: 0018 0040 0041 0042 0043 0044 0045 0046 0047 0048 0056 0057 0066 0070 0071 0072 0073 0074 0075 0076 0077 0080 0081 0082 0083 0084 0085 0086 0087 0126 0127 0128 1390 1391 3223 3224 3225 3226 3371 3378 3379 3555 3633 3634 3720 3741 3749 3973 3974 5023 5024 5025 5026 5532 5533 5534 5535 6841 6849 6861 6869 6871 6879 8118 8456 8457 8458 8471 8472 8473 8697 8698 9220
{p_end}
{p 1 6}
36.
BETWEEN V22 and V24: 9 codes were deleted, but were left in this dataset: 139 3601 3602 3605 374 684 686 687 8161.
{p_end}
{p 1 6}
37.
BETWEEN V22 and V24: 7 codes had description changes: 3553 [prost repair ventric def] [pros rep ventric def-opn], 3726 [cardiac electrophy stim] [cath base invasv ep test], 3779 [revis or relocate pocket] [rev/reloc card dev pockt], 6839 [oth subtot abd hysterect] [subtotl abd hyst nec/nos], 6859 [other vag hysterectomy] [vag hysterectomy nec/nos], 8153 [revise hip replacement] [revise hip replacemt nos], 8155 [revise knee replacement] [revise knee replace nos]
{p_end}
{p 1 6}
38.
----- V25 --------------------------------------------------
{p_end}
{p 1 6}
39.
Dataset obtained 01oct2007 from <http://www.cms.hhs.gov/ICD9ProviderDiagnosticCodes/06_codes.asp>, by selecting the 'Version 25...' file. Can be gotten directly via <http://www.cms.hhs.gov/ICD9ProviderDiagnosticCodes/Downloads/v25_icd9.zip>. After unzipping, file name is I9proceduresV25.txt
{p_end}
{p 1 6}
40.
15oct2007: V25 put into Stata distribution
{p_end}
{p 1 6}
41.
BETWEEN V24 and V25: 39 codes were added: 0019 0094 0110 0116 0117 0783 0784 0795 0798 3220 3230 3239 3241 3249 3250 3259 3320 3406 3420 3452 5013 5014 7053 7054 7055 7063 7064 7078 7093 7094 7095 8480 8481 8482 8483 8484 8485 8859 9241
{p_end}
{p 1 6}
42.
BETWEEN V24 and V25: 4 codes were deleted, but were left in this dataset: 323 324 325 8458.
{p_end}
{p 1 6}
43.
BETWEEN V24 and V25: 14 codes had description changes: 0074 [hip repl surf-metal/poly] [hip surface, metal/poly], 0075 [hip rep surf-metal/metal] [hip surface, metal/metal], 0076 [hip rep surf-cermc/cermc] [hip surface, cermc/cermc], 0077 [hip repl surf-cermc/poly] [hip surface, cermc/poly], 0781 [part excision of thymus] [oth part excision thymus], 0782 [total excision of thymus] [oth totl excision thymus], 0792 [incision of thymus] [other incision of thymus], 0799 [thymus operation nec] [other thymus ops nos], 3424 [pleural biopsy] [pleural biopsy nec], 398 [vascular body operations] [cartd body/sinus/vasc op], 5341 [umbil hernia repair-grft] [umbil hern rep-grft/pros], 5361 [incis hernia repair-grft] [incis hern rep-grft/pros], 5369 [abd hern repair-grft nec] [abd hrn rep-grf/pros nec], 9914 [inject gamma globulin] [inj/infus gamma globulin]
{p_end}
{p 1 6}
44.
----- V26 --------------------------------------------------
{p_end}
{p 1 6}
45.
Dataset obtained 01oct2008 from <http://www.cms.hhs.gov/ICD9ProviderDiagnosticCodes/06_codes.asp>, by selecting the 'Version 26...' file. Can be gotten directly via <http://www.cms.hhs.gov/ICD9ProviderDiagnosticCodes/Downloads/v26_icd9.zip>. After unzipping, file name is "V26{space 2}I-9 Procedures.txt"
{p_end}
{p 1 6}
46.
15oct2008: V26 put into Stata distribution
{p_end}
{p 1 6}
47.
BETWEEN V25 and V26: 60 codes were added: 0049 0058 0059 0067 0068 0069 1711 1712 1713 1721 1722 1723 1724 1731 1732 1733 1734 1735 1736 1739 1741 1742 1743 1744 1745 1749 3372 3736 3755 3760 3823 4581 4582 4583 4840 4842 4843 4850 4851 4852 4859 5342 5343 5362 5363 5371 5372 5375 5383 5384 8053 8054 8570 8571 8572 8573 8574 8575 8576 8579
{p_end}
{p 1 6}
48.
BETWEEN V25 and V26: 4 codes were deleted, but were left in this dataset: 458 485 537 857.
{p_end}
{p 1 6}
49.
BETWEEN V25 and V26: 33 codes had description changes: 3752 [implant tot rep hrt sys] [imp tot int bi ht rp sys], 3753 [repl/rep thorac unit hrt] [repl/rep thr unt tot hrt], 3762 [ins non-impl hrt assist] [insrt non-impl circ dev], 3764 [remove heart assist sys] [remve ext hrt assist sys], 3765 [imp ext hrt assist syst] [imp vent ext hrt ast sys], 4571 [mult seg lg bowel excis] [opn mul seg lg intes nec], 4572 [cecectomy] [open cecectomy nec], 4573 [right hemicolectomy] [opn rt hemicolectomy nec], 4574 [transverse colon resect] [opn transv colon res nec], 4575 [left hemicolectomy] [opn lft hemicolectmy nec], 4576 [sigmoidectomy] [open sigmoidectomy nec], 4579 [part lg bowel excis nec] [prt lg intes exc nec/nos], 5301 [repair direct ing hernia] [opn rep dir ing hern nec], 5302 [repair indir ing hernia] [opn rep ind ing hern nec], 5303 [dir ing hernia rep-graft] [opn dir ing hern-gft nec], 5304 [ind ing hernia rep-graft] [opn ind ing hern-gft nec], 5311 [bilat dir ing hern rep] [opn bil dir ing hern nec], 5312 [bilat ind ing hern rep] [opn bil ind ing hern nec], 5313 [bil dir/ind ing hrn rep] [opn bi dr/in ing hrn nec], 5314 [bil dir ing hrn rep-grft] [opn bi dr ing hrn-gr nec], 5315 [bil ind ing hrn rep-grft] [op bi in ing hrn-grf nec], 5316 [bil dir/ind ing hern-pro] [op bi dr/in ig hr-gr nec], 5341 [umbil hern rep-grft/pros] [opn rep umb hrn-grft nec], 5349 [umbil hernia repair nec] [open rep umbil hern nec], 5361 [incis hern rep-grft/pros] [open incis hern-grft nec], 5369 [abd hrn rep-grf/pros nec] [opn hern ant abd-grf nec], 8165 [vertebroplasty] [percutan vertebroplasty], 8166 [kyphoplasty] [percut vertebral augment], 8456 [insertion cement spacer] [ins or rep cement spacer], 9390 [cont pos airway pressure] [non-invasive mech vent], 9670 [cont mech vent-unspc dur] [con inv mec ven-unsp dur], 9671 [cont mech vent < 96 hrs] [cont inv mec ven <96 hrs], 9672 [cont mech vent 96+ hrs] [cont inv mec ven 96+ hrs]
{p_end}
{p 1 6}
50.
----- V27 --------------------------------------------------
{p_end}
{p 1 6}
51.
Dataset obtained 07oct2009 from <http://www.cms.hhs.gov/ICD9ProviderDiagnosticCodes/06_codes.asp>, by selecting the 'Version 27...' file. Can be gotten directly via <http://www.cms.hhs.gov/ICD9ProviderDiagnosticCodes/Downloads/v27_icd9.zip>. After unzipping, file name is "CMS27_DESC_SHORT_SG.txt"
{p_end}
{p 1 6}
52.
21oct2009: V27 put into Stata distribution
{p_end}
{p 1 6}
53.
BETWEEN V26 and V27: 14 codes were added: 1751 1752 1761 1762 1763 1769 1770 3373 3824 3825 3975 3976 4686 4687
{p_end}
{p 1 6}
54.
BETWEEN V26 and V27: 4 codes were deleted, but were left in this dataset: 458 485 537 857.
{p_end}
{p 1 6}
55.
BETWEEN V26 and V27: 14 codes had description changes: 3371 [endo insrt/repl bron val] [endo ins/re bron val,one], 3972 [endovasc repair head ves] [endovasc embol head ves], 3979 [endo repair other vessel] [oth endo proc oth vessel], 3990 [ins non-d-e perphrl sten] [ins non-d-e non-cor stnt], 8000 [arthrot & pros remov nos] [arth/pros rem wo rep nos], 8001 [arthrot/pros remov-shldr] [arth/pros rem wo re-shld], 8002 [arthrot/pros remov-elbow] [arth/pros rem wo rep-elb], 8003 [arthrot/pros remov-wrist] [arth/pros rem wo re-wrst], 8004 [arthrot/pros remov-hand] [arth/pros rem wo rep-hnd], 8005 [arthrot/pros remov-hip] [arth/pros rem wo rep-hip], 8006 [arthrot/pros remov-knee] [arth/pros rem wo re-knee], 8007 [arthrot/pros remov-ankle] [arth/pros rem wo rep-ank], 8008 [arthrot/pros remov-foot] [arth/pros rem wo re-foot], 8009 [arthrot & pros remov nec] [arth/pros rem wo rep nec]
{p_end}
{p 1 6}
56.
----- V28 --------------------------------------------------
{p_end}
{p 1 6}
57.
Dataset obtained 15jul2010 from <http://www.cms.hhs.gov/ICD9ProviderDiagnosticCodes/06_codes.asp>, by selecting the 'Version 28...' file. Can be gotten directly via <http://www.cms.gov/ICD9ProviderDiagnosticCodes/Downloads/cmsv28_master_descriptions.zip>. After unzipping, the useful file name is "CMS28_DESC_SHORT_SG.txt (there are other files we did not use)."
{p_end}
{p 1 6}
58.
30sep2010: V28 put into Stata distribution
{p_end}
{p 1 6}
59.
BETWEEN V27 and V28: 22 codes were added: 0060 0120 0129 1771 3227 3597 3737 3897 3981 3982 3983 3984 3985 3986 3987 3988 3989 8188 8494 8555 8687 8690
{p_end}
{p 1 6}
60.
BETWEEN V27 and V28: 1 code was deleted, but was left in this dataset: 398.
{p_end}
{p 1 6}
61.
BETWEEN V27 and V28: 22 codes had description changes: 0055 [ins d-e peripheral stent] [ins d-e stent oth periph], 3596 [perc heart valvuloplasty] [perc balloon valvuplasty], 3734 [exc/dest hrt les other] [exc/des hrt les,endovasc], 8102 [other cervical fus ant] [oth cerv fusion ant/ant], 8103 [other cervical fus post] [ot cerv fusion post/post], 8104 [dorsal/dorsolum fus ant] [drsl/drslumb fus ant/ant], 8105 [dorsal/dorsolum fus post] [drsl/dslmb fus post/post], 8106 [lumbar/lumbosac fus ant] [lumb/lmbosac fus ant/ant], 8107 [lumbar/lumbosac fus lat] [lmb/lmbsac fus post/post], 8108 [lumbar/lumbosac fus post] [lumb/lmbsac fus ant/post], 8132 [refusion of oth cerv ant] [refus oth cervcl ant/ant], 8133 [refus of oth cerv post] [refus oth cerv post/post], 8134 [refusion of dorsal ant] [refus drs/drslmb ant/ant], 8135 [refusion of dorsal post] [refus drs/drslmb pst/pst], 8136 [refusion of lumbar ant] [refus lmb/lmbsac ant/ant], 8137 [refusion of lumbar lat] [refus lmb/lmbsac pst/pst], 8138 [refusion of lumbar post] [refus lmb/lmbsc ant/post], 8180 [total shoulder replace] [oth totl shouldr replace], 8321 [soft tissue biopsy] [open biopsy soft tissue], 8611 [skin & subq biopsy] [closed bx skin/subq tiss], 8859 [intra-op fluor vasc angi] [intraop cor flr vas angi], 9914 [inj/infus gamma globulin] [injct/inf immunoglobulin]
{p_end}
{p 1 6}
62.
----- V29 --------------------------------------------------
{p_end}
{p 1 6}
63.
Dataset obtained 25aug2011 from <http://www.cms.hhs.gov/ICD9ProviderDiagnosticCodes/06_codes.asp>, by selecting the 'Version 29...' file. Can be gotten directly via <http://www.cms.gov/ICD9ProviderDiagnosticCodes/Downloads/cmsv29_master_descriptions.zip>. After unzipping, the useful file name is "CMS29_DESC_SHORT_SG.txt (there are other files we did not use)."
{p_end}
{p 1 6}
64.
13oct2011: V29 put into Stata distribution
{p_end}
{p 1 6}
65.
BETWEEN V28 and V29: 19 codes were added: 0221 0222 1267 1753 1754 1755 1756 1781 3505 3506 3507 3508 3509 3826 3977 3978 4382 6824 6825
{p_end}
{p 1 6}
66.
BETWEEN V28 and V29: 1 code was deleted, but was left in this dataset: 022.
{p_end}
{p 1 6}
67.
BETWEEN V28 and V29: 20 codes had description changes: 0056 [ins/rep impl sensor lead] [ins/rep sens-crd/vsl mtr], 0061 [perc angio precereb vess] [perc angio extracran ves], 0064 [perc ins precereb stent] [perc ins extracran stent], 0066 [ptca or coronary ather] [ptca], 0239 [other ventricular shunt] [vent shunt extracran nec], 3520 [replace heart valve nos] [opn/oth rep hrt vlv nos], 3521 [replace aort valv-tissue] [opn/oth rep aort vlv-tis], 3522 [replace aortic valve nec] [opn/oth rep aortic valve], 3523 [replace mitr valv-tissue] [opn/oth rep mtrl vlv-tis], 3524 [replace mitral valve nec] [opn/oth rep mitral valve], 3525 [replace pulm valv-tissue] [opn/oth rep pulm vlv-tis], 3526 [replace pulmon valve nec] [opn/oth repl pul valve], 3527 [replace tric valv-tissue] [opn/oth rep tcspd vlv-ts], 3528 [replace tricusp valv nec] [opn/oth repl tcspd valve], 3736 [exc left atrial appendag] [exc,destrct,exclus laa], 3971 [endo impl grft abd aorta] [endo imp oth grf abd aor], 3972 [endovasc embol head ves] [endovasc embol hd/nk ves], 4389 [partial gastrectomy nec] [opn/oth part gastrectomy], 8695 [ins/repl dual pulse gen] [ins/re pls gn no rechrg], 8698 [ins/rep 2 pul gen,rechrg] [ins/rep mul pul gn,rechg]
{p_end}
{p 1 6}
68.
----- V30 --------------------------------------------------
{p_end}
{p 1 6}
69.
Dataset obtained 10oct2012 from <http://www.cms.gov/Medicare/Coding/ICD9ProviderDiagnosticCodes/codes.html>, by selecting the 'Version 30...' file. Can be gotten directly via <http://www.cms.gov/Medicare/Coding/ICD9ProviderDiagnosticCodes/Downloads/cmsv30_master_descriptions.zip>. After unzipping, the useful file name is "CMS30_DESC_SHORT_SG.txt (there are other files we did not use)."
{p_end}
{p 1 6}
70.
22oct2012: V30 put into Stata distribution
{p_end}
{p 1 6}
71.
BETWEEN V29 and V30: 1 code was added: 0095
{p_end}
{p 1 6}
72.
BETWEEN V29 and V30: 0 codes were deleted.
{p_end}
{p 1 6}
73.
BETWEEN V29 and V30: There were no description changes.
{p_end}

{com}. 
. qui {c -(}
{txt}
{com}. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====__code9=====
@example0 0001
@type str4
@label 
@class identifier
@N_unique 4618
@N 4618
{res} 
_@NOTES
 
=====__desc9=====
@example0 ther ult head & neck ves
@type str25
@label 
@class string
@N_unique 4610
@N 4618
 
_@NOTES
 
{txt}
{com}. 
. // noi profiler report
. // profiler off
. 
. exit, clear STATA
