{smcl}
{txt}{sf}{ul off}

{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. cap noi {c -(}
. 
. use  "/Users/mas/Dropbox/Stata_conference_2015/itsp/litgov_est.dta"
. 
. describe, short

{txt}Contains data from {res}/Users/mas/Dropbox/Stata_conference_2015/itsp/litgov_est.dta
{txt}  obs:{res}         2,897                          
{txt} vars:{res}           217                          6 Nov 2007 20:31
{txt} size:{res}     3,795,070                          
{txt}Sorted by:  {res}case_code  year
{com}. 
. local N = r(N)
. local variables = r(k)
. 
. di "@N `N'"
{res}@N 2897
{com}. di "@variables `variables'"
{res}@variables 217
{com}. 
. datasignature
  {res}2897:217(78832):3145795915:1252660531
{com}. local datasig = "`r(datasignature)'"
. 
. di "@datasignature `datasig'"
{res}@datasignature 2897:217(78832):3145795915:1252660531
{com}. 
. cap noi xtset
{res}{txt}{col 8}panel variable:  {res}dir_co_id (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}yr, 0 to 0
{txt}{col 17}delta:  {res}1 unit
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
{res}@timevar yr
{com}.     di "@panelvar `r(panelvar)'"
{res}@panelvar dir_co_id
{com}. {c )-}
. 
. notes _dta
{res}{com}. 
. qui {c -(}
. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====action_type=====
@freq 2897
@values "PRI"
@example0 PRI
@type str4
@label 
@class constant
@N_unique 1
@N 2897
{res} 
_@NOTES
 
=====mtgdate=====
@example0 5/5/98
@type str8
@label 
@class string
@N_unique 209
@N 2897
 
_@NOTES
 
=====id=====

id:                                             {txt}Number of Observations
{hline 5}                                       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2897      2897          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2               1015340                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 10}id {c |}{res}      2897     14812.1    76569.16          2    1015340
@mean 14812.101
@sd 76569.159
@min         2
@max   1015340
@example0 8815
@histh .00003108, 2.890e-07, 1.838e-06, 9.247e-08, 1.849e-07
@histw 14933.441, 44796.324, 74659.203, 104522.09, 1000408.6
@type long
@label 
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====comnam=====
@example0 BOSTON SCIENTIFIC
@type str48
@label 
@class string
@N_unique 296
@N 2897
 
_@NOTES
 
=====ticker=====
@example0 BSX
@type str5
@label 
@class string
@N_unique 295
@N 2897
 
_@NOTES
 
=====case_code=====
@example0 BSX__01
@type str7
@label 
@class string
@N_unique 299
@N 2897
 
_@NOTES
 
=====year=====

year:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2897      2897          -
{txt}{c |}          {res}#       #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1996               2002                      2897
   (7 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}year {c |}{res}      2897    1999.518    1.828759       1996       2002
@mean  1999.518
@sd     1.829
@min  1996.000
@max  2002.000
@values 1996, 1997, 1998, 1999, 2000, 2001, 2002
@names "1996", "1997", "1998", "1999", "2000", "2001", "2002"
@freq 163, 340, 358, 576, 447, 457, 556
@type float
@label 
@class category
@N_unique 7
@N 2897
 
_@NOTES
 
=====beginningofclassperiod=====
@example0 1/1/1997
@type str10
@label Beginning of Class Period
@class string
@N_unique 256
@N 2897
 
_@NOTES
 
=====endofclassperiod=====
@example0 11/3/1998
@type str10
@label End of Class Period
@class string
@N_unique 268
@N 2897
 
_@NOTES
 
=====filingdate=====
@example0 11/4/1998
@type str10
@label Filing date
@class string
@N_unique 268
@N 2897
 
_@NOTES
 
=====filingwinoneyear=====
@freq 15, 2882
@values "No", "Yes"
@type str3
@label Filing w/in one year
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====restatement=====
@freq 2274, 623
@values "N", "Y"
@type str1
@label Restatement
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====gaapviolation=====
@freq 1616, 1281
@values "N", "Y"
@type str1
@label GAAP Violation
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====false_forecast=====
@freq 2155, 742
@values "N", "Y"
@type str1
@label False_Forecast
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====failure_to_disclose=====
@freq 1502, 1395
@values "N", "Y"
@type str1
@label Failure_to_Disclose
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====other=====
@freq 2479, 418
@values "N", "Y"
@type str1
@label Other
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====primary_source=====
@freq 2137, 666, 94
@values "COM", "ISS", "SET"
@type str3
@label Primary_Source
@class category
@N_unique 3
@N 2897
 
_@NOTES
 
=====drop_code=====
@example0 
@type str33
@label Drop_Code
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====status=====
@freq 331, 1100, 1466
@values "ACTIVE", "DISMISSED", "SETTLED"
@type str19
@label Status
@class category
@N_unique 3
@N 2897
 
_@NOTES
 
=====status_date=====
@freq 710, 684, 330, 44, 246, 234, 16, 633
@values "7/29/05", "7/30/05", "7/31/05", "8/18/05", "8/20/05", "8/21/05", "8/23/05", "8/3/06"
@type str7
@label Status_Date
@class category
@N_unique 8
@N 2897
 
_@NOTES
 
=====ssettle=====
@example0 
@type str13
@label Settlement_Amounts
@class string
@N_unique 123
@N 1466
 
_@NOTES
 
=====settlement_amounts=====

settlement_amounts:  Settlement_Amounts         {txt}Number of Observations
{hline 39}     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1466      1426         40
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1466      1426         40
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res} 1431
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}500000         6.16e+09                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
settlement~s {c |}{res}      1466    1.79e+08    7.06e+08     500000   6.16e+09
@mean  1.79e+08
@sd  7.06e+08
@min  5.00e+05
@max  6.16e+09
@example0 .
@histh 4.411e-09, 2.611e-10, 1.958e-10, 3.092e-11, 5.153e-11, 3.779e-11, 4.809e-11
@histw 99783816, 2.984e+08, 4.969e+08, 8.941e+08, 2.681e+09, 3.277e+09, 6.057e+09
@type double
@label Settlement_Amounts
@class other
@N_unique .
@N 1466
 
_@NOTES
 
=====notes=====
@freq 23, 8, 15, 12
@values "COMBINES SIMILAR ACTIONS", "SEE AQUILA", "SEE KNIGHT TRADING GROUP", "SEE WASTE MANAGEMENT I"
@type str38
@label Notes
@class category
@N_unique 4
@N 58
 
_@NOTES
 
=====meeting_d=====

meeting_d:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2897
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2897
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}meeting_d {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type float
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====begcp_d=====

begcp_d:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 2897      2897          -
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}11752             15538                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}begcp_d {c |}{res}      2897    14252.22    683.1754      11752      15538
@mean 14252.219
@sd   683.175
@min 11752.000
@max 15538.000
@example0 13515
@histh .0000248, .0000372, .0001023, .0000496, .0000837, .0001333, .0001426, .00018289, .000124, .0001798, .0001705, .00070988, .0001488, .00050839, .00037199, .00040919, .00044329, .00035029, .00073468, .00065718, .00074088, .00045259, .00041539, .00023869, .00089278, .00019839, .0001147, .00018599, .0001767
@histw 11807.677, 12364.441, 12475.794, 12698.5, 12809.853, 12921.206, 13032.559, 13143.912, 13255.265, 13366.617, 13477.971, 13589.323, 13700.677, 13812.029, 13923.383, 14034.735, 14146.088, 14257.441, 14368.794, 14480.147, 14591.5, 14702.853, 14814.206, 14925.559, 15036.912, 15148.265, 15259.617, 15370.971, 15482.323
@type float
@label 
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====endcp_d=====

endcp_d:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #   #         {txt}Positive       {res} 2897      2897          -
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #   #         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}12548             16118                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}endcp_d {c |}{res}      2897    14715.38    685.5191      12548      16118
@mean 14715.381
@sd   685.519
@min 12548.000
@max 16118.000
@example0 14186
@histh .00003945, .0000263, .00003287, .00003616, .00006246, .0001315, .00008876, .00020711, .00011506, .00028272, .00037806, .00022684, .00044381, .00040107, .00035176, .00032546, .00064763, .00050298, .00035176, .00056216, .00039778, .00047997, .00042737, .00039778, .00032546, .00056873, .00114075, .00048983, .00003287, .00001315, .00003616
@histw 12600.5, 12915.5, 13020.5, 13125.5, 13230.5, 13335.5, 13440.5, 13545.5, 13650.5, 13755.5, 13860.5, 13965.5, 14070.5, 14175.5, 14280.5, 14385.5, 14490.5, 14595.5, 14700.5, 14805.5, 14910.5, 15015.5, 15120.5, 15225.5, 15330.5, 15435.5, 15540.5, 15645.5, 15750.5, 15855.5, 16065.5
@type float
@label 
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====filing_d=====

filing_d:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#       #         {txt}Positive       {res} 2897      2897          -
{txt}{c |}      {res}#   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #   #         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}13185             15694                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}filing_d {c |}{res}      2897    14753.52    643.4009      13185      15694
@mean 14753.517
@sd   643.401
@min 13185.000
@max 15694.000
@example0 14187
@histh .00003274, .00003742, .00014969, .00002339, .0001684, .00030405, .00019178, .00018711, .00050051, .00036954, .0003134, .00017307, .00026195, .00042567, .00034615, .00049116, .00039292, .00023856, .00085134, .00052858, .00072036, .00025727, .0004818, .000566, .00014033, .00051922, .00029469, .00045373, .00050519, .00051922, .00057068, .00110861, .00081859, .0006081
@histw 13221.897, 13295.691, 13369.485, 13443.279, 13517.073, 13590.867, 13664.662, 13738.456, 13812.25, 13886.044, 13959.838, 14033.633, 14107.427, 14181.221, 14255.015, 14328.809, 14402.603, 14476.397, 14550.191, 14623.985, 14697.779, 14771.573, 14845.367, 14919.162, 14992.956, 15066.75, 15140.544, 15214.338, 15288.133, 15361.927, 15435.721, 15509.515, 15583.309, 15657.103
@type float
@label 
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====status_d=====

status_d:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2897
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2897
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}status_d {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type float
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====casenr=====

casenr:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res} 2897      2897          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                   373                      2897
(More than 99 unique values)

      {txt}casenr is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}casenr {c |}{res}      2897    184.9534    108.0456          1        373
@mean   184.953
@sd   108.046
@min         1
@max       373
@example0 59
@histh .00217689, .0035335, .00277632, .0018614, .00287097, .00280787, .00283942, .0035335, .00290252, .0035335, .00321801, .00205069, .00138816, .00369125, .0019245, .00227154, .00208224, .00271323, .00340731, .00324956, .00236619, .00249238, .00290252, .00321801, .00271323, .00233464, .00246083, .00233464, .00211379, .00233464, .00220844, .00321801, .00252393, .00334421
@histw 6.4705882, 17.411764, 28.352942, 39.294117, 50.235294, 61.176472, 72.117645, 83.058823, 94, 104.94118, 115.88235, 126.82353, 137.76471, 148.70589, 159.64706, 170.58824, 181.52942, 192.47058, 203.41176, 214.35294, 225.29411, 236.23529, 247.17647, 258.11765, 269.05884, 280, 290.94116, 301.88235, 312.82352, 323.76471, 334.70587, 345.64706, 356.58823, 367.52942
@type long
@label 
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====status_orig=====
@freq 331, 1100, 1395, 51, 20
@values "ACTIVE", "DISMISSED", "SETTLED", "SETTLED (PARTIAL)", "SETTLED (TENTATIVE)"
@type str19
@label 
@class category
@N_unique 5
@N 2897
 
_@NOTES
 
=====hard_evidence=====

hard_evidence:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero           {res} 1553      1553          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1344      1344          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

      {txt}hard_evidence is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
hard_evide~e {c |}{res}      2897    .4639282    .4987832          0          1
@mean     0.464
@sd     0.499
@min     0.000
@max     1.000
@values 0, 1
@names "N", "Y"
@freq 1553, 1344
@type float
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====settled=====

settled:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero           {res} 1431      1431          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1466      1466          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

      {txt}settled is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}settled {c |}{res}      2897    .5060407    .5000498          0          1
@mean     0.506
@sd     0.500
@min     0.000
@max     1.000
@values 0, 1
@names "N", "Y"
@freq 1431, 1466
@type float
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====statusC=====

statusC:  Status                                {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 2897      2897          -
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #   #                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     3                      2897
   (3 unique values)

      {txt}statusC is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}statusC {c |}{res}      2897    2.391785    .6833468          1          3
@mean     2.392
@sd     0.683
@min         1
@max         3
@values 1, 2, 3
@names "ACTIVE", "DISMISSED", "SETTLED"
@freq 331, 1100, 1466
@type long
@label Status
@class category
@N_unique 3
@N 2897
 
_@NOTES
 
=====settlement=====

settlement:  Settlement ()                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1466       731        735
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1466       731        735
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res} 1431
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.5             6156.096                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}settlement {c |}{res}      1466    178.5828    706.0566         .5   6156.096
@mean   178.583
@sd   706.057
@min     0.500
@max  6156.096
@example0 .
@histh .00441085, .00026108, .00019581, .00003092, .00005153, .00003779, .00004809
@histw 99.783813, 298.35144, 496.91907, 894.05432, 2681.1631, 3276.866, 6056.8125
@type double
@label Settlement ()
@class other
@N_unique .
@N 1466
 
_@NOTES
 
=====dir_co=====
@example0 Abele:JohnE.:BSX__01
@type str36
@label 
@class identifier
@N_unique 2897
@N 2897
 
_@NOTES
 
=====yr=====

yr:                                             {txt}Number of Observations
{hline 5}                                       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2897      2897          -
{txt}{c |}  {res}#                         {txt}Positive           {res}-         -          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                                            2897
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 10}yr {c |}{res}      2897           0           0          0          0
@mean         0
@sd     0.000
@min         0
@max         0
@values 0
@type byte
@label 
@class constant
@N_unique 1
@N 2897
 
_@NOTES
 
=====director_id=====

director_id:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2897      2897          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}30000            201708                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}director_id {c |}{res}      2897    42054.14    16711.73      30000     201708
@mean 42054.135
@sd 16711.728
@min     30000
@max    201708
@example0 38145
@histh .00006589, .00005208, .00003089, .00001394, .00001073, 9.022e-06, 7.929e-06, 5.741e-06, 3.418e-07, 1.435e-06
@histw 32525.117, 37575.352, 42625.59, 47675.824, 52726.059, 57776.293, 62826.531, 67876.766, 72927, 199182.88
@type long
@label 
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====lname=====
@example0 Abele
@type str23
@label 
@class string
@N_unique 2122
@N 2897
 
_@NOTES
 
=====fname=====
@example0 John E.
@type str19
@label 
@class string
@N_unique 1701
@N 2897
 
_@NOTES
 
=====position=====
@freq 2897
@values "IRRC"
@example0 IRRC
@type str11
@label 
@class constant
@N_unique 1
@N 2897
 
_@NOTES
 
=====status_yr_1=====
@freq 22, 1, 13, 100
@values "EMP", "EMP?", "FORMEMP", "IND"
@type str7
@label 
@class category
@N_unique 4
@N 136
 
_@NOTES
 
=====status_yr_2=====
@freq 74, 24, 448
@values "EMP", "FORMEMP", "IND"
@type str7
@label 
@class category
@N_unique 3
@N 546
 
_@NOTES
 
=====status_yr_3=====
@freq 93, 42, 571, 1
@values "EMP", "FORMEMP", "IND", "REL"
@type str7
@label 
@class category
@N_unique 4
@N 707
 
_@NOTES
 
=====status_yr_4=====
@freq 102, 45, 683, 3
@values "EMP", "FORMEMP", "IND", "REL"
@type str11
@label 
@class category
@N_unique 4
@N 833
 
_@NOTES
 
=====cid=====

cid:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2897      2897          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2               1015340                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}cid {c |}{res}      2897     14812.1    76569.16          2    1015340
@mean 14812.101
@sd 76569.159
@min         2
@max   1015340
@example0 8815
@histh .00003108, 2.890e-07, 1.838e-06, 9.247e-08, 1.849e-07
@histw 14933.441, 44796.324, 74659.203, 104522.09, 1000408.6
@type long
@label 
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====meet_yr=====

meet_yr:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #   #         {txt}Positive       {res} 2888      2888          -
{txt}{c |}  {res}#       #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 2888      2888          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}    9
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}13220             15622                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}meet_yr {c |}{res}      2888    14575.97    666.8728      13220      15622
@mean 14575.968
@sd   666.873
@min 13220.000
@max 15622.000
@example0 14004
@histh .0004019, .00024996, .00009803, .00004901, .00005882, .0007695, .00061266, .00010293, .00012253, .00023526, .00027937, .00097045, .00017645, .00009312, .00042641, .00204383, .00011273, .00016174, .00007842, .00158311, .00027447, .00017645, .00015684, .00011273, .00139686, .00051463, .00010783, .00006372, .00013233, .0019262, .00051463, .00015194
@histw 13255.323, 13325.971, 13396.617, 13467.265, 13537.912, 13608.559, 13679.206, 13749.853, 13820.5, 13891.147, 13961.794, 14032.441, 14103.088, 14173.735, 14315.029, 14385.677, 14456.323, 14526.971, 14597.617, 14738.912, 14809.559, 14880.206, 14950.853, 15021.5, 15092.147, 15162.794, 15233.441, 15304.088, 15374.735, 15445.383, 15516.029, 15586.677
@type float
@label 
@class other
@N_unique .
@N 2888
 
_@NOTES
 
=====posn_id=====

posn_id:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2897      2897          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                                            2897
   (1 unique value)

      {txt}posn_id is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}posn_id {c |}{res}      2897           1           0          1          1
@mean         1
@sd     0.000
@min         1
@max         1
@values 1
@type long
@label 
@class constant
@N_unique 1
@N 2897
 
_@NOTES
 
=====dir_co_id=====

dir_co_id:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res} 2897      2897          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                  5007                      2897
(More than 99 unique values)

      {txt}dir_co_id is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}dir_co_id {c |}{res}      2897    2497.853    1450.974          2       5007
@mean  2497.853
@sd  1450.974
@min         2
@max      5007
@example0 2
@histh .00021104, .00020166, .00020166, .00021808, .00018525, .00018994, .00018525, .00022042, .00021573, .00019697, .00018759, .00019932, .00021339, .00018056, .00022042, .00017587, .0002087, .0002087, .00022042, .00019228, .00018056, .00019697, .00019463, .00019463, .00016649, .00018759, .00021573, .00020401, .0002087, .00020635, .00020401, .00019697, .00022042, .0001829
@histw 75.602943, 222.80882, 370.01471, 517.22058, 664.42645, 811.63232, 958.83826, 1106.0441, 1253.25, 1400.4559, 1547.6617, 1694.8677, 1842.0735, 1989.2794, 2136.4854, 2283.6912, 2430.897, 2578.103, 2725.3088, 2872.5146, 3019.7207, 3166.9265, 3314.1323, 3461.3381, 3608.5442, 3755.75, 3902.9558, 4050.1619, 4197.3677, 4344.5737, 4491.7793, 4638.9854, 4786.1914, 4933.397
@type long
@label 
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====tenmax=====

tenmax:  Length of board tenure                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero           {res}  478       478          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2419      2419          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#               #         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     4                      2897
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}tenmax {c |}{res}      2897    2.547463      1.5569          0          4
@mean     2.547
@sd     1.557
@min     0.000
@max     4.000
@values 0, 1, 2, 3, 4
@names "0", "1", "2", "3", "4"
@freq 478, 401, 391, 311, 1316
@type float
@label Length of board tenure
@class category
@N_unique 5
@N 2897
 
_@NOTES
 
=====tenstart=====

tenstart:  First observed in yr                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2897      2897          -
{txt}{c |}  {res}#                         {txt}Positive           {res}-         -          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                                            2897
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}tenstart {c |}{res}      2897           0           0          0          0
@mean     0.000
@sd     0.000
@min     0.000
@max     0.000
@values 0
@type float
@label First observed in yr
@class constant
@N_unique 1
@N 2897
 
_@NOTES
 
=====survmax=====

survmax:  Last year firm observed with dire     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 2897      2897          -
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#                 {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}.   .   #                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                     4                      2897
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}survmax {c |}{res}      2897    3.799793    .5404494          2          4
@mean     3.800
@sd     0.540
@min     2.000
@max     4.000
@values 2, 3, 4
@names "2", "3", "4"
@freq 191, 198, 2508
@type float
@label Last year firm observed with directors
@class category
@N_unique 3
@N 2897
 
_@NOTES
 
=====lastyr=====

lastyr:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2496      2496          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  401       401          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}lastyr {c |}{res}      2897    .1384191    .3453989          0          1
@mean     0.138
@sd     0.345
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2496, 401
@type byte
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====settleMM=====

settleMM:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1466       731        735
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1466       731        735
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res} 1431
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.5             6156.096                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}settleMM {c |}{res}      1466    178.5828    706.0566         .5   6156.096
@mean   178.583
@sd   706.057
@min     0.500
@max  6156.096
@example0 .
@histh .00441085, .00026108, .00019581, .00003092, .00005153, .00003779, .00004809
@histw 99.783813, 298.35144, 496.91907, 894.05432, 2681.1631, 3276.866, 6056.8125
@type double
@label 
@class other
@N_unique .
@N 1466
 
_@NOTES
 
=====did=====

did:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2897      2897          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}30000            201708                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}did {c |}{res}      2897    42054.14    16711.73      30000     201708
@mean 42054.135
@sd 16711.728
@min 30000.000
@max  2.02e+05
@example0 38145
@histh .00006589, .00005208, .00003089, .00001394, .00001073, 9.022e-06, 7.929e-06, 5.741e-06, 3.418e-07, 1.435e-06
@histw 32525.117, 37575.352, 42625.59, 47675.824, 52726.059, 57776.293, 62826.531, 67876.766, 72927, 199182.88
@type double
@label 
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====idx_desc=====
@freq 257, 313, 212, 1223, 257, 88, 141, 243
@values "MidCap", "Not Super", "Not super", "S&P 500", "S&P 500 (", "S&P MidCa", "S&P Small", "SmallCap"
@type str16
@label description of index code
@class category
@N_unique 8
@N 2734
 
_@NOTES
 
=====age=====

age:  director age                              {txt}Number of Observations
{hline 18}                          {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 2897      2897          -
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}27                   93                      2897
  (59 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}age {c |}{res}      2897    57.87849    9.009649         27         93
@mean    57.878
@sd     9.010
@min        27
@max        93
@example0 61
@histh .00017782, .00035564, .00213387, .00177822, .00408992, .00622378, .0119141, .01475926, .01867135, .01973829, .02845159, .03058545, .0412548, .04001004, .0444556, .0222278, .04107698, .04267738, .03894311, .03040763, .02969634, .01938264, .01084717, .00746854, .00213387, .00231169, .0016004, .00053347, .00053347, .00017782, .00017782, .00017782, .00017782
@histw 27.970589, 31.852942, 33.794117, 35.735294, 37.676472, 39.617645, 41.558823, 43.5, 45.441177, 47.382355, 49.323528, 51.264706, 53.205883, 55.14706, 57.088234, 59.029411, 60.970589, 62.911766, 64.852943, 66.794121, 68.735291, 70.676468, 72.617645, 74.558823, 76.5, 78.441177, 80.382355, 82.323532, 84.264709, 86.205879, 88.147057, 90.088234, 92.029411
@type byte
@label director age
@class other
@N_unique 59
@N 2897
 
_@NOTES
 
=====ethnicity=====
@freq 21, 85, 1307, 23
@values "A", "B", "C", "H"
@type str1
@label director ethnicity if known (a=asian, b=african american, c=caucasian, h=hispani
@class category
@N_unique 4
@N 1436
 
_@NOTES
 
=====proxybsc=====

proxybsc:  number other company boards          {txt}Number of Observations
{hline 38}      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1124      1124          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1270      1270          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2394      2394          -
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing        {res}  503
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                    10                      2897
  (11 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}proxybsc {c |}{res}      2394    1.099833    1.414677          0         10
@mean     1.100
@sd     1.415
@min         0
@max        10
@values 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 1124, 541, 380, 196, 81, 42, 12, 13, 1, 1, 3
@type byte
@label number other company boards
@class category
@N_unique 11
@N 2394
 
_@NOTES
 
=====priemp=====
@example0 Boston Scientific
@type str50
@label primary company name
@class string
@N_unique 1389
@N 2205
 
_@NOTES
 
=====prititle=====
@example0 founder chairman
@type str27
@label title in primary job
@class string
@N_unique 260
@N 2091
 
_@NOTES
 
=====substitle=====
@freq 4, 1, 1, 1, 1, 2, 1, 9, 2, 1, 1, 1, 1, 1, 8, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1
@values "CEO", "CEO & president", "CEO; chairman", "CEO; president", "EVP; president", "VP", "ceo", "chairman", "chairman; CEO", "chairman; CEO; president", "chairman; presi", "division presid", "group president", "managing director", "president", "president and C", "president; CEO", "president; COO", "president; ceo", "president; gen.", "senior advisor", "senior manageme", "subsidiary CEO", "subsidiary CEO and chairman", "subsidiary chairman- CEO", "subsidiary chairman; CEO", "subsidiary president", "vice-chairman"
@type str35
@label employment title - if executive of subsidiary
@class category
@N_unique 28
@N 48
 
_@NOTES
 
=====othertitle=====
@example0 founder chairm
@type str35
@label other employment title
@class string
@N_unique 178
@N 548
 
_@NOTES
 
=====cntryemp=====
@freq 1, 1, 2, 1, 6, 1, 2, 8, 1, 4, 3, 1, 1, 2, 3, 2307
@values "BH", "CA", "CH", "CN", "DE", "FI", "FR", "GB", "JP", "MX", "NL", "NO", "R", "SE", "UK", "US"
@type str2
@label country of employment
@class category
@N_unique 16
@N 2344
 
_@NOTES
 
=====yearbeg=====

yearbeg:  date service began                    {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2857      2857          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 2857      2857          -
{txt}{c |}  {res}.   .   .   #   #         {txt}Missing        {res}   40
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1948               2002                      2897
  (47 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}yearbeg {c |}{res}      2857     1992.38    7.017365       1948       2002
@mean  1992.380
@sd     7.017
@min      1948
@max      2002
@example0 1979
@histh .00022038, .00022038, .00022038, .00022038, .00044076, .00154267, .00066114, .00110191, .00088153, .00198343, .00308534, .00176305, .00264458, .00286496, .00683182, .00859487, .00418725, .00837449, .00793373, .02181776, .02556424, .02159738, .0379056, .02159738, .06192717, .08352455, .05112848, .11305565, .05046734, .06016412, .02710691
@histw 1948.7941, 1953.5588, 1955.1471, 1956.7354, 1959.9117, 1961.5, 1963.0883, 1964.6765, 1966.2646, 1967.8529, 1969.4412, 1971.0294, 1972.6177, 1974.2059, 1975.7941, 1977.3823, 1978.9706, 1980.5588, 1982.1471, 1983.7354, 1985.3235, 1986.9117, 1988.5, 1990.0883, 1991.6765, 1993.2646, 1994.8529, 1996.4412, 1998.0294, 1999.6177, 2001.2059
@type int
@label date service began
@class other
@N_unique 47
@N 2857
 
_@NOTES
 
=====yearend=====

yearend:  date service ends                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero           {res}    5         5          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2388      2388          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}                  {res}#         {txt}Total          {res} 2393      2393          -
{txt}{c |}  {res}.   .   .   .   #         {txt}Missing        {res}  504
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  2005                      2897
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}yearend {c |}{res}      2393    1997.459    91.43267          0       2005
@mean  1997.459
@sd    91.433
@min         0
@max      2005
@values 0, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005
@names "0", "1998", "1999", "2000", "2001", "2002", "2003", "2004", "2005"
@freq 5, 1, 210, 448, 478, 478, 497, 174, 102
@type long
@label date service ends
@class category
@N_unique 9
@N 2393
 
_@NOTES
 
=====sharesheld=====

sharesheld:  shares held                        {txt}Number of Observations
{hline 24}                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  113       113          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2750      2750          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2863      2863          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}   34
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0              6.96e+08                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}sharesheld {c |}{res}      2863     2137379    1.77e+07          0   6.96e+08
@mean  2.14e+06
@sd  1.77e+07
@min         0
@max 696356050
@example0 14359956
@histh 4.792e-08, 4.263e-10, 1.364e-10, 8.527e-11, 5.116e-11, 8.527e-11, 1.705e-11, 3.411e-11, 1.705e-11, 1.705e-11, 1.705e-11, 1.705e-11
@histw 10240530, 30721590, 51202652, 71683712, 92164768, 1.126e+08, 1.331e+08, 1.536e+08, 1.946e+08, 2.355e+08, 2.970e+08, 6.861e+08
@type long
@label shares held
@class other
@N_unique .
@N 2863
 
_@NOTES
 
=====stkholding=====

stkholding:  Voting Share (\%)                  {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2128      2128          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  735        30        705
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2863      2158        705
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}   34
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0              142.5288                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}stkholding {c |}{res}      2863    1.090467    5.811584          0   142.5288
@mean     1.090
@sd     5.812
@min     0.000
@max   142.529
@example0 7.4000001
@histh .22580019, .00516591, .00241631, .00074989, .00099985, .00066657, .00016664, .00033328, .00099985, .00024996, .00016664, .00033328, .00016664, .00008332, .00008332, .00008332, .00008332
@histw 2.0960114, 6.2880344, 10.480057, 14.67208, 18.864103, 23.056126, 27.248148, 31.440172, 35.632195, 39.824219, 44.016239, 48.208263, 56.592308, 64.976357, 69.168381, 98.512535, 140.43277
@type float
@label Voting Share (\%) 
@class other
@N_unique .
@N 2863
 
_@NOTES
 
=====dirtype=====
@freq 599, 1832, 466
@values "E", "I", "L"
@type str1
@label board affiliation ((e=employee, i=independent,l=linked))
@class category
@N_unique 3
@N 2897
 
_@NOTES
 
=====proftype=====
@freq 68, 25, 2, 1, 71, 7, 12, 1, 1
@values "Consulting", "Financial", "Financial Services", "Insurance", "Legal", "Other (enter name)", "Real Estate", "advertising", "aircraft leasing t"
@type str18
@label type of services
@class category
@N_unique 9
@N 188
 
_@NOTES
 
=====formersev=====

formersev:  year of termination                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2757      2757          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  140       140          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  2001                      2897
  (20 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}formersev {c |}{res}      2897    96.40628    427.8934          0       2001
@mean    96.406
@sd   427.893
@min         0
@max      2001
@values 0, 1982, 1983, 1984, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001
@names "0", "1982", "1983", "1984", "1986", "1987", "1988", "1989", "1990", "1991", "1992", "1993", "1994", "1995", "1996", "1997", "1998", "1999", "2000", "2001"
@freq 2757, 1, 1, 1, 2, 2, 4, 8, 3, 4, 5, 11, 8, 17, 18, 15, 16, 12, 5, 7
@type int
@label year of termination
@class category
@N_unique 20
@N 2897
 
_@NOTES
 
=====relation=====
@freq 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 3, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 2, 3, 1, 1, 1
@values "Son of the CEO", "Wife of CEO", "brother of CEO", "brother of chairman; CEO;", "brother of president", "brother of senior VP", "brother to Robert K. Green", "brother-in-law of Huizenga", "cousin of chairman", "daughter of CEO", "father of CEO", "father of COO", "father of chairman", "father of executive VP", "father to Scott", "father to employee", "husband to subsidiary EVP", "mother of CEO", "mother of vice chairman and pr", "sister of CEO", "sister of chairman", "son of CEO", "son of chairman", "son-in-law of CEO", "wife of Fred S.L. Chan", "wife of Harland C. Stonecipher"
@type str30
@label relation to employee
@class category
@N_unique 26
@N 33
 
_@NOTES
 
=====annrev=====

annrev:  revenue/turnover                       {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2388       902       1486
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2388       902       1486
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  509
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1.1              162558                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}annrev {c |}{res}      2388    10137.75    18565.39        1.1     162558
@mean 10137.752
@sd 18565.387
@min     1.100
@max  1.63e+05
@example0 1462
@histh .00011638, .00002661, .00001777, 8.756e-06, 8.416e-06, .00001105, 9.351e-07, 2.465e-06, 2.805e-06, 1.955e-06, 1.105e-06, 2.210e-06, 1.445e-06, 1.105e-06
@histw 2464.0833, 7390.0498, 12316.017, 17241.982, 22167.949, 27093.916, 32019.883, 36945.852, 41871.816, 46797.785, 51723.75, 56649.715, 110835.35, 160095.02
@type double
@label revenue/turnover
@class other
@N_unique .
@N 2388
 
_@NOTES
 
=====eco_code=====

eco_code:  economic group                       {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#           #         {txt}Positive       {res} 2734      2734          -
{txt}{c |}      {res}#   #       #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #       #         {txt}Total          {res} 2734      2734          -
{txt}{c |}  {res}#   #   #   .   #         {txt}Missing        {res}  163
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}10                   95                      2897
  (11 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}eco_code {c |}{res}      2734    53.15106    25.73194         10         95
@mean    53.151
@sd    25.732
@min        10
@max        95
@values 10, 20, 30, 35, 40, 50, 60, 80, 86, 90, 95
@names "10", "20", "30", "35", "40", "50", "60", "80", "86", "90", "95"
@freq 67, 404, 245, 426, 80, 317, 189, 633, 105, 243, 25
@type int
@label economic group
@class category
@N_unique 11
@N 2734
 
_@NOTES
 
=====eco_desc=====
@freq 59, 158, 82, 74, 245, 330, 80, 317, 426, 31, 49, 8, 584, 23, 25, 243
@values "Basic materials", "Capital goods", "Communication servic", "Consumer discretionar", "Consumer staples", "Consumer-cyclicals", "Energy", "Financials", "Health care", "Industials", "Information technolog", "Materials", "Technology", "Telecommunication ser", "Transportation", "Utilities"
@type str26
@label description of economic group
@class category
@N_unique 16
@N 2734
 
_@NOTES
 
=====exchange=====
@freq 17, 1734, 643
@values "AMEX", "NYSE", "OTC"
@type str4
@label stock exchange
@class category
@N_unique 3
@N 2394
 
_@NOTES
 
=====ind_code=====

ind_code:  industry group code                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#           #         {txt}Positive       {res} 2734      2734          -
{txt}{c |}      {res}#           #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #       #         {txt}Total          {res} 2734      2734          -
{txt}{c |}  {res}#   #   #   .   #         {txt}Missing        {res}  163
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}10                   95                      2897
  (25 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}ind_code {c |}{res}      2734    53.71324    25.28815         10         95
@mean    53.713
@sd    25.288
@min        10
@max        95
@values 10, 20, 21, 22, 24, 25, 30, 31, 32, 35, 36, 40, 50, 51, 60, 61, 62, 80, 81, 82, 83, 86, 90, 91, 95
@names "10", "20", "21", "22", "24", "25", "30", "31", "32", "35", "36", "40", "50", "51", "60", "61", "62", "80", "81", "82", "83", "86", "90", "91", "95"
@freq 67, 31, 91, 130, 115, 37, 175, 22, 48, 373, 53, 80, 182, 135, 115, 56, 18, 544, 52, 28, 9, 105, 235, 8, 25
@type int
@label industry group code
@class category
@N_unique 25
@N 2734
 
_@NOTES
 
=====ind_desc=====
@example0 Health care (medical products/
@type str37
@label description of industry code
@class string
@N_unique 111
@N 2734
 
_@NOTES
 
=====votecref=====

votecref:  common shares outstanding from p     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2897      2770        127
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2770        127
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}8914835        7.16e+09                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}votecref {c |}{res}      2897    4.62e+08    9.56e+08    8914835   7.16e+09
@mean  4.62e+08
@sd  9.56e+08
@min  8.91e+06
@max  7.16e+09
@example0 1.941e+08
@histh 2.923e-09, 8.283e-10, 2.526e-10, 1.312e-10, 1.001e-10, 6.725e-11, 8.201e-11, 2.296e-11, 5.249e-11, 8.365e-11, 2.132e-11, 1.968e-11, 3.445e-11, 2.132e-11, 4.593e-11, 2.788e-11, 1.804e-11, 1.968e-11
@histw 1.141e+08, 3.246e+08, 5.350e+08, 7.455e+08, 9.559e+08, 1.166e+09, 1.377e+09, 1.587e+09, 1.798e+09, 2.008e+09, 2.219e+09, 2.429e+09, 2.850e+09, 3.060e+09, 4.533e+09, 5.165e+09, 6.638e+09, 7.059e+09
@type double
@label common shares outstanding from proxy
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====nominee=====

nominee:  for election at the current year      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1253      1253          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1644      1644          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}nominee {c |}{res}      2897    .5674836    .4955106          0          1
@mean     0.567
@sd     0.496
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1253, 1644
@type byte
@label for election at the current year annual meeting
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====nonempchr=====

nonempchr:  nonemployee serving as chairman     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2347      2347          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   47        47          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2394      2394          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  503
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}nonempchr {c |}{res}      2394    .0196324    .1387625          0          1
@mean     0.020
@sd     0.139
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2347, 47
@type byte
@label nonemployee serving as chairman
@class dummy
@N_unique 2
@N 2394
 
_@NOTES
 
=====othert=====
@example0 
@type str35
@label other title description (2003)
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====mtgmonth=====

mtgmonth:  month of meeting                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 2897      2897          -
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}.   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    11                      2897
  (11 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}mtgmonth {c |}{res}      2897    5.209527    1.842918          1         11
@mean     5.210
@sd     1.843
@min         1
@max        11
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"
@freq 34, 78, 57, 785, 1266, 304, 55, 86, 61, 66, 105
@type byte
@label month of meeting
@class category
@N_unique 11
@N 2897
 
_@NOTES
 
=====fullname=====
@example0 JOHN E ABELE
@type str32
@label director full name
@class string
@N_unique 2606
@N 2897
 
_@NOTES
 
=====president=====

president:  employment title- president         {txt}Number of Observations
{hline 39}     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2294      2294          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  603       603          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}president {c |}{res}      2897    .2081464    .4060522          0          1
@mean     0.208
@sd     0.406
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2294, 603
@type byte
@label employment title- president
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====chairman=====

chairman:  employment title -chairman           {txt}Number of Observations
{hline 37}       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2236      2236          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  661       661          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}chairman {c |}{res}      2897    .2281671    .4197233          0          1
@mean     0.228
@sd     0.420
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2236, 661
@type byte
@label employment title -chairman
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====vicechair=====

vicechair:  employment title-vicechair          {txt}Number of Observations
{hline 38}      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2818      2818          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   79        79          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}vicechair {c |}{res}      2897    .0272696     .162896          0          1
@mean     0.027
@sd     0.163
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2818, 79
@type byte
@label employment title-vicechair
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====vp=====

vp:  employment title-vicepresident             {txt}Number of Observations
{hline 35}         {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2862      2862          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   35        35          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 10}vp {c |}{res}      2897    .0120815    .1092686          0          1
@mean     0.012
@sd     0.109
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2862, 35
@type byte
@label employment title-vicepresident
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====ceo=====

ceo:  CEO (0/1)                                 {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2605      2605          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  292       292          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}ceo {c |}{res}      2897    .1007939    .3011076          0          1
@mean     0.101
@sd     0.301
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2605, 292
@type byte
@label CEO (0/1) 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====cfo=====

cfo:  employment title -chief financial off     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2832      2832          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   65        65          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}cfo {c |}{res}      2897     .022437    .1481255          0          1
@mean     0.022
@sd     0.148
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2832, 65
@type byte
@label employment title -chief financial officer
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====coo=====

coo:  employment title -chief operating off     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2814      2814          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   83        83          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}coo {c |}{res}      2897    .0286503    .1668505          0          1
@mean     0.029
@sd     0.167
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2814, 83
@type byte
@label employment title -chief operating officer
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====svp=====

svp:  employment title- senior vp               {txt}Number of Observations
{hline 33}           {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2852      2852          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   45        45          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}svp {c |}{res}      2897    .0155333    .1236823          0          1
@mean     0.016
@sd     0.124
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2852, 45
@type byte
@label employment title- senior vp
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====secty=====

secty:  employment title- secretary             {txt}Number of Observations
{hline 35}         {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2873      2873          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   24        24          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}secty {c |}{res}      2897    .0082844    .0906567          0          1
@mean     0.008
@sd     0.091
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2873, 24
@type byte
@label employment title- secretary
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====treas=====

treas:  employment title-treasurer              {txt}Number of Observations
{hline 34}          {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2379      2379          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   15        15          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2394      2394          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  503
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}treas {c |}{res}      2394    .0062657    .0789241          0          1
@mean     0.006
@sd     0.079
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2379, 15
@type byte
@label employment title-treasurer
@class dummy
@N_unique 2
@N 2394
 
_@NOTES
 
=====evp=====

evp:  employment title -executive vicepresi     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2788      2788          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  109       109          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}evp {c |}{res}      2897    .0376251    .1903207          0          1
@mean     0.038
@sd     0.190
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2788, 109
@type byte
@label employment title -executive vicepresident
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====gender=====

gender:  gender (female=1)                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2456      2456          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  277       277          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2733      2733          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  164
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}gender {c |}{res}      2733    .1013538    .3018519          0          1
@mean     0.101
@sd     0.302
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2456, 277
@type byte
@label gender (female=1)
@class dummy
@N_unique 2
@N 2733
 
_@NOTES
 
=====nommbr=====

nommbr:  committee membership - nominating      {txt}Number of Observations
{hline 42}  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1755      1755          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  639       639          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2394      2394          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}  503
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}nommbr {c |}{res}      2394    .2669173    .4424412          0          1
@mean     0.267
@sd     0.442
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1755, 639
@type byte
@label committee membership - nominating
@class dummy
@N_unique 2
@N 2394
 
_@NOTES
 
=====compchair=====

compchair:  committee chair - compensation      {txt}Number of Observations
{hline 42}  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1886      1886          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  150       150          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2036      2036          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  861
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}compchair {c |}{res}      2036    .0736739    .2613036          0          1
@mean     0.074
@sd     0.261
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1886, 150
@type byte
@label committee chair - compensation
@class dummy
@N_unique 2
@N 2036
 
_@NOTES
 
=====compmbr=====

compmbr:  committee membership - compensati     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1547      1547          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  847       847          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2394      2394          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}  503
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}compmbr {c |}{res}      2394    .3538012    .4782483          0          1
@mean     0.354
@sd     0.478
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1547, 847
@type byte
@label committee membership - compensation
@class dummy
@N_unique 2
@N 2394
 
_@NOTES
 
=====auditchair=====

auditchair:  committee chair - audit            {txt}Number of Observations
{hline 36}        {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2340      2340          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  165       165          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2505      2505          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  392
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}auditchair {c |}{res}      2505    .0658683    .2481012          0          1
@mean     0.066
@sd     0.248
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2340, 165
@type byte
@label committee chair - audit
@class dummy
@N_unique 2
@N 2505
 
_@NOTES
 
=====auditmbr=====

auditmbr:  committee membership - audit         {txt}Number of Observations
{hline 39}     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1808      1808          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1055      1055          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2863      2863          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}   34
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}auditmbr {c |}{res}      2863    .3684946    .4824807          0          1
@mean     0.368
@sd     0.482
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1808, 1055
@type byte
@label committee membership - audit
@class dummy
@N_unique 2
@N 2863
 
_@NOTES
 
=====corpgov=====

corpgov:  committee membership-corporate go     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2052      2052          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  342       342          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2394      2394          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}  503
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}corpgov {c |}{res}      2394    .1428571    .3500002          0          1
@mean     0.143
@sd     0.350
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2052, 342
@type byte
@label committee membership-corporate governance
@class dummy
@N_unique 2
@N 2394
 
_@NOTES
 
=====formeremp=====

formeremp:  former employee                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2756      2756          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  141       141          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}formeremp {c |}{res}      2897     .048671    .2152165          0          1
@mean     0.049
@sd     0.215
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2756, 141
@type byte
@label former employee
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====charity=====

charity:  employment title -charity             {txt}Number of Observations
{hline 35}         {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2895      2895          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    2         2          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}charity {c |}{res}      2897    .0006904    .0262703          0          1
@mean     0.001
@sd     0.026
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2895, 2
@type byte
@label employment title -charity
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====supplier=====

supplier:  business transaction                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2795      2795          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  102       102          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}supplier {c |}{res}      2897    .0352088    .1843391          0          1
@mean     0.035
@sd     0.184
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2795, 102
@type byte
@label business transaction
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====relative=====

relative:  relative                             {txt}Number of Observations
{hline 19}                         {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2864      2864          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   33        33          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}relative {c |}{res}      2897    .0113911    .1061378          0          1
@mean     0.011
@sd     0.106
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2864, 33
@type byte
@label relative
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====interlock=====

interlock:  interlocking directorship           {txt}Number of Observations
{hline 37}       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2859      2859          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   38        38          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}interlock {c |}{res}      2897     .013117    .1137956          0          1
@mean     0.013
@sd     0.114
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2859, 38
@type byte
@label interlocking directorship
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====otherlink=====

otherlink:  other affiliation                   {txt}Number of Observations
{hline 29}               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2893      2893          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    4         4          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}otherlink {c |}{res}      2897    .0013807     .037139          0          1
@mean     0.001
@sd     0.037
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2893, 4
@type byte
@label other affiliation
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====attendance=====

attendance:  attended less than 75 percent      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2831      2831          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   66        66          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}attendance {c |}{res}      2897    .0227822    .1492342          0          1
@mean     0.023
@sd     0.149
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2831, 66
@type byte
@label attended less than 75 percent of board/ committee meetings
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====grandfath=====

grandfath:  grandfathered on retirement age     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2388      2388          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    6         6          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2394      2394          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  503
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}grandfath {c |}{res}      2394    .0025063    .0500103          0          1
@mean     0.003
@sd     0.050
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2388, 6
@type byte
@label grandfathered on retirement age/tenure policy
@class dummy
@N_unique 2
@N 2394
 
_@NOTES
 
=====priorserv=====

priorserv:  prior service on board              {txt}Number of Observations
{hline 34}          {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2366      2366          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   28        28          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2394      2394          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  503
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}priorserv {c |}{res}      2394    .0116959    .1075358          0          1
@mean     0.012
@sd     0.108
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2366, 28
@type byte
@label prior service on board
@class dummy
@N_unique 2
@N 2394
 
_@NOTES
 
=====profsvcs=====

profsvcs:  compensation for profesional ser     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2709      2709          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  188       188          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}profsvcs {c |}{res}      2897    .0648947    .2463825          0          1
@mean     0.065
@sd     0.246
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2709, 188
@type byte
@label compensation for profesional services
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====ownless1=====

ownless1:  own less than 1 pct.                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  410       410          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2323      2323          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 2733      2733          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}  164
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}ownless1 {c |}{res}      2733    .8499817    .3571547          0          1
@mean     0.850
@sd     0.357
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 410, 2323
@type byte
@label own less than 1 pct.
@class dummy
@N_unique 2
@N 2733
 
_@NOTES
 
=====desigd=====

desigd:  designated director                    {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2817      2817          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   80        80          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}desigd {c |}{res}      2897    .0276148    .1638947          0          1
@mean     0.028
@sd     0.164
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2817, 80
@type byte
@label designated director
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====idx_code=====

idx_code:  s&p index code (e.g. s&p500=10,      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2209      2209          -
{txt}{c |}  {res}#               #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#               #         {txt}Total          {res} 2209      2209          -
{txt}{c |}  {res}#   .   .   .   #         {txt}Missing        {res}  688
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}10                   92                      2897
   (6 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}idx_code {c |}{res}      2209     42.0077    37.43965         10         92
@mean    42.008
@sd    37.440
@min        10
@max        92
@values 10, 40, 49, 60, 91, 92
@names "10", "40", "49", "60", "91", "92"
@freq 1227, 15, 98, 140, 345, 384
@type byte
@label s&p index code (e.g. s&p500=10, midcaps=92,smallcaps=91)
@class category
@N_unique 6
@N 2209
 
_@NOTES
 
=====cusip=====
@example0 101137
@type str6
@label cusip
@class string
@N_unique 296
@N 2897
 
_@NOTES
 
=====profother=====
@freq 554, 2, 1, 1, 1, 1, 1, 1, 1
@values "0", "advertis", "aircraft", "construc", "consulti", "drug res", "legal an", "network", "supplier"
@type str8
@label other proffession
@class category
@N_unique 9
@N 563
 
_@NOTES
 
=====voting=====

voting:  total voting power                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2341      2272         69
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2341      2272         69
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  556
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}8914835        7.16e+09                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}voting {c |}{res}      2341    4.12e+08    8.74e+08    8914835   7.16e+09
@mean  4.12e+08
@sd  8.74e+08
@min  8.91e+06
@max  7.16e+09
@example0 1.941e+08
@histh 3.012e-09, 7.526e-10, 1.773e-10, 9.457e-11, 1.084e-10, 4.137e-11, 1.123e-10, 6.698e-11, 5.910e-11, 5.122e-11, 2.364e-11, 1.379e-11, 2.758e-11, 2.561e-11, 2.167e-11, 2.364e-11
@histw 1.173e+08, 3.341e+08, 5.510e+08, 7.678e+08, 9.846e+08, 1.201e+09, 1.418e+09, 1.635e+09, 1.852e+09, 2.069e+09, 2.502e+09, 2.719e+09, 2.936e+09, 4.020e+09, 6.622e+09, 7.056e+09
@type double
@label total voting power
@class other
@N_unique .
@N 2341
 
_@NOTES
 
=====intercomp=====
@example0 
@type str35
@label person with whom the directorship interlocks
@class string
@N_unique 31
@N 32
 
_@NOTES
 
=====insthold=====

insthold:  Institutional Holdings               {txt}Number of Observations
{hline 33}           {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero           {res}   41        41          -
{txt}{c |}          {res}#   #             {txt}Positive       {res} 2849       104       2745
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 2890       145       2745
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing        {res}    7
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 98.56                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}insthold {c |}{res}      2890     61.3965    20.61511          0      98.56
@mean    61.397
@sd    20.615
@min     0.000
@max    98.560
@example0 51.040001
@histh .00549083, .00274542, .00095493, .00214859, .00334225, .00513274, .00190985, .00931054, .00608766, .0052521, .00107429, .00704259, .00919118, .00799752, .01062357, .01432391, .02088904, .02232143, .01432391, .01874045, .02315699, .01885982, .02494748, .01909855, .01217533, .01444328, .02470875, .01324962, .00763942, .00704259, .0056102, .00513274
@histw 1.4494117, 4.3482351, 7.2470589, 15.943529, 18.842352, 21.741177, 24.639999, 27.538822, 30.437647, 33.336472, 36.235294, 39.134117, 42.03294, 44.931763, 47.830585, 50.729412, 53.628235, 56.527058, 59.42588, 62.324703, 65.223526, 68.122353, 71.021172, 73.919998, 76.818825, 79.717644, 82.61647, 85.515289, 88.414116, 91.312943, 94.211761, 97.110588
@type double
@label Institutional Holdings
@class other
@N_unique .
@N 2890
 
_@NOTES
 
=====subs=====

subs:  substitle                                {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2297      2297          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   44        44          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2341      2341          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  556
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}subs {c |}{res}      2341    .0187954    .1358308          0          1
@mean     0.019
@sd     0.136
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2297, 44
@type byte
@label substitle
@class dummy
@N_unique 2
@N 2341
 
_@NOTES
 
=====nomchair=====

nomchair:  committee chair  nominating         {txt}Number of Observations
{hline 39}     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1413      1413          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   67        67          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1480      1480          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res} 1417
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}nomchair {c |}{res}      1480    .0452703    .2079666          0          1
@mean     0.045
@sd     0.208
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1413, 67
@type byte
@label committee chair  nominating
@class dummy
@N_unique 2
@N 1480
 
_@NOTES
 
=====tier=====
@example0 
@type str2
@label tier
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====cusiph=====
@example0 101137
@type str6
@label header cusip identifier
@class string
@N_unique 295
@N 2897
 
_@NOTES
 
=====id_new=====

id_new:  new irrc company id                    {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2897      1865       1032
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      1865       1032
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}14.1            1015340                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}id_new {c |}{res}      2897    14601.95    76145.11       14.1    1015340
@mean 14601.954
@sd 76145.111
@min    14.100
@max  1.02e+06
@example0 5018
@histh .00003153, 2.196e-07, 1.456e-06, 9.247e-08, 1.849e-07
@histw 14945.364, 44807.895, 74670.422, 104532.95, 1000408.8
@type double
@label new irrc company id
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====did_new=====

did_new:  new irrc director id                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2897      1554       1343
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      1554       1343
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2              201708.1                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}did_new {c |}{res}      2897    23759.56    25116.03          2   201708.1
@mean 23759.556
@sd 25116.032
@min     2.000
@max  2.02e+05
@example0 4745
@histh .00006261, .00001664, 7.622e-06, 3.317e-06, 2.327e-07, .00002205, .00002211, .00001228, 8.437e-06, 4.946e-06, 4.480e-06, 2.618e-06, 1.222e-06
@histw 2968.2661, 8900.7988, 14833.331, 20765.863, 26698.396, 32630.928, 38563.461, 44495.992, 50428.523, 56361.059, 62293.59, 68226.125, 198741.83
@type double
@label new irrc director id
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====compname=====
@example0 BOSTON SCIENTIFIC CORP
@type str48
@label CompName
@class string
@N_unique 164
@N 1562
 
_@NOTES
 
=====partial=====

partial:  Partial                               {txt}Number of Observations
{hline 17}                           {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   65        65          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   65        65          -
{txt}{c |}  {res}#                         {txt}Missing        {res} 2832
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                                            2897
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}partial {c |}{res}        65           1           0          1          1
@mean         1
@sd     0.000
@min         1
@max         1
@values 1
@type byte
@label Partial
@class constant
@N_unique 1
@N 65
 
_@NOTES
 
=====full=====

full:  Full                                     {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   31        31          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   31        31          -
{txt}{c |}  {res}#                         {txt}Missing        {res} 2866
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                                            2897
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}full {c |}{res}        31           1           0          1          1
@mean         1
@sd     0.000
@min         1
@max         1
@values .
@type byte
@label Full
@class constant
@N_unique 1
@N 31
 
_@NOTES
 
=====prefflag=====

prefflag:  PrefFlag                             {txt}Number of Observations
{hline 19}                         {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   52        52          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   52        52          -
{txt}{c |}  {res}#                         {txt}Missing        {res} 2845
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                                            2897
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}prefflag {c |}{res}        52           1           0          1          1
@mean         1
@sd     0.000
@min         1
@max         1
@values .
@type byte
@label PrefFlag
@class constant
@N_unique 1
@N 52
 
_@NOTES
 
=====sumblks=====

sumblks:  Blockholdings                         {txt}Number of Observations
{hline 23}                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  435       435          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2319       243       2076
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2754       678       2076
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing        {res}  143
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  98.7                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}sumblks {c |}{res}      2754    22.57583    19.24166          0       98.7
@mean    22.576
@sd    19.242
@min     0.000
@max    98.700
@example0 30.1
@histh .05441105, .01338387, .02251492, .01425945, .03164596, .0218895, .0277684, .01763668, .01976309, .02251492, .01813702, .01050696, .0080053, .01000663, .00412773, .01250829, .0043779, .00300199, .00200133, .00375249, .00237657, .00487823, .0051284, .00175116, .00062541, .00187624, .00250166, .00312707
@histw 1.4514705, 4.3544116, 7.2573528, 10.160294, 13.063235, 15.966176, 18.869118, 21.772058, 24.674999, 27.57794, 30.480881, 33.383823, 36.286762, 39.189705, 42.092648, 44.995586, 47.898529, 50.801468, 53.704411, 56.607349, 59.510292, 62.413235, 65.316177, 71.122055, 74.024994, 76.92794, 79.830879, 97.248528
@type float
@label Blockholdings
@class other
@N_unique .
@N 2754
 
_@NOTES
 
=====numblks=====

numblks:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  435       435          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 2319      2319          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2754      2754          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing        {res}  143
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     8                      2897
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}numblks {c |}{res}      2754    2.202251    1.625302          0          8
@mean     2.202
@sd     1.625
@min         0
@max         8
@values 0, 1, 2, 3, 4, 5, 6, 7, 8
@names "0", "1", "2", "3", "4", "5", "6", "7", "8"
@freq 435, 524, 778, 504, 253, 157, 56, 36, 11
@type byte
@label 
@class category
@N_unique 9
@N 2754
 
_@NOTES
 
=====group2=====
@freq 224, 278, 235, 325, 419, 81
@values "G0000", "G0510", "G1015", "G1525", "G2550", "G5000"
@type str5
@label 
@class category
@N_unique 6
@N 1562
 
_@NOTES
 
=====sumaflin=====

sumaflin:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2526      2526          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  228         7        221
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2754      2533        221
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  143
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  97.4                      2897
  (27 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}sumaflin {c |}{res}      2754    1.832996    9.122605          0       97.4
@mean     1.833
@sd     9.123
@min     0.000
@max    97.400
@values 0, 5.3000002, 5.5, 5.9099998, 6.4699998, 7.6999998, 8.1000004, 8.1999998, 8.3000002, 8.5, 9.4399996, 10.5, 10.9, 11.2, 13.8, 14.5, 15.9, 20.32, 22.700001, 24.5, 28.200001, 31.799999, 32.099998, 44.799999, 51, 63.900002, 97.400002
@names "0", "5.300000190734863", "5.5", "5.909999847412109", "6.46999979019165", "7.699999809265137", "8.100000381469727", "8.199999809265137", "8.300000190734863", "8.5", "9.439999580383301", "10.5", "10.89999961853027", "11.19999980926514", "13.80000019073486", "14.5", "15.89999961853027", "20.31999969482422", "22.70000076293945", "24.5", "28.20000076293945", "31.79999923706055", "32.09999847412109", "44.79999923706055", "51", "63.90000152587891", "97.40000152587891"
@freq 2526, 6, 14, 8, 15, 5, 12, 7, 4, 10, 8, 10, 8, 9, 16, 8, 9, 6, 9, 5, 8, 8, 9, 7, 7, 6, 14
@type float
@label 
@class category
@N_unique 27
@N 2754
 
_@NOTES
 
=====sumout=====

sumout:  Outside Blockholdings                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  847       847          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1907       159       1748
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2754      1006       1748
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing        {res}  143
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  66.3                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}sumout {c |}{res}      2754    14.29365    14.42168          0       66.3
@mean    14.294
@sd    14.422
@min     0.000
@max    66.300
@example0 0
@histh .1577193, .02606931, .03444872, .01731747, .01694505, .0299797, .02867624, .0180623, .02681414, .01322086, .01452433, .02234512, .02048303, .01433812, .01098635, .00931047, .00986909, .00949668, .00093105, .0039104, .00279314, .00316556, .00111726, .00130347, .00688975, .00148967, .00148967, .0059587, .00167588, .00148967
@histw .97500002, 4.875, 6.8250003, 8.7750006, 10.725, 12.675, 14.625001, 16.575001, 18.525002, 20.475, 22.425001, 24.375002, 26.325001, 28.275002, 30.225002, 32.175003, 34.125, 36.075001, 38.025002, 39.975002, 41.925003, 43.875004, 45.825001, 47.775002, 49.725002, 53.625004, 55.575001, 61.425003, 63.375004, 65.325005
@type float
@label Outside Blockholdings
@class other
@N_unique .
@N 2754
 
_@NOTES
 
=====sumesop=====

sumesop:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2582      2582          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  172        12        160
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2754      2594        160
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  143
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 21.25                      2897
  (16 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}sumesop {c |}{res}      2754    .5636964    2.374674          0      21.25
@mean     0.564
@sd     2.375
@min     0.000
@max    21.250
@values 0, 5.1700001, 5.1999998, 6.25, 6.5, 6.8000002, 7.2600002, 7.5599999, 7.6999998, 7.8000002, 8, 10.09, 10.2, 13.3, 13.6, 21.25
@names "0", "5.170000076293945", "5.199999809265137", "6.25", "6.5", "6.800000190734863", "7.260000228881836", "7.559999942779541", "7.699999809265137", "7.800000190734863", "8", "10.09000015258789", "10.19999980926514", "13.30000019073486", "13.60000038146973", "21.25"
@freq 2582, 8, 11, 13, 18, 10, 9, 8, 9, 13, 12, 11, 16, 9, 17, 8
@type float
@label 
@class category
@N_unique 16
@N 2754
 
_@NOTES
 
=====sumdir=====

sumdir:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2446      2446          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  308        44        264
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2754      2490        264
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  143
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  67.7                      2897
  (35 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}sumdir {c |}{res}      2754    2.348667     8.57191          0       67.7
@mean     2.349
@sd     8.572
@min     0.000
@max    67.700
@example0 7.4000001
@histh .44604921, .00802378, .00893557, .00364717, .0021883, .00291774, .00419425, .00255302, .00255302, .00145887, .00401189, .00237066, .00291774, .00127651, .00200594, .00164123, .00182359, .00182359, .00182359
@histw .99558818, 4.977941, 6.9691172, 8.9602938, 10.95147, 12.942646, 16.924999, 18.916176, 20.907352, 24.889706, 26.88088, 28.872057, 30.863234, 34.845585, 36.836761, 44.801468, 50.774998, 54.757351, 66.704407
@type float
@label 
@class other
@N_unique 35
@N 2754
 
_@NOTES
 
=====sumoff=====

sumoff:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2300      2300          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  454        66        388
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2754      2366        388
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  143
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 80.57                      2897
  (50 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}sumoff {c |}{res}      2754    3.536816    10.92805          0      80.57
@mean     3.537
@sd    10.928
@min     0.000
@max    80.570
@example0 0
@histh .35242721, .01823428, .00429042, .00643563, .00766146, .00674209, .00229844, .00398396, .00214521, .00137906, .00061292, .00214521, .00520979, .00153229, .00229844, .00091938, .00076615, .00137906, .00153229
@histw 1.184853, 5.9242649, 8.2939701, 10.663676, 13.033382, 17.772795, 20.1425, 22.512205, 24.881912, 29.621323, 31.99103, 34.360737, 43.839558, 46.209263, 50.948677, 55.688087, 65.166908, 67.536621, 79.385147
@type float
@label 
@class other
@N_unique 50
@N 2754
 
_@NOTES
 
=====numaflin=====

numaflin:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2526      2526          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  228       228          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2754      2754          -
{txt}{c |}  {res}#   .   .                 {txt}Missing        {res}  143
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     2                      2897
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}numaflin {c |}{res}      2754    .0962237    .3374552          0          2
@mean     0.096
@sd     0.337
@min         0
@max         2
@values 0, 1, 2
@names "0", "1", "2"
@freq 2526, 191, 37
@type byte
@label 
@class category
@N_unique 3
@N 2754
 
_@NOTES
 
=====numout=====

numout:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  847       847          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1907      1907          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 2754      2754          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing        {res}  143
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     7                      2897
   (8 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}numout {c |}{res}      2754    1.683733    1.586532          0          7
@mean     1.684
@sd     1.587
@min         0
@max         7
@values 0, 1, 2, 3, 4, 5, 6, 7
@names "0", "1", "2", "3", "4", "5", "6", "7"
@freq 847, 537, 615, 375, 251, 67, 28, 34
@type byte
@label 
@class category
@N_unique 8
@N 2754
 
_@NOTES
 
=====numesop=====

numesop:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2582      2582          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  172       172          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2754      2754          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  143
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}numesop {c |}{res}      2754    .0624546    .2420234          0          1
@mean     0.062
@sd     0.242
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2582, 172
@type byte
@label 
@class dummy
@N_unique 2
@N 2754
 
_@NOTES
 
=====numdir=====

numdir:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2446      2446          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  308       308          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2754      2754          -
{txt}{c |}  {res}#   .   .   .             {txt}Missing        {res}  143
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     3                      2897
   (4 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}numdir {c |}{res}      2754    .1466957    .4624415          0          3
@mean     0.147
@sd     0.462
@min         0
@max         3
@values 0, 1, 2, 3
@names "0", "1", "2", "3"
@freq 2446, 238, 44, 26
@type byte
@label 
@class category
@N_unique 4
@N 2754
 
_@NOTES
 
=====numoff=====

numoff:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2300      2300          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  454       454          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2754      2754          -
{txt}{c |}  {res}#   .   .   .             {txt}Missing        {res}  143
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     3                      2897
   (4 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}numoff {c |}{res}      2754    .2131445    .5356469          0          3
@mean     0.213
@sd     0.536
@min         0
@max         3
@values 0, 1, 2, 3
@names "0", "1", "2", "3"
@freq 2300, 352, 71, 31
@type byte
@label 
@class category
@N_unique 4
@N 2754
 
_@NOTES
 
=====firm_id=====

firm_id:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#               #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res} 1562      1562          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1562      1562          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res} 1335
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}20                 7644                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}firm_id {c |}{res}      1562    3892.813    2405.754         20       7644
@mean  3892.813
@sd  2405.754
@min        20
@max      7644
@example0 6237
@histh .00018222, .00015879, .00011974, .000164, .00015359, .00012755, .00007028, .00019524, .00014838, .0000833, .00020305, .00004946, .00011194, .00021085, .00005467, .00003644, .00010933, .00013797, .00005987, .00007289, .00005727, .00009892, .0001692, .00014057, .00017441, .00017441, .0000859, .00018482, .00010933, .00012495, .00029676
@histw 142.96774, 388.90323, 634.83868, 880.77417, 1126.7097, 1372.6451, 1618.5807, 1864.5161, 2110.4517, 2356.3872, 2602.3225, 2848.2581, 3094.1936, 3340.1292, 3586.0645, 3832, 4077.9355, 4323.8711, 4569.8066, 4815.7417, 5061.6772, 5307.6128, 5553.5483, 5799.4839, 6045.4194, 6291.355, 6537.2905, 6783.2256, 7029.1611, 7275.0967, 7521.0322
@type int
@label 
@class other
@N_unique .
@N 1562
 
_@NOTES
 
=====b_meeting_d=====

b_meeting_d:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2897
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2897
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}b_meeting_d {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type float
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====companyname=====
@example0 
@type str36
@label Company Name
@class string
@N_unique 128
@N 1192
 
_@NOTES
 
=====v17=====

v17:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2897
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2897
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v17 {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====v18=====

v18:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2897
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2897
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v18 {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====v19=====

v19:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2897
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2897
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v19 {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====v20=====

v20:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2897
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2897
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v20 {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====v21=====

v21:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2897
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2897
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v21 {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====sumoutblock=====

sumoutblock:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  616       616          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2138       219       1919
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2754       835       1919
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing        {res}  143
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  98.7                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}sumoutblock {c |}{res}      2754    18.47532    17.87253          0       98.7
@mean    18.475
@sd    17.873
@min     0.000
@max    98.700
@example0 30.1
@histh .07705105, .01726144, .02664265, .01663602, .03589878, .02126409, .02389083, .01250829, .01913768, .0190126, .01576044, .01350895, .00825547, .0036274, .00187624, .00687956, .0043779, .00300199, .00100066, .00187624, .00125083, .00487823, .00387757, .00062541, .00125083, .00312707
@histw 1.4514705, 4.3544116, 7.2573528, 10.160294, 13.063235, 15.966176, 18.869118, 21.772058, 24.674999, 27.57794, 30.480881, 33.383823, 36.286762, 39.189705, 42.092648, 44.995586, 47.898529, 50.801468, 53.704411, 56.607349, 59.510292, 62.413235, 65.316177, 74.024994, 79.830879, 97.248528
@type float
@label 
@class other
@N_unique .
@N 2754
 
_@NOTES
 
=====finst=====

finst:                                          {txt}Number of Observations
{hline 8}                                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2598      2598          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  299       299          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}finst {c |}{res}      2897    .1032102    .3042858          0          1
@mean     0.103
@sd     0.304
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2598, 299
@type byte
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====yeara=====

yeara:                                          {txt}Number of Observations
{hline 8}                                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2897      2897          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1996               2002                      2897
   (7 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}yeara {c |}{res}      2897    1999.873    1.752391       1996       2002
@mean  1999.873
@sd     1.752
@min      1996
@max      2002
@values 1996, 1997, 1998, 1999, 2000, 2001, 2002
@names "1996", "1997", "1998", "1999", "2000", "2001", "2002"
@freq 52, 321, 311, 517, 512, 426, 758
@type int
@label 
@class category
@N_unique 7
@N 2897
 
_@NOTES
 
=====year_reported=====

year_reported:  Year_Reported                   {txt}Number of Observations
{hline 29}               {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2897      2897          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1996               2002                      2897
   (7 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
year_repor~d {c |}{res}      2897     1999.87    1.749501       1996       2002
@mean  1999.870
@sd     1.750
@min      1996
@max      2002
@values 1996, 1997, 1998, 1999, 2000, 2001, 2002
@names "1996", "1997", "1998", "1999", "2000", "2001", "2002"
@freq 52, 321, 311, 517, 512, 435, 749
@type int
@label Year_Reported
@class category
@N_unique 7
@N 2897
 
_@NOTES
 
=====total_assets=====

total_assets:  Total_Assets                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2897       861       2036
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897       861       2036
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}17.5            1097190                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
total_assets {c |}{res}      2897    33434.08    112659.3       17.5    1097190
@mean 33434.085
@sd  1.13e+05
@min    17.500
@max  1.10e+06
@example0 3892.71
@histh .00002521, 3.370e-06, 5.883e-07, 3.102e-07, 1.177e-07, 4.279e-07, 3.637e-07, 1.391e-07, 1.177e-07, 1.605e-07, 1.818e-07
@histw 16152.39, 48422.168, 80691.945, 112961.73, 145231.5, 242040.84, 274310.63, 371119.97, 435659.53, 758357.31, 1081055.1
@type float
@label Total_Assets
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====GNPDEF=====

GNPDEF:  (mean) GNPDEF                          {txt}Number of Observations
{hline 22}                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#           #         {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#           #         {txt}Positive       {res} 2897         -       2897
{txt}{c |}      {res}#           #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #       #         {txt}Total          {res} 2897         -       2897
{txt}{c |}  {res}#   #   #   .   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}93.85725        104.176                      2897
   (7 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}GNPDEF {c |}{res}      2897    99.43409    3.312528   93.85725    104.176
@mean    99.434
@sd     3.313
@min    93.857
@max   104.176
@values 93.85725, 95.41575, 96.47025, 97.863, 99.9965, 102.3955, 104.176
@names "93.85724999999999", "95.41575", "96.47025000000001", "97.863", "99.9965", "102.3955", "104.176"
@freq 163, 340, 358, 576, 447, 457, 556
@type double
@label (mean) GNPDEF
@class category
@N_unique 7
@N 2897
 
_@NOTES
 
=====totassets=====

totassets:  Total Assets                        {txt}Number of Observations
{hline 24}                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2897        28       2869
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897        28       2869
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}17.0906         1053208                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}totassets {c |}{res}      2897    33036.99    109641.8    17.0906    1053208
@mean 33036.988
@sd  1.10e+05
@min    17.091
@max  1.05e+06
@example0 4035.1404
@histh .00002608, 3.700e-06, 4.457e-07, 4.903e-07, 1.226e-07, 1.449e-07, 5.349e-07, 1.449e-07, 1.449e-07, 1.226e-07, 1.672e-07, 1.894e-07
@histw 15505.192, 46481.395, 77457.602, 108433.8, 139410, 232338.61, 263314.81, 294291.03, 387219.63, 418195.84, 727957.88, 1037719.9
@type float
@label Total Assets
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====cara=====

cara:  Cumulative Abnormal Returns              {txt}Number of Observations
{hline 34}          {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative       {res} 1747         -       1747
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 1007         -       1007
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 2754         -       2754
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing        {res}  143
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}-2.291043      3.981041                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}cara {c |}{res}      2754   -.2045106     .796088  -2.291043   3.981041
@mean    -0.205
@sd     0.796
@min    -2.291
@max     3.981
@example0 -.38469008
@histh .03346201, .1141645, .07873414, .08070249, .17912017, .16337334, .29328468, .49012002, .53539217, .58656937, .66727185, .64168328, .41335425, .38579729, .22636065, .19289865, .03739872, .04920884, .08267085, .03346201, .02755695, .01771518, .01377848, .04133542, .00787341, .01574683, .01181012
@histw -2.1988068, -2.0143337, -1.8298607, -1.4609146, -1.2764416, -1.0919684, -.90749538, -.72302234, -.53854924, -.35407621, -.16960315, .01486992, .19934298, .38381603, .5682891, .7527622, .93723524, 1.1217083, 1.3061813, 1.4906545, 1.6751275, 1.8596005, 2.2285466, 2.4130197, 2.5974927, 2.966439, 3.8888042
@type double
@label Cumulative Abnormal Returns
@class other
@N_unique .
@N 2754
 
_@NOTES
 
=====defendant_PRI=====

defendant_PRI:  Named as Defendant (0/1)        {txt}Number of Observations
{hline 41}   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2200      2200          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  671       671          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2871      2871          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}   26
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
defendant_~I {c |}{res}      2871    .2337165    .4232676          0          1
@mean     0.234
@sd     0.423
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2200, 671
@type float
@label Named as Defendant (0/1) 
@class dummy
@N_unique 2
@N 2871
 
_@NOTES
 
=====ins_trade_PRI=====

ins_trade_PRI:  Insider trading alleged         {txt}Number of Observations
{hline 39}     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1985      1985          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  211       211          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2196      2196          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  701
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
ins_trade_~I {c |}{res}      2196    .0960838    .2947732          0          1
@mean     0.096
@sd     0.295
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1985, 211
@type float
@label Insider trading alleged
@class dummy
@N_unique 2
@N 2196
 
_@NOTES
 
=====defendant_ANY=====

defendant_ANY:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2168      2168          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  703       703          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2871      2871          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}   26
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
defendant_~Y {c |}{res}      2871    .2448624    .4300805          0          1
@mean     0.245
@sd     0.430
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2168, 703
@type float
@label 
@class dummy
@N_unique 2
@N 2871
 
_@NOTES
 
=====ins_trade_ANY=====

ins_trade_ANY:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1983      1983          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  218       218          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2201      2201          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  696
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
ins_trade_~Y {c |}{res}      2201    .0990459    .2987915          0          1
@mean     0.099
@sd     0.299
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1983, 218
@type float
@label 
@class dummy
@N_unique 2
@N 2201
 
_@NOTES
 
=====_merge=====

_merge:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2897      2897          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3                                            2897
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}_merge {c |}{res}      2897           3           0          3          3
@mean         3
@sd     0.000
@min         3
@max         3
@values 3
@type byte
@label 
@class constant
@N_unique 1
@N 2897
 
_@NOTES
 
=====last=====

last:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2598      2598          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  299       299          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}last {c |}{res}      2897    .1032102    .3042858          0          1
@mean     0.103
@sd     0.304
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2598, 299
@type float
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====length=====

length:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero           {res}  431       431          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2466      2466          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}                  {res}#         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     4                      2897
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}length {c |}{res}      2897    2.692095    1.537217          0          4
@mean     2.692
@sd     1.537
@min     0.000
@max     4.000
@values 0, 1, 2, 3, 4
@names "0", "1", "2", "3", "4"
@freq 431, 357, 348, 298, 1463
@type float
@label 
@class category
@N_unique 5
@N 2897
 
_@NOTES
 
=====survived=====

survived:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1245      1245          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1652      1652          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}survived {c |}{res}      2897    .5702451    .4951265          0          1
@mean     0.570
@sd     0.495
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1245, 1652
@type float
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====restate=====

restate:  Restatement of financials (0/1)       {txt}Number of Observations
{hline 42}  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2274      2274          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  623       623          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}restate {c |}{res}      2897    .2150501     .410928          0          1
@mean     0.215
@sd     0.411
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2274, 623
@type byte
@label Restatement of financials (0/1) 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====gaap=====

gaap:  Violation of GAAP                        {txt}Number of Observations
{hline 24}                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1616      1616          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1281      1281          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}gaap {c |}{res}      2897    .4421816    .4967315          0          1
@mean     0.442
@sd     0.497
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1616, 1281
@type byte
@label Violation of GAAP
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====pgaap=====

pgaap:  Other GAAP (0/1)                        {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2176      2176          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  721       721          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}pgaap {c |}{res}      2897    .2488781    .4324377          0          1
@mean     0.249
@sd     0.432
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2176, 721
@type float
@label Other GAAP (0/1) 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====insider1=====

insider1:  Director Status                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1832      1832          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1065      1065          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

      {txt}insider1 is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}insider1 {c |}{res}      2897    .3676217    .4822409          0          1
@mean     0.368
@sd     0.482
@min         0
@max         1
@values 0, 1
@names "Outside Directors", "Inside Directors"
@freq 1832, 1065
@type byte
@label Director Status
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====insider2=====

insider2:  Director Status                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2144      2144          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  753       753          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

      {txt}insider2 is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}insider2 {c |}{res}      2897    .2599241    .4386684          0          1
@mean     0.260
@sd     0.439
@min         0
@max         1
@values 0, 1
@names "Outside Directors", "Inside Directors"
@freq 2144, 753
@type byte
@label Director Status
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====insider=====

insider:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1832      1832          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1065      1065          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}insider {c |}{res}      2897    .3676217    .4822409          0          1
@mean     0.368
@sd     0.482
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1832, 1065
@type byte
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====employ=====

employ:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2590      2590          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  307       307          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}employ {c |}{res}      2897    .1059717    .3078545          0          1
@mean     0.106
@sd     0.308
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2590, 307
@type byte
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====othins=====

othins:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2431      2431          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  466       466          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}othins {c |}{res}      2897    .1608561    .3674616          0          1
@mean     0.161
@sd     0.367
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2431, 466
@type byte
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====iota=====

iota:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2897      2897          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                                            2897
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}iota {c |}{res}      2897           1           0          1          1
@mean         1
@sd     0.000
@min         1
@max         1
@values 1
@type byte
@label 
@class constant
@N_unique 1
@N 2897
 
_@NOTES
 
=====boardseats=====

boardseats:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2897      2897          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}4                    27                      2897
  (18 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}boardseats {c |}{res}      2897    10.73076    3.597593          4         27
@mean    10.731
@sd     3.598
@min     4.000
@max    27.000
@values 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 21, 22, 27
@names "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "21", "22", "27"
@freq 16, 40, 156, 266, 368, 423, 290, 341, 192, 182, 182, 255, 64, 34, 18, 21, 22, 27
@type float
@label 
@class category
@N_unique 18
@N 2897
 
_@NOTES
 
=====insideseats=====

insideseats:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 2897      2897          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    11                      2897
  (11 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}insideseats {c |}{res}      2897    3.857439    2.197289          1         11
@mean     3.857
@sd     2.197
@min     1.000
@max    11.000
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"
@freq 364, 559, 511, 537, 289, 306, 130, 73, 59, 53, 16
@type float
@label 
@class category
@N_unique 11
@N 2897
 
_@NOTES
 
=====outsideseats=====

outsideseats:                                   {txt}Number of Observations
{hline 15}                             {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2897      2897          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    19                      2897
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
outsideseats {c |}{res}      2897    6.873317    3.185262          1         19
@mean     6.873
@sd     3.185
@min     1.000
@max    19.000
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 19
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "19"
@freq 31, 161, 191, 297, 348, 450, 309, 304, 280, 175, 146, 71, 36, 33, 16, 22, 27
@type float
@label 
@class category
@N_unique 17
@N 2897
 
_@NOTES
 
=====outfrac=====

outfrac:  Proportion of Outside Directors       {txt}Number of Observations
{hline 41}   {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#   #         {txt}Positive       {res} 2897         -       2897
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #   #         {txt}Total          {res} 2897         -       2897
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0909091          .9375                      2897
  (58 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}outfrac {c |}{res}      2897    .6323783    .1837749   .0909091      .9375
@mean     0.632
@sd     0.184
@min     0.091
@max     0.938
@example0 .22222222
@histh .15249287, .08317792, .27725974, .42975262, .38816366, .67928636, .54065651, 1.2892578, .45747858, .44361559, .83177924, 1.3585727, 1.3862988, .20794481, 2.4676118, .18021883, 1.9546812, 1.6496955, 1.5249286, 2.7032826, 1.0535871, 2.8280494, 1.4694767, 2.9805422, 1.8299143, 1.9130923, 1.6635585, 1.9824072, 1.2476689, 1.2060798, 2.0378592, .9426831
@histw .10335896, .17805816, .20295788, .22785762, .25275734, .27765709, .30255681, .32745656, .35235628, .37725601, .40215576, .42705548, .45195523, .47685495, .5017547, .52665442, .55155414, .57645386, .60135359, .62625337, .65115309, .67605281, .70095253, .72585225, .75075203, .77565175, .80055147, .8254512, .85035092, .8752507, .90015042, .92505014
@type float
@label Proportion of Outside Directors
@class other
@N_unique 58
@N 2897
 
_@NOTES
 
=====nceo=====

nceo:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}   63        63          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2834      2834          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}.   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}nceo {c |}{res}      2897    .9782534    .1458803          0          1
@mean     0.978
@sd     0.146
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 63, 2834
@type float
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====audit=====

audit:  Member Audit Committee (0/1)            {txt}Number of Observations
{hline 37}       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1808      1808          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1055      1055          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2863      2863          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}   34
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}audit {c |}{res}      2863    .3684946    .4824807          0          1
@mean     0.368
@sd     0.482
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1808, 1055
@type float
@label Member Audit Committee (0/1) 
@class dummy
@N_unique 2
@N 2863
 
_@NOTES
 
=====audithard=====

audithard:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2379      2379          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  484       484          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2863      2863          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}   34
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}audithard {c |}{res}      2863    .1690534    .3748646          0          1
@mean     0.169
@sd     0.375
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2379, 484
@type float
@label 
@class dummy
@N_unique 2
@N 2863
 
_@NOTES
 
=====entrench=====

entrench:  Log(Board Tenure)                    {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero           {res}  140       140          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 2757         -       2757
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 2897       140       2757
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0              3.970292                      2897
  (45 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}entrench {c |}{res}      2897     1.78748    .8203995          0   3.970292
@mean     1.787
@sd     0.820
@min     0.000
@max     3.970
@example0 2.9957323
@histh .41384339, .95479584, .86907113, .85429102, .71535784, .67101753, .50548017, .43157953, .53504038, .38723919, .29264641, .53504038, .15371326, .28969038, .29264641, .15075724, .16258134, .13006507, .05616446, .08868073, .04138434, .01478012, .0118241, .00591205
@histw .05838665, .6422531, 1.1093463, 1.3428929, 1.5764394, 1.809986, 1.9267592, 2.0435326, 2.160306, 2.2770791, 2.3938525, 2.5106258, 2.627399, 2.7441723, 2.8609457, 2.9777188, 3.0944922, 3.2112656, 3.3280387, 3.4448121, 3.5615854, 3.6783586, 3.7951319, 3.9119053
@type float
@label Log(Board Tenure)
@class other
@N_unique 45
@N 2897
 
_@NOTES
 
=====tenure=====

tenure:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2897      2857         40
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2857         40
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    53                      2897
  (45 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}tenure {c |}{res}      2897    8.183409    6.770097          1         53
@mean     8.183
@sd     6.770
@min     1.000
@max    53.000
@example0 20
@histh .10449802, .13158174, .05461884, .08982767, .04197977, .06138977, .02234407, .04085128, .01173628, .02211837, .01241337, .01625023, .00519105, .00835081, .00406256, .00789942, .00203128, .00315977, .00451395, .00135419, .00203128, .00067709, .00180558, .00067709, .00090279, .0002257, .0002257, .0002257, .0004514, .0002257, .0002257
@histw 1.7647059, 3.2941177, 4.8235292, 6.352941, 7.8823528, 9.4117651, 10.941176, 12.470589, 14, 15.529411, 17.058823, 18.588236, 20.117647, 21.647058, 23.17647, 24.705883, 26.235294, 27.764706, 29.294117, 30.82353, 32.35294, 33.882355, 35.411766, 36.941177, 38.470589, 40, 41.529411, 43.058823, 46.117645, 49.176472, 52.235294
@type float
@label 
@class other
@N_unique 45
@N 2897
 
_@NOTES
 
=====dismissed=====

dismissed:  Suit dismissed                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1797      1797          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1100      1100          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}dismissed {c |}{res}      2897    .3797031    .4853967          0          1
@mean     0.380
@sd     0.485
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1797, 1100
@type float
@label Suit dismissed
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====ongoing=====

ongoing:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2566      2566          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  331       331          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}ongoing {c |}{res}      2897    .1142561     .318177          0          1
@mean     0.114
@sd     0.318
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2566, 331
@type float
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====csettled=====

csettled:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero           {res} 1431      1431          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1466      1466          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

      {txt}csettled is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}csettled {c |}{res}      2897    .5060407    .5000498          0          1
@mean     0.506
@sd     0.500
@min     0.000
@max     1.000
@values 0, 1
@names "N", "Y"
@freq 1431, 1466
@type float
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====notdis=====

notdis:  Suit Settled/Ongoing                   {txt}Number of Observations
{hline 29}               {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1100      1100          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 1797      1797          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

      {txt}notdis is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}notdis {c |}{res}      2897    .6202969    .4853967          0          1
@mean     0.620
@sd     0.485
@min     0.000
@max     1.000
@values 0, 1
@names "N", "Y"
@freq 1100, 1797
@type float
@label Suit Settled/Ongoing
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====settledhard=====

settledhard:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2103      2103          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  794       794          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

      {txt}settledhard is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}settledhard {c |}{res}      2897    .2740766    .4461248          0          1
@mean     0.274
@sd     0.446
@min         0
@max         1
@values 0, 1
@names "N", "Y"
@freq 2103, 794
@type byte
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====dismissedhard=====

dismissedhard:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2489      2489          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  408       408          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

      {txt}dismissedhard is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
dismissedh~d {c |}{res}      2897    .1408353    .3479117          0          1
@mean     0.141
@sd     0.348
@min         0
@max         1
@values 0, 1
@names "N", "Y"
@freq 2489, 408
@type byte
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====settledres=====

settledres:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2450      2450          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  447       447          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

      {txt}settledres is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}settledres {c |}{res}      2897    .1542975    .3612961          0          1
@mean     0.154
@sd     0.361
@min         0
@max         1
@values 0, 1
@names "N", "Y"
@freq 2450, 447
@type byte
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====dismissedres=====

dismissedres:                                   {txt}Number of Observations
{hline 15}                             {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2761      2761          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  136       136          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

      {txt}dismissedres is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
dismissedres {c |}{res}      2897    .0469451    .2115578          0          1
@mean     0.047
@sd     0.212
@min         0
@max         1
@values 0, 1
@names "N", "Y"
@freq 2761, 136
@type byte
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====settledgaap=====

settledgaap:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2135      2135          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  762       762          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

      {txt}settledgaap is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}settledgaap {c |}{res}      2897    .2630307     .440355          0          1
@mean     0.263
@sd     0.440
@min         0
@max         1
@values 0, 1
@names "N", "Y"
@freq 2135, 762
@type byte
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====dismissedgaap=====

dismissedgaap:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2511      2511          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  386       386          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

      {txt}dismissedgaap is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
dismissedg~p {c |}{res}      2897    .1332413     .339894          0          1
@mean     0.133
@sd     0.340
@min         0
@max         1
@values 0, 1
@names "N", "Y"
@freq 2511, 386
@type byte
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====filing_y=====

filing_y:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2897      2897          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1996               2002                      2897
   (7 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}filing_y {c |}{res}      2897    1999.879    1.747974       1996       2002
@mean  1999.879
@sd     1.748
@min      1996
@max      2002
@values 1996, 1997, 1998, 1999, 2000, 2001, 2002
@names "1996", "1997", "1998", "1999", "2000", "2001", "2002"
@freq 52, 313, 319, 508, 521, 426, 758
@type int
@label 
@class category
@N_unique 7
@N 2897
 
_@NOTES
 
=====FY1997=====

FY1997:  filing_y==  1997.0000                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2584      2584          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  313       313          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}FY1997 {c |}{res}      2897    .1080428    .3104881          0          1
@mean     0.108
@sd     0.310
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2584, 313
@type byte
@label filing_y==  1997.0000
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====FY1998=====

FY1998:  filing_y==  1998.0000                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2578      2578          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  319       319          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}FY1998 {c |}{res}      2897    .1101139    .3130857          0          1
@mean     0.110
@sd     0.313
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2578, 319
@type byte
@label filing_y==  1998.0000
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====FY1999=====

FY1999:  filing_y==  1999.0000                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2389      2389          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  508       508          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}FY1999 {c |}{res}      2897    .1753538    .3803351          0          1
@mean     0.175
@sd     0.380
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2389, 508
@type byte
@label filing_y==  1999.0000
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====FY2000=====

FY2000:  filing_y==  2000.0000                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2376      2376          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  521       521          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}FY2000 {c |}{res}      2897    .1798412    .3841214          0          1
@mean     0.180
@sd     0.384
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2376, 521
@type byte
@label filing_y==  2000.0000
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====FY2001=====

FY2001:  filing_y==  2001.0000                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2471      2471          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  426       426          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}FY2001 {c |}{res}      2897    .1470487    .3542156          0          1
@mean     0.147
@sd     0.354
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2471, 426
@type byte
@label filing_y==  2001.0000
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====FY2002=====

FY2002:  filing_y==  2002.0000                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2139      2139          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  758       758          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}FY2002 {c |}{res}      2897      .26165    .4396089          0          1
@mean     0.262
@sd     0.440
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2139, 758
@type byte
@label filing_y==  2002.0000
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====pcdamages=====

pcdamages:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1804      1804          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1093         -       1093
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      1804       1093
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0              3571.428                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}pcdamages {c |}{res}      2897    14.67156    209.5998          0   3571.428
@mean    14.672
@sd   209.600
@min     0.000
@max  3571.428
@example0 0
@histh .00946085, .00002629, .00003286
@histw 52.521008, 157.56302, 3518.9075
@type float
@label 
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====damages=====

damages:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2653      2653          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  244       244          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}damages {c |}{res}      2897    .0842251     .277773          0          1
@mean     0.084
@sd     0.278
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2653, 244
@type float
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====notdis_inst=====

notdis_inst:  Settled/Ongoing x Inst.Holdin     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1130      1130          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1760        79       1681
{txt}{c |}  {res}#           #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#       #   #             {txt}Total          {res} 2890      1209       1681
{txt}{c |}  {res}#   .   #   #   #         {txt}Missing        {res}    7
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 98.09                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}notdis_inst {c |}{res}      2890    37.26136    33.24774          0      98.09
@mean    37.261
@sd    33.248
@min     0.000
@max    98.090
@example0 0
@histh .1355298, .00275857, .00215888, .00239876, .00299845, .00455764, .00107944, .00383801, .00155919, .00491745, .00935515, .0044377, .0079159, .00911528, .01307323, .01727105, .01211373, .01271341, .01175391, .01451248, .00959503, .01043459, .00683646, .00875547, .01523211, .00875547, .00359814, .0044377, .00275857, .00215888
@histw 1.4425, 4.3274999, 15.867499, 21.637499, 24.522499, 27.407499, 30.2925, 33.177498, 36.0625, 38.947498, 41.832497, 44.717499, 47.602497, 50.487499, 53.372498, 56.2575, 59.142498, 62.027496, 64.912498, 67.797501, 70.682495, 73.567497, 76.452499, 79.337494, 82.222496, 85.107498, 87.9925, 90.877495, 93.762497, 96.647499
@type float
@label Settled/Ongoing x Inst.Holdings 
@class other
@N_unique .
@N 2890
 
_@NOTES
 
=====notdis_block=====

notdis_block:  Settled/Ongoing x Blockholdi     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1652      1652          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1102       104        998
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2754      1756        998
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing        {res}  143
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  66.3                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
notdis_block {c |}{res}      2754    8.275113    13.01124          0       66.3
@mean     8.275
@sd    13.011
@min     0.000
@max    66.300
@example0 0
@histh .30761781, .01359328, .01899335, .00931047, .01210361, .02011061, .01917956, .01098635, .01247603, .00744837, .00465523, .01228982, .01173119, .00763458, .00744837, .00670354, .00372419, .00502765, .00093105, .00242072, .00279314, .00316556, .00111726, .00130347, .00502765, .00148967, .0020483, .00148967
@histw .97500002, 4.875, 6.8250003, 8.7750006, 10.725, 12.675, 14.625001, 16.575001, 18.525002, 20.475, 22.425001, 24.375002, 26.325001, 28.275002, 30.225002, 32.175003, 34.125, 36.075001, 38.025002, 39.975002, 41.925003, 43.875004, 45.825001, 47.775002, 49.725002, 53.625004, 61.425003, 65.325005
@type float
@label Settled/Ongoing x Blockholdings 
@class other
@N_unique .
@N 2754
 
_@NOTES
 
=====notdis_outfrac=====

notdis_outfrac:  Settled/Ongoing x Prop. OD     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1100      1100          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1797         -       1797
{txt}{c |}  {res}#           #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#       #   #   #         {txt}Total          {res} 2897      1100       1797
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 .9375                      2897
  (50 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
notdis_out~c {c |}{res}      2897    .3876424     .337996          0      .9375
@mean     0.388
@sd     0.338
@min     0.000
@max     0.938
@example0 0
@histh 13.770567, .07511219, .25037396, .27541134, .35052353, .65097225, .36304224, .30044875, .61341619, .56334138, .67600965, .97645843, 1.5523185, .57586008, 2.0155103, .8763088, .66349095, .6259349, 1.6524681, .81371534, 1.3520193, 1.6900241, .56334138, 1.7025429, .52578527, .75112188, 1.3770567, .66349095
@histw .01378676, .17922795, .20680147, .234375, .26194853, .28952205, .31709558, .3446691, .37224266, .39981619, .42738971, .45496324, .51011032, .53768384, .56525737, .5928309, .62040442, .64797795, .67555147, .703125, .73069853, .75827205, .78584558, .8134191, .84099263, .86856616, .89613968, .92371321
@type float
@label Settled/Ongoing x Prop. OD
@class other
@N_unique 50
@N 2897
 
_@NOTES
 
=====notdis_audit=====

notdis_audit:  Settled/Ongoing x Audit Comm     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2217      2217          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  646       646          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2863      2863          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}   34
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
notdis_audit {c |}{res}      2863    .2256374    .4180744          0          1
@mean     0.226
@sd     0.418
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2217, 646
@type float
@label Settled/Ongoing x Audit Comm. (0/1) 
@class dummy
@N_unique 2
@N 2863
 
_@NOTES
 
=====notdis_defendant_PRI=====

notdis_defendant_PRI:  Settled/Ongoing x Na     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2416      2416          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  455       455          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2871      2871          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}   26
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
notdis_def~I {c |}{res}      2871    .1584814    .3652554          0          1
@mean     0.158
@sd     0.365
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2416, 455
@type float
@label Settled/Ongoing x Named Def. (0/1) 
@class dummy
@N_unique 2
@N 2871
 
_@NOTES
 
=====age_61_65=====

age_61_65:  Age 61-65 (0/1)                     {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2313      2313          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  584       584          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}age_61_65 {c |}{res}      2897    .2015878    .4012552          0          1
@mean     0.202
@sd     0.401
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2313, 584
@type float
@label Age 61-65 (0/1) 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====age_66_70=====

age_66_70:  Age 66-70 (0/1)                     {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2505      2505          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  392       392          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}age_66_70 {c |}{res}      2897    .1353124     .342116          0          1
@mean     0.135
@sd     0.342
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2505, 392
@type float
@label Age 66-70 (0/1) 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====age_gt_70=====

age_gt_70:  Age $>$70 (0/1)                     {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2695      2695          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  202       202          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}age_gt_70 {c |}{res}      2897    .0697273    .2547308          0          1
@mean     0.070
@sd     0.255
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2695, 202
@type float
@label Age $>$70 (0/1) 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====departed=====

departed:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1652      1652          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1245      1245          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}departed {c |}{res}      2897    .4297549    .4951265          0          1
@mean     0.430
@sd     0.495
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1652, 1245
@type byte
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====ceochair=====

ceochair:  CEO and Chairman (0/1)               {txt}Number of Observations
{hline 34}          {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2698      2698          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  199       199          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}ceochair {c |}{res}      2897    .0686918    .2529729          0          1
@mean     0.069
@sd     0.253
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2698, 199
@type float
@label CEO and Chairman (0/1) 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====ltotass=====

ltotass:  Log(Total Assets)                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Positive       {res} 2897         -       2897
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 2897         -       2897
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2.838528       13.86735                      2897
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}ltotass {c |}{res}      2897    8.441418    2.005997   2.838528   13.86735
@mean     8.441
@sd     2.006
@min     2.839
@max    13.867
@example0 8.3027964
@histh .00744902, .00532073, .01489804, .03724511, .02234707, .03724511, .03298853, .09045242, .12769753, .09151656, .18622556, .15323703, .22453482, .17026338, .2192141, .13940313, .16494264, .15536533, .11173534, .18409728, .10960705, .18835385, .18090484, .1479163, .07129779, .04256584, .01596219, .01170561, .07874681, .0138339, .01170561, .01596219, .01809048
@histw 3.0007169, 3.6494713, 3.9738483, 4.2982254, 4.6226029, 4.94698, 5.2713571, 5.5957341, 5.9201112, 6.2444887, 6.5688658, 6.8932428, 7.2176199, 7.541997, 7.866374, 8.1907511, 8.5151281, 8.8395061, 9.1638832, 9.4882603, 9.8126373, 10.137014, 10.461391, 10.785769, 11.110146, 11.434523, 11.7589, 12.083277, 12.407655, 12.732032, 13.056409, 13.380786, 13.705163
@type float
@label Log(Total Assets)
@class other
@N_unique .
@N 2897
 
_@NOTES
 
=====t5s=====

t5s:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1161      1161          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1736      1736          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}t5s {c |}{res}      2897    .5992406    .4901369          0          1
@mean     0.599
@sd     0.490
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1161, 1736
@type byte
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====t6s=====

t6s:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1913      1913          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  984       984          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}t6s {c |}{res}      2897    .3396617    .4736761          0          1
@mean     0.340
@sd     0.474
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1913, 984
@type byte
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
=====t56s=====

t56s:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  177       177          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2720      2720          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 2897      2897          -
{txt}{c |}  {res}.   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2897
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}t56s {c |}{res}      2897    .9389023    .2395508          0          1
@mean     0.939
@sd     0.240
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 177, 2720
@type byte
@label 
@class dummy
@N_unique 2
@N 2897
 
_@NOTES
 
{com}. 
. // noi profiler report
. // profiler off
. {c )-}
{txt}
{com}. 
. exit, clear STATA
