{smcl}
{txt}{sf}{ul off}

{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. cap noi {c -(}
. 
. use  "/Users/mas/Dropbox/Stata_conference_2015/itsp/capm.dta"
{txt}(rolling: qreg)
{com}. 
. describe, short

{txt}Contains data from {res}/Users/mas/Dropbox/Stata_conference_2015/itsp/capm.dta
{txt}  obs:{res}           626                          rolling: qreg
{txt} vars:{res}             6                          30 Jan 2009 15:07
{txt} size:{res}        15,024                          
{txt}Sorted by:  
{com}. 
. local N = r(N)
. local variables = r(k)
. 
. di "@N `N'"
{res}@N 626
{com}. di "@variables `variables'"
{res}@variables 6
{com}. 
. datasignature
  {res}626:6(90739):2912528390:3125761854
{com}. local datasig = "`r(datasignature)'"
. 
. di "@datasignature `datasig'"
{res}@datasignature 626:6(90739):2912528390:3125761854
{com}. 
. cap noi xtset
{err}panel variable not set; use {bf:xtset} {it:varname} ...
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
.     di "@panelvar `r(panelvar)'"
. {c )-}
. 
. notes _dta
{res}{com}. 
. qui {c -(}
. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====start=====

{res}start:                                          {txt}Number of Observations
{hline 8}                                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res}  626       626          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res}  626       626          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}15707             16332                       626
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}start {c |}{res}       626     16019.5    180.8549      15707      16332
@mean 16019.500
@sd   180.855
@min 15707.000
@max 16332.000
@example0 15707
@histh .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00166134
@histw 15719.5, 15744.5, 15769.5, 15794.5, 15819.5, 15844.5, 15869.5, 15894.5, 15919.5, 15944.5, 15969.5, 15994.5, 16019.5, 16044.5, 16069.5, 16094.5, 16119.5, 16144.5, 16169.5, 16194.5, 16219.5, 16244.5, 16269.5, 16294.5, 16319.5
@type float
@label 
@class other
@N_unique .
@N 626
 
_@NOTES
 
=====end=====

end:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res}  626       626          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res}  626       626          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}15796             16421                       626
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}end {c |}{res}       626     16108.5    180.8549      15796      16421
@mean 16108.500
@sd   180.855
@min 15796.000
@max 16421.000
@example0 15796
@histh .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00159744, .00166134
@histw 15808.5, 15833.5, 15858.5, 15883.5, 15908.5, 15933.5, 15958.5, 15983.5, 16008.5, 16033.5, 16058.5, 16083.5, 16108.5, 16133.5, 16158.5, 16183.5, 16208.5, 16233.5, 16258.5, 16283.5, 16308.5, 16333.5, 16358.5, 16383.5, 16408.5
@type float
@label 
@class other
@N_unique .
@N 626
 
_@NOTES
 
=====_b_spx=====

_b_spx:  _b[spx]                                {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #   #             {txt}Positive       {res}  626         -        626
{txt}{c |}      {res}#   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #   #         {txt}Total          {res}  626         -        626
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.4921675       1.239734                       626
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}_b_spx {c |}{res}       626    .9407946    .1439306   .4921675   1.239734
@mean     0.941
@sd     0.144
@min     0.492
@max     1.240
@example0 1.0664009
@histh .10684299, .05342149, .32052895, 1.6560663, 2.7244961, 2.8313391, 1.2821158, 1.1218513, .7479009, 2.5108101, 2.7779176, 4.0600333, 1.0684298, 2.1902812, 2.6176531, 1.0684298, 1.3355373, 2.1902812, 1.9765953, .64105791, .16026448
@histw .50711882, .53702146, .6865347, .71643734, .74634004, .77624267, .80614531, .83604795, .86595058, .89585322, .92575592, .95565856, .98556119, 1.0154638, 1.0453665, 1.0752691, 1.1051718, 1.1350744, 1.1649771, 1.1948798, 1.2247823
@type float
@label _b[spx]
@class other
@N_unique .
@N 626
 
_@NOTES
 
=====_b_cons=====

_b_cons:  _b[_cons]                             {txt}Number of Observations
{hline 19}                         {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative       {res}  487         -        487
{txt}{c |}      {res}#   #                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res}  139         -        139
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res}  626         -        626
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}-.3085864      .2001785                       626
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}_b_cons {c |}{res}       626   -.0626253    .0974643  -.3085864   .2001785
@mean    -0.063
@sd     0.097
@min    -0.309
@max     0.200
@example0 .19616409
@histh .54947323, .54947323, 1.0989465, .31398469, .62796938, 2.4333813, 4.003305, 4.9452586, 5.1022511, 4.1602969, 2.0409005, 1.3344349, 4.8667626, 6.2011976, .39248085, 2.0409005, 1.4129311, 1.9624043, 2.5903738, 1.0204502, .7849617, .31398469, .39248085
@histw -.29841113, -.27806053, -.23735933, -.21700872, -.19665812, -.17630753, -.15595692, -.13560633, -.11525573, -.09490513, -.07455453, -.05420393, -.03385334, -.01350274, .00684786, .02719846, .04754906, .06789966, .08825026, .10860085, .12895146, .16965266, .19000325
@type float
@label _b[_cons]
@class other
@N_unique .
@N 626
 
_@NOTES
 
=====_se_spx=====

_se_spx:  _se[spx]                              {txt}Number of Observations
{hline 18}                          {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res}  626         -        626
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res}  626         -        626
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0419169       .2305262                       626
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}_se_spx {c |}{res}       626    .1274586    .0341184   .0419169   .2305262
@mean     0.127
@sd     0.034
@min     0.042
@max     0.231
@example0 .08666839
@histh .21173987, 1.6939189, 1.0586994, 5.7169762, 5.7169762, 4.2347975, 2.3291385, 5.5052366, 7.1991553, 14.186571, 15.24527, 14.398311, 13.763091, 9.9517736, 8.2578545, 4.658277, 4.658277, 4.446537, 1.482179, 2.3291385, 1.0586994, 1.6939189, 1.0586994, .84695947, .84695947
@histw .04568912, .05323349, .06077786, .06832223, .0758666, .08341097, .09095535, .09849972, .10604408, .11358846, .12113283, .1286772, .13622157, .14376594, .15131031, .15885468, .16639906, .17394343, .1814878, .18903217, .19657654, .2041209, .21166529, .21920966, .22675402
@type float
@label _se[spx]
@class other
@N_unique .
@N 626
 
_@NOTES
 
=====_se_cons=====

_se_cons:  _se[_cons]                           {txt}Number of Observations
{hline 21}                       {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #   #             {txt}Positive       {res}  626         -        626
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res}  626         -        626
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.0310314       .1842848                       626
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}_se_cons {c |}{res}       626    .1070806    .0306563   .0310314   .1842848
@mean     0.107
@sd     0.031
@min     0.031
@max     0.184
@example0 .12465941
@histh .52117747, 1.8241212, 1.3029437, 2.8664763, 2.0847099, 2.6058874, 5.9935412, 10.684138, 15.114147, 15.895914, 14.071793, 16.156502, 9.9023724, 7.8176622, 5.2117748, 7.0358963, 11.987082, 7.8176622, 5.4723639, 5.9935412, 2.8664763, 2.0847099, 3.3876538, 3.6482425, .78176624
@histw .03409648, .04022662, .04635675, .05248689, .05861702, .06474715, .07087728, .07700742, .08313756, .08926769, .09539782, .10152796, .1076581, .11378823, .11991836, .12604851, .13217863, .13830876, .14443891, .15056904, .15669917, .16282931, .16895944, .17508957, .18121971
@type float
@label _se[_cons]
@class other
@N_unique .
@N 626
 
_@NOTES
 
{com}. 
. // noi profiler report
. // profiler off
. {c )-}
{txt}
{com}. 
. exit, clear STATA
