{smcl}
{txt}{sf}{ul off}

{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. cap noi {c -(}
. 
. use  "/Users/mas/Dropbox/Stata_conference_2015/itsp/litgov_estsample.dta"
. 
. describe, short

{txt}Contains data from {res}/Users/mas/Dropbox/Stata_conference_2015/itsp/litgov_estsample.dta
{txt}  obs:{res}         2,720                          
{txt} vars:{res}           217                          30 Jan 2009 14:53
{txt} size:{res}     3,563,200                          
{txt}Sorted by:  {res}case_code  year
{com}. 
. local N = r(N)
. local variables = r(k)
. 
. di "@N `N'"
{res}@N 2720
{com}. di "@variables `variables'"
{res}@variables 217
{com}. 
. datasignature
  {res}2720:217(78832):498146264:123934395
{com}. local datasig = "`r(datasignature)'"
. 
. di "@datasignature `datasig'"
{res}@datasignature 2720:217(78832):498146264:123934395
{com}. 
. cap noi xtset
{res}{txt}{col 8}panel variable:  {res}dir_co_id (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}yr, 0 to 0
{txt}{col 17}delta:  {res}1 unit
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
{res}@timevar yr
{com}.     di "@panelvar `r(panelvar)'"
{res}@panelvar dir_co_id
{com}. {c )-}
. 
. notes _dta
{res}{com}. 
. qui {c -(}
. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====action_type=====
@freq 2720
@values "PRI"
@example0 PRI
@type str4
@label 
@class constant
@N_unique 1
@N 2720
{res} 
_@NOTES
 
=====mtgdate=====
@example0 5/5/98
@type str8
@label 
@class string
@N_unique 198
@N 2720
 
_@NOTES
 
=====id=====

id:                                             {txt}Number of Observations
{hline 5}                                       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2720      2720          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2               1015340                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 10}id {c |}{res}      2720    13954.05    78525.52          2    1015340
@mean 13954.052
@sd 78525.521
@min         2
@max   1015340
@example0 8815
@histh .00003165, 1.724e-07, 1.465e-06, 1.970e-07
@histw 14933.441, 44796.324, 74659.203, 1000408.6
@type long
@label 
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====comnam=====
@example0 BOSTON SCIENTIFIC
@type str48
@label 
@class string
@N_unique 277
@N 2720
 
_@NOTES
 
=====ticker=====
@example0 BSX
@type str5
@label 
@class string
@N_unique 276
@N 2720
 
_@NOTES
 
=====case_code=====
@example0 BSX__01
@type str7
@label 
@class string
@N_unique 279
@N 2720
 
_@NOTES
 
=====year=====

year:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2720      2720          -
{txt}{c |}          {res}#       #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1996               2002                      2720
   (7 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}year {c |}{res}      2720    1999.559    1.812107       1996       2002
@mean  1999.559
@sd     1.812
@min  1996.000
@max  2002.000
@values 1996, 1997, 1998, 1999, 2000, 2001, 2002
@names "1996", "1997", "1998", "1999", "2000", "2001", "2002"
@freq 129, 319, 338, 562, 408, 416, 548
@type float
@label 
@class category
@N_unique 7
@N 2720
 
_@NOTES
 
=====beginningofclassperiod=====
@example0 1/1/1997
@type str10
@label Beginning of Class Period
@class string
@N_unique 239
@N 2720
 
_@NOTES
 
=====endofclassperiod=====
@example0 11/3/1998
@type str10
@label End of Class Period
@class string
@N_unique 251
@N 2720
 
_@NOTES
 
=====filingdate=====
@example0 11/4/1998
@type str10
@label Filing date
@class string
@N_unique 251
@N 2720
 
_@NOTES
 
=====filingwinoneyear=====
@freq 15, 2705
@values "No", "Yes"
@type str3
@label Filing w/in one year
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====restatement=====
@freq 2128, 592
@values "N", "Y"
@type str1
@label Restatement
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====gaapviolation=====
@freq 1484, 1236
@values "N", "Y"
@type str1
@label GAAP Violation
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====false_forecast=====
@freq 2041, 679
@values "N", "Y"
@type str1
@label False_Forecast
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====failure_to_disclose=====
@freq 1433, 1287
@values "N", "Y"
@type str1
@label Failure_to_Disclose
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====other=====
@freq 2336, 384
@values "N", "Y"
@type str1
@label Other
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====primary_source=====
@freq 2035, 604, 81
@values "COM", "ISS", "SET"
@type str3
@label Primary_Source
@class category
@N_unique 3
@N 2720
 
_@NOTES
 
=====drop_code=====
@example0 
@type str33
@label Drop_Code
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====status=====
@freq 300, 1037, 1383
@values "ACTIVE", "DISMISSED", "SETTLED"
@type str19
@label Status
@class category
@N_unique 3
@N 2720
 
_@NOTES
 
=====status_date=====
@freq 663, 628, 316, 44, 228, 223, 16, 602
@values "7/29/05", "7/30/05", "7/31/05", "8/18/05", "8/20/05", "8/21/05", "8/23/05", "8/3/06"
@type str7
@label Status_Date
@class category
@N_unique 8
@N 2720
 
_@NOTES
 
=====ssettle=====
@example0 
@type str13
@label Settlement_Amounts
@class string
@N_unique 119
@N 1383
 
_@NOTES
 
=====settlement_amounts=====

settlement_amounts:  Settlement_Amounts         {txt}Number of Observations
{hline 39}     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1383      1343         40
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1383      1343         40
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res} 1337
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}500000         6.16e+09                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
settlement~s {c |}{res}      1383    1.88e+08    7.26e+08     500000   6.16e+09
@mean  1.88e+08
@sd  7.26e+08
@min  5.00e+05
@max  6.16e+09
@example0 .
@histh 4.373e-09, 2.767e-10, 2.076e-10, 3.277e-11, 5.462e-11, 4.006e-11, 5.098e-11
@histw 99783816, 2.984e+08, 4.969e+08, 8.941e+08, 2.681e+09, 3.277e+09, 6.057e+09
@type double
@label Settlement_Amounts
@class other
@N_unique .
@N 1383
 
_@NOTES
 
=====notes=====
@freq 14, 8, 15, 12
@values "COMBINES SIMILAR ACTIONS", "SEE AQUILA", "SEE KNIGHT TRADING GROUP", "SEE WASTE MANAGEMENT I"
@type str38
@label Notes
@class category
@N_unique 4
@N 49
 
_@NOTES
 
=====meeting_d=====

meeting_d:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2720
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2720
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}meeting_d {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type float
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====begcp_d=====

begcp_d:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}              {res}#             {txt}Positive       {res} 2720      2720          -
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}11752             15538                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}begcp_d {c |}{res}      2720     14264.3    672.2085      11752      15538
@mean 14264.301
@sd   672.208
@min 11752.000
@max 15538.000
@example0 13515
@histh .00002641, .00003962, .00010895, .00003962, .00007264, .00011226, .00012216, .00014197, .00008914, .00019149, .00018159, .00075608, .00013207, .00051506, .00035328, .0003995, .00047213, .00035328, .00078249, .00069995, .00070325, .00045563, .0004127, .00025423, .00088154, .0002113, .00012216, .0001981, .00015188
@histw 11807.677, 12364.441, 12475.794, 12698.5, 12809.853, 12921.206, 13032.559, 13143.912, 13255.265, 13366.617, 13477.971, 13589.323, 13700.677, 13812.029, 13923.383, 14034.735, 14146.088, 14257.441, 14368.794, 14480.147, 14591.5, 14702.853, 14814.206, 14925.559, 15036.912, 15148.265, 15259.617, 15370.971, 15482.323
@type float
@label 
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====endcp_d=====

endcp_d:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #   #         {txt}Positive       {res} 2720      2720          -
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #   #         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}12548             16118                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}endcp_d {c |}{res}      2720    14729.12    680.0322      12548      16118
@mean 14729.115
@sd   680.032
@min 12548.000
@max 16118.000
@example0 14186
@histh .00004202, .00002801, .00003501, .00003852, .00006653, .00011204, .00004902, .00017507, .00012255, .0002556, .00037465, .0002416, .00040266, .00042717, .00037465, .00034664, .00066877, .00053571, .00037465, .00054272, .00034314, .0005112, .00039566, .00042367, .00027311, .00057773, .00117647, .00052171, .00003501, .00001401, .00003852
@histw 12600.5, 12915.5, 13020.5, 13125.5, 13230.5, 13335.5, 13440.5, 13545.5, 13650.5, 13755.5, 13860.5, 13965.5, 14070.5, 14175.5, 14280.5, 14385.5, 14490.5, 14595.5, 14700.5, 14805.5, 14910.5, 15015.5, 15120.5, 15225.5, 15330.5, 15435.5, 15540.5, 15645.5, 15750.5, 15855.5, 16065.5
@type float
@label 
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====filing_d=====

filing_d:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#       #         {txt}Positive       {res} 2720      2720          -
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #   #         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}13185             15694                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}filing_d {c |}{res}      2720    14768.82    635.8454      13185      15694
@mean 14768.815
@sd   635.845
@min 13185.000
@max 15694.000
@example0 14187
@histh .00003487, .00003986, .00011957, .00007473, .00032383, .00020426, .00013452, .00053308, .00035373, .0003338, .00018434, .000279, .00035373, .00036867, .00052312, .00041849, .00022419, .00090674, .00056297, .00076724, .00023416, .00040853, .00051315, .00014946, .00055301, .00031387, .00048326, .00043842, .00044839, .00060781, .00114089, .00087186, .00064767
@histw 13221.897, 13295.691, 13369.485, 13517.073, 13590.867, 13664.662, 13738.456, 13812.25, 13886.044, 13959.838, 14033.633, 14107.427, 14181.221, 14255.015, 14328.809, 14402.603, 14476.397, 14550.191, 14623.985, 14697.779, 14771.573, 14845.367, 14919.162, 14992.956, 15066.75, 15140.544, 15214.338, 15288.133, 15361.927, 15435.721, 15509.515, 15583.309, 15657.103
@type float
@label 
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====status_d=====

status_d:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2720
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2720
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}status_d {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type float
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====casenr=====

casenr:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res} 2720      2720          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                   373                      2720
(More than 99 unique values)

      {txt}casenr is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}casenr {c |}{res}      2720    185.5305     108.769          1        373
@mean   185.531
@sd   108.769
@min         1
@max       373
@example0 59
@histh .00231855, .00346102, .00295699, .00198253, .00275538, .00299059, .00258737, .00376344, .00255376, .00376344, .0031586, .00191532, .00147849, .00285618, .00204973, .00215054, .00221774, .00288978, .00362903, .00302419, .00178091, .00265457, .0030914, .0030914, .00288978, .00248656, .00241935, .00248656, .00225134, .00235215, .00208333, .00342742, .00268817, .0031922
@histw 6.4705882, 17.411764, 28.352942, 39.294117, 50.235294, 61.176472, 72.117645, 83.058823, 94, 104.94118, 115.88235, 126.82353, 137.76471, 148.70589, 159.64706, 170.58824, 181.52942, 192.47058, 203.41176, 214.35294, 225.29411, 236.23529, 247.17647, 258.11765, 269.05884, 280, 290.94116, 301.88235, 312.82352, 323.76471, 334.70587, 345.64706, 356.58823, 367.52942
@type long
@label 
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====status_orig=====
@freq 300, 1037, 1312, 51, 20
@values "ACTIVE", "DISMISSED", "SETTLED", "SETTLED (PARTIAL)", "SETTLED (TENTATIVE)"
@type str19
@label 
@class category
@N_unique 5
@N 2720
 
_@NOTES
 
=====hard_evidence=====

hard_evidence:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero           {res} 1438      1438          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1282      1282          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

      {txt}hard_evidence is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
hard_evide~e {c |}{res}      2720    .4713235    .4992688          0          1
@mean     0.471
@sd     0.499
@min     0.000
@max     1.000
@values 0, 1
@names "N", "Y"
@freq 1438, 1282
@type float
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====settled=====

settled:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero           {res} 1337      1337          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1383      1383          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

      {txt}settled is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}settled {c |}{res}      2720    .5084559    .5000204          0          1
@mean     0.508
@sd     0.500
@min     0.000
@max     1.000
@values 0, 1
@names "N", "Y"
@freq 1337, 1383
@type float
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====statusC=====

statusC:  Status                                {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res} 2720      2720          -
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #   #                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                     3                      2720
   (3 unique values)

      {txt}statusC is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}statusC {c |}{res}      2720    2.398162    .6785178          1          3
@mean     2.398
@sd     0.679
@min         1
@max         3
@values 1, 2, 3
@names "ACTIVE", "DISMISSED", "SETTLED"
@freq 300, 1037, 1383
@type long
@label Status
@class category
@N_unique 3
@N 2720
 
_@NOTES
 
=====settlement=====

settlement:  Settlement ()                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1383       685        698
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1383       685        698
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res} 1337
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.5             6156.096                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}settlement {c |}{res}      1383    187.6272    725.9282         .5   6156.096
@mean   187.627
@sd   725.928
@min     0.500
@max  6156.096
@example0 .
@histh .00437333, .00027675, .00020756, .00003277, .00005462, .00004006, .00005098
@histw 99.783813, 298.35144, 496.91907, 894.05432, 2681.1631, 3276.866, 6056.8125
@type double
@label Settlement ()
@class other
@N_unique .
@N 1383
 
_@NOTES
 
=====dir_co=====
@example0 Abele:JohnE.:BSX__01
@type str36
@label 
@class identifier
@N_unique 2720
@N 2720
 
_@NOTES
 
=====yr=====

yr:                                             {txt}Number of Observations
{hline 5}                                       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2720      2720          -
{txt}{c |}  {res}#                         {txt}Positive           {res}-         -          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                                            2720
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 10}yr {c |}{res}      2720           0           0          0          0
@mean         0
@sd     0.000
@min         0
@max         0
@values 0
@type byte
@label 
@class constant
@N_unique 1
@N 2720
 
_@NOTES
 
=====director_id=====

director_id:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2720      2720          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}30000            201632                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}director_id {c |}{res}      2720    41311.79    14290.15      30000     201632
@mean 41311.793
@sd 14290.147
@min     30000
@max    201632
@example0 38145
@histh .00006788, .00005222, .00003124, .00001398, .00001071, 8.448e-06, 6.919e-06, 5.462e-06, 3.642e-07, 8.740e-07
@histw 32524, 37572, 42620, 47668, 52716, 57764, 62812, 67860, 72908, 199108
@type long
@label 
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====lname=====
@example0 Abele
@type str23
@label 
@class string
@N_unique 2018
@N 2720
 
_@NOTES
 
=====fname=====
@example0 John E.
@type str19
@label 
@class string
@N_unique 1616
@N 2720
 
_@NOTES
 
=====position=====
@freq 2720
@values "IRRC"
@example0 IRRC
@type str11
@label 
@class constant
@N_unique 1
@N 2720
 
_@NOTES
 
=====status_yr_1=====
@freq 21, 1, 12, 87
@values "EMP", "EMP?", "FORMEMP", "IND"
@type str7
@label 
@class category
@N_unique 4
@N 121
 
_@NOTES
 
=====status_yr_2=====
@freq 71, 23, 425
@values "EMP", "FORMEMP", "IND"
@type str7
@label 
@class category
@N_unique 3
@N 519
 
_@NOTES
 
=====status_yr_3=====
@freq 90, 39, 538, 1
@values "EMP", "FORMEMP", "IND", "REL"
@type str7
@label 
@class category
@N_unique 4
@N 668
 
_@NOTES
 
=====status_yr_4=====
@freq 99, 42, 638, 1
@values "EMP", "FORMEMP", "IND", "REL"
@type str11
@label 
@class category
@N_unique 4
@N 780
 
_@NOTES
 
=====cid=====

cid:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2720      2720          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2               1015340                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}cid {c |}{res}      2720    13954.05    78525.52          2    1015340
@mean 13954.052
@sd 78525.521
@min         2
@max   1015340
@example0 8815
@histh .00003165, 1.724e-07, 1.465e-06, 1.970e-07
@histw 14933.441, 44796.324, 74659.203, 1000408.6
@type long
@label 
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====meet_yr=====

meet_yr:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #   #         {txt}Positive       {res} 2711      2711          -
{txt}{c |}  {res}#       #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 2711      2711          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res}    9
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}13249             15622                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}meet_yr {c |}{res}      2711    14590.74    660.8208      13249      15622
@mean 14590.739
@sd   660.821
@min 13249.000
@max 15622.000
@example0 14004
@histh .00052322, .00004228, .00011627, .00012684, .00113101, .00021669, .00012156, .00008985, .0003171, .00065006, .00058136, .00013741, .00010042, .00004757, .00117329, .00141112, .00012156, .00021669, .00005814, .00170708, .00007399, .00022197, .00009513, .00012156, .00139526, .00048623, .00007928, .00006871, .0001427, .00229373, .00029596, .00016384
@histw 13283.897, 13353.691, 13423.485, 13563.073, 13632.867, 13702.662, 13772.456, 13842.25, 13912.044, 13981.838, 14051.633, 14121.427, 14191.221, 14261.015, 14330.809, 14400.603, 14470.397, 14540.191, 14679.779, 14749.573, 14819.367, 14889.162, 14958.956, 15028.75, 15098.544, 15168.338, 15238.133, 15307.927, 15377.721, 15447.515, 15517.309, 15587.103
@type float
@label 
@class other
@N_unique .
@N 2711
 
_@NOTES
 
=====posn_id=====

posn_id:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2720      2720          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                                            2720
   (1 unique value)

      {txt}posn_id is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}posn_id {c |}{res}      2720           1           0          1          1
@mean         1
@sd     0.000
@min         1
@max         1
@values 1
@type long
@label 
@class constant
@N_unique 1
@N 2720
 
_@NOTES
 
=====dir_co_id=====

dir_co_id:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res} 2720      2720          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                  5007                      2720
(More than 99 unique values)

      {txt}dir_co_id is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}dir_co_id {c |}{res}      2720    2499.236    1456.042          2       5007
@mean  2499.236
@sd  1456.042
@min         2
@max      5007
@example0 2
@histh .00021479, .00020729, .00020729, .00021728, .00019481, .00018482, .00017732, .00021229, .00022228, .0002023, .00017732, .00019481, .00021479, .00017483, .00021728, .00017233, .00020729, .00021229, .00021978, .00018482, .00017732, .00020729, .00019231, .0001998, .00016983, .00018232, .00021728, .0001998, .00021229, .00020979, .0001973, .0001998, .00022228, .00018981
@histw 75.602943, 222.80882, 370.01471, 517.22058, 664.42645, 811.63232, 958.83826, 1106.0441, 1253.25, 1400.4559, 1547.6617, 1694.8677, 1842.0735, 1989.2794, 2136.4854, 2283.6912, 2430.897, 2578.103, 2725.3088, 2872.5146, 3019.7207, 3166.9265, 3314.1323, 3461.3381, 3608.5442, 3755.75, 3902.9558, 4050.1619, 4197.3677, 4344.5737, 4491.7793, 4638.9854, 4786.1914, 4933.397
@type long
@label 
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====tenmax=====

tenmax:  Length of board tenure                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero           {res}  431       431          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2289      2289          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#               #         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     4                      2720
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}tenmax {c |}{res}      2720    2.576103    1.545943          0          4
@mean     2.576
@sd     1.546
@min     0.000
@max     4.000
@values 0, 1, 2, 3, 4
@names "0", "1", "2", "3", "4"
@freq 431, 370, 374, 291, 1254
@type float
@label Length of board tenure
@class category
@N_unique 5
@N 2720
 
_@NOTES
 
=====tenstart=====

tenstart:  First observed in yr                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2720      2720          -
{txt}{c |}  {res}#                         {txt}Positive           {res}-         -          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                                            2720
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}tenstart {c |}{res}      2720           0           0          0          0
@mean     0.000
@sd     0.000
@min     0.000
@max     0.000
@values 0
@type float
@label First observed in yr
@class constant
@N_unique 1
@N 2720
 
_@NOTES
 
=====survmax=====

survmax:  Last year firm observed with dire     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 2720      2720          -
{txt}{c |}          {res}#                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#                 {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}.   .   #                 {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2                     4                      2720
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}survmax {c |}{res}      2720    3.810662    .5312904          2          4
@mean     3.811
@sd     0.531
@min     2.000
@max     4.000
@values 2, 3, 4
@names "2", "3", "4"
@freq 175, 165, 2380
@type float
@label Last year firm observed with directors
@class category
@N_unique 3
@N 2720
 
_@NOTES
 
=====lastyr=====

lastyr:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2350      2350          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  370       370          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}lastyr {c |}{res}      2720    .1360294    .3428828          0          1
@mean     0.136
@sd     0.343
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2350, 370
@type byte
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====settleMM=====

settleMM:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1383       685        698
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1383       685        698
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res} 1337
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.5             6156.096                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}settleMM {c |}{res}      1383    187.6272    725.9282         .5   6156.096
@mean   187.627
@sd   725.928
@min     0.500
@max  6156.096
@example0 .
@histh .00437333, .00027675, .00020756, .00003277, .00005462, .00004006, .00005098
@histw 99.783813, 298.35144, 496.91907, 894.05432, 2681.1631, 3276.866, 6056.8125
@type double
@label 
@class other
@N_unique .
@N 1383
 
_@NOTES
 
=====did=====

did:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2720      2720          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}30000            201632                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}did {c |}{res}      2720    41311.79    14290.15      30000     201632
@mean 41311.793
@sd 14290.147
@min 30000.000
@max  2.02e+05
@example0 38145
@histh .00006788, .00005222, .00003124, .00001398, .00001071, 8.448e-06, 6.919e-06, 5.462e-06, 3.642e-07, 8.740e-07
@histw 32524, 37572, 42620, 47668, 52716, 57764, 62812, 67860, 72908, 199108
@type double
@label 
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====idx_desc=====
@freq 257, 241, 188, 1193, 257, 79, 133, 243
@values "MidCap", "Not Super", "Not super", "S&P 500", "S&P 500 (", "S&P MidCa", "S&P Small", "SmallCap"
@type str16
@label description of index code
@class category
@N_unique 8
@N 2591
 
_@NOTES
 
=====age=====

age:  director age                              {txt}Number of Observations
{hline 18}                          {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 2720      2720          -
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}27                   93                      2720
  (59 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}age {c |}{res}      2720     57.9886    8.945642         27         93
@mean    57.989
@sd     8.946
@min        27
@max        93
@example0 61
@histh .00018939, .00037879, .00227273, .00189394, .00378788, .00587121, .01079545, .01439394, .01856061, .01969697, .0282197, .03011364, .0405303, .04034091, .04375, .02253788, .0407197, .04431818, .0407197, .03049242, .03011364, .02026515, .01060606, .00757576, .00170455, .00227273, .00132576, .00056818, .00037879, .00018939, .00018939, .00018939, .00018939
@histw 27.970589, 31.852942, 33.794117, 35.735294, 37.676472, 39.617645, 41.558823, 43.5, 45.441177, 47.382355, 49.323528, 51.264706, 53.205883, 55.14706, 57.088234, 59.029411, 60.970589, 62.911766, 64.852943, 66.794121, 68.735291, 70.676468, 72.617645, 74.558823, 76.5, 78.441177, 80.382355, 82.323532, 84.264709, 86.205879, 88.147057, 90.088234, 92.029411
@type byte
@label director age
@class other
@N_unique 59
@N 2720
 
_@NOTES
 
=====ethnicity=====
@freq 21, 82, 1264, 22
@values "A", "B", "C", "H"
@type str1
@label director ethnicity if known (a=asian, b=african american, c=caucasian, h=hispani
@class category
@N_unique 4
@N 1389
 
_@NOTES
 
=====proxybsc=====

proxybsc:  number other company boards          {txt}Number of Observations
{hline 38}      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1064      1064          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1208      1208          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2272      2272          -
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing        {res}  448
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                    10                      2720
  (11 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}proxybsc {c |}{res}      2272    1.102993    1.421961          0         10
@mean     1.103
@sd     1.422
@min         0
@max        10
@values 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
@names "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"
@freq 1064, 518, 360, 182, 77, 42, 11, 13, 1, 1, 3
@type byte
@label number other company boards
@class category
@N_unique 11
@N 2272
 
_@NOTES
 
=====priemp=====
@example0 Boston Scientific
@type str50
@label primary company name
@class string
@N_unique 1323
@N 2085
 
_@NOTES
 
=====prititle=====
@example0 founder chairman
@type str27
@label title in primary job
@class string
@N_unique 247
@N 1984
 
_@NOTES
 
=====substitle=====
@freq 4, 1, 1, 1, 2, 1, 9, 1, 1, 1, 1, 1, 1, 7, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1
@values "CEO", "CEO & president", "CEO; chairman", "EVP; president", "VP", "ceo", "chairman", "chairman; CEO", "chairman; CEO; president", "chairman; presi", "division presid", "group president", "managing director", "president", "president and C", "president; CEO", "president; COO", "president; ceo", "president; gen.", "senior advisor", "senior manageme", "subsidiary CEO", "subsidiary CEO and chairman", "subsidiary chairman; CEO", "subsidiary president", "vice-chairman"
@type str35
@label employment title - if executive of subsidiary
@class category
@N_unique 26
@N 44
 
_@NOTES
 
=====othertitle=====
@example0 founder chairm
@type str35
@label other employment title
@class string
@N_unique 172
@N 513
 
_@NOTES
 
=====cntryemp=====
@freq 1, 1, 1, 6, 2, 8, 1, 4, 2, 1, 1, 2, 3, 2189
@values "CA", "CH", "CN", "DE", "FR", "GB", "JP", "MX", "NL", "NO", "R", "SE", "UK", "US"
@type str2
@label country of employment
@class category
@N_unique 14
@N 2222
 
_@NOTES
 
=====yearbeg=====

yearbeg:  date service began                    {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2714      2714          -
{txt}{c |}              {res}#   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}              {res}#   #         {txt}Total          {res} 2714      2714          -
{txt}{c |}  {res}.   .   .   #   #         {txt}Missing        {res}    6
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1953               2002                      2720
  (46 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}yearbeg {c |}{res}      2714    1992.227    7.014272       1953       2002
@mean  1992.227
@sd     7.014
@min      1953
@max      2002
@example0 1979
@histh .00025567, .00025567, .00025567, .00051133, .00025567, .00230099, .00025567, .00102266, .00102266, .00204533, .00357932, .00204533, .00306799, .00332366, .00766998, .00536899, .00460199, .00920398, .00460199, .01917495, .01533996, .02940159, .02454394, .04167356, .0247996, .02940159, .0910171, .04423022, .1181177, .05957018, .08385845, .03119125, .02991292
@histw 1953.7206, 1955.1617, 1956.6029, 1959.4854, 1960.9265, 1962.3677, 1963.8088, 1965.25, 1966.6912, 1968.1323, 1969.5735, 1971.0146, 1972.4559, 1973.8971, 1975.3383, 1976.7794, 1978.2206, 1979.6617, 1981.1029, 1982.5441, 1983.9854, 1985.4265, 1986.8677, 1988.3088, 1989.75, 1991.1912, 1992.6323, 1994.0735, 1995.5146, 1996.9559, 1998.3971, 1999.8383, 2001.2794
@type int
@label date service began
@class other
@N_unique 46
@N 2714
 
_@NOTES
 
=====yearend=====

yearend:  date service ends                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero           {res}    5         5          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2266      2266          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}                  {res}#         {txt}Total          {res} 2271      2271          -
{txt}{c |}  {res}.   .   .   .   #         {txt}Missing        {res}  449
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  2005                      2720
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}yearend {c |}{res}      2271    1997.236     93.8517          0       2005
@mean  1997.236
@sd    93.852
@min         0
@max      2005
@values 0, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005
@names "0", "1998", "1999", "2000", "2001", "2002", "2003", "2004", "2005"
@freq 5, 1, 198, 434, 445, 447, 480, 161, 100
@type long
@label date service ends
@class category
@N_unique 9
@N 2271
 
_@NOTES
 
=====sharesheld=====

sharesheld:  shares held                        {txt}Number of Observations
{hline 24}                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}   99        99          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2621      2621          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0              6.96e+08                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}sharesheld {c |}{res}      2720     2073360    1.79e+07          0   6.96e+08
@mean  2.07e+06
@sd  1.79e+07
@min         0
@max 696356050
@example0 14359956
@histh 4.800e-08, 3.949e-10, 1.257e-10, 3.590e-11, 5.385e-11, 8.975e-11, 1.795e-11, 3.590e-11, 1.795e-11, 1.795e-11, 1.795e-11, 1.795e-11
@histw 10240530, 30721590, 51202652, 71683712, 92164768, 1.126e+08, 1.331e+08, 1.536e+08, 1.946e+08, 2.355e+08, 2.970e+08, 6.861e+08
@type long
@label shares held
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====stkholding=====

stkholding:  Voting Share (\%)                  {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2027      2027          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  693        28        665
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2055        665
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0              142.5288                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}stkholding {c |}{res}      2720    1.058879    5.752313          0   142.5288
@mean     1.059
@sd     5.752
@min     0.000
@max   142.529
@example0 7.4000001
@histh .22609469, .00517439, .00219254, .00078931, .00096472, .00070161, .0001754, .00035081, .00096472, .0002631, .0001754, .0001754, .0001754, .0000877, .0000877, .0000877, .0000877
@histw 2.0960114, 6.2880344, 10.480057, 14.67208, 18.864103, 23.056126, 27.248148, 31.440172, 35.632195, 39.824219, 44.016239, 48.208263, 56.592308, 64.976357, 69.168381, 98.512535, 140.43277
@type float
@label Voting Share (\%) 
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====dirtype=====
@freq 563, 1736, 421
@values "E", "I", "L"
@type str1
@label board affiliation ((e=employee, i=independent,l=linked))
@class category
@N_unique 3
@N 2720
 
_@NOTES
 
=====proftype=====
@freq 63, 22, 1, 67, 5, 11, 1, 1
@values "Consulting", "Financial", "Insurance", "Legal", "Other (enter name)", "Real Estate", "advertising", "aircraft leasing t"
@type str18
@label type of services
@class category
@N_unique 8
@N 171
 
_@NOTES
 
=====formersev=====

formersev:  year of termination                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2590      2590          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  130       130          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  2001                      2720
  (20 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}formersev {c |}{res}      2720     95.3364    425.6158          0       2001
@mean    95.336
@sd   425.616
@min         0
@max      2001
@values 0, 1982, 1983, 1984, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001
@names "0", "1982", "1983", "1984", "1986", "1987", "1988", "1989", "1990", "1991", "1992", "1993", "1994", "1995", "1996", "1997", "1998", "1999", "2000", "2001"
@freq 2590, 1, 1, 1, 2, 2, 4, 7, 3, 4, 5, 11, 8, 17, 17, 13, 13, 11, 5, 5
@type int
@label year of termination
@class category
@N_unique 20
@N 2720
 
_@NOTES
 
=====relation=====
@freq 1, 2, 1, 1, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1, 1, 1, 1, 2, 2, 1, 1, 1
@values "Son of the CEO", "brother of CEO", "brother of chairman; CEO;", "brother of president", "brother of senior VP", "brother to Robert K. Green", "daughter of CEO", "father of CEO", "father of COO", "father of executive VP", "father to Scott", "father to employee", "husband to subsidiary EVP", "mother of CEO", "mother of vice chairman and pr", "sister of CEO", "sister of chairman", "son of CEO", "son of chairman", "son-in-law of CEO", "wife of Fred S.L. Chan", "wife of Harland C. Stonecipher"
@type str30
@label relation to employee
@class category
@N_unique 22
@N 28
 
_@NOTES
 
=====annrev=====

annrev:  revenue/turnover                       {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2266       864       1402
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2266       864       1402
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  454
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1.1              111826                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}annrev {c |}{res}      2266    9566.496     14997.5        1.1     111826
@mean  9566.496
@sd 14997.499
@min     1.100
@max  1.12e+05
@example0 1462
@histh .00014885, .00003282, .0000306, .0000194, 4.428e-06, .00001393, 6.121e-06, .00001159, 7.553e-06, 1.433e-06, 3.777e-06, 1.693e-06, 2.605e-06, 1.433e-06, 1.563e-06, 1.693e-06, 1.433e-06, 1.953e-06, 2.214e-06
@histw 1695.4166, 5084.0498, 8472.6836, 11861.316, 15249.95, 18638.584, 22027.217, 25415.85, 28804.482, 32193.117, 35581.75, 38970.383, 42359.016, 45747.648, 49136.285, 52524.918, 55913.551, 59302.184, 110131.68
@type double
@label revenue/turnover
@class other
@N_unique .
@N 2266
 
_@NOTES
 
=====eco_code=====

eco_code:  economic group                       {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#           #         {txt}Positive       {res} 2591      2591          -
{txt}{c |}  {res}#   #   #       #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #       #         {txt}Total          {res} 2591      2591          -
{txt}{c |}  {res}#   #   #   .   #         {txt}Missing        {res}  129
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}10                   95                      2720
  (11 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}eco_code {c |}{res}      2591    52.31301      25.538         10         95
@mean    52.313
@sd    25.538
@min        10
@max        95
@values 10, 20, 30, 35, 40, 50, 60, 80, 86, 90, 95
@names "10", "20", "30", "35", "40", "50", "60", "80", "86", "90", "95"
@freq 67, 391, 245, 400, 80, 317, 183, 588, 73, 222, 25
@type int
@label economic group
@class category
@N_unique 11
@N 2591
 
_@NOTES
 
=====eco_desc=====
@freq 59, 152, 50, 74, 245, 317, 80, 317, 400, 31, 49, 8, 539, 23, 25, 222
@values "Basic materials", "Capital goods", "Communication servic", "Consumer discretionar", "Consumer staples", "Consumer-cyclicals", "Energy", "Financials", "Health care", "Industials", "Information technolog", "Materials", "Technology", "Telecommunication ser", "Transportation", "Utilities"
@type str26
@label description of economic group
@class category
@N_unique 16
@N 2591
 
_@NOTES
 
=====exchange=====
@freq 17, 1678, 577
@values "AMEX", "NYSE", "OTC"
@type str4
@label stock exchange
@class category
@N_unique 3
@N 2272
 
_@NOTES
 
=====ind_code=====

ind_code:  industry group code                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#           #         {txt}Positive       {res} 2591      2591          -
{txt}{c |}  {res}#   #           #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #       #         {txt}Total          {res} 2591      2591          -
{txt}{c |}  {res}#   #   #   .   #         {txt}Missing        {res}  129
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}10                   95                      2720
  (25 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}ind_code {c |}{res}      2591    52.90081    25.08122         10         95
@mean    52.901
@sd    25.081
@min        10
@max        95
@values 10, 20, 21, 22, 24, 25, 30, 31, 32, 35, 36, 40, 50, 51, 60, 61, 62, 80, 81, 82, 83, 86, 90, 91, 95
@names "10", "20", "21", "22", "24", "25", "30", "31", "32", "35", "36", "40", "50", "51", "60", "61", "62", "80", "81", "82", "83", "86", "90", "91", "95"
@freq 67, 18, 91, 130, 115, 37, 175, 22, 48, 347, 53, 80, 182, 135, 115, 50, 18, 507, 44, 28, 9, 73, 214, 8, 25
@type int
@label industry group code
@class category
@N_unique 25
@N 2591
 
_@NOTES
 
=====ind_desc=====
@example0 Health care (medical products/
@type str37
@label description of industry code
@class string
@N_unique 110
@N 2591
 
_@NOTES
 
=====votecref=====

votecref:  common shares outstanding from p     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2720      2593        127
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2593        127
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}8914835        7.16e+09                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}votecref {c |}{res}      2720    4.73e+08    9.82e+08    8914835   7.16e+09
@mean  4.73e+08
@sd  9.82e+08
@min  8.91e+06
@max  7.16e+09
@example0 1.941e+08
@histh 2.919e-09, 8.263e-10, 2.463e-10, 1.258e-10, 1.066e-10, 4.892e-11, 8.735e-11, 2.446e-11, 5.590e-11, 8.910e-11, 2.271e-11, 2.096e-11, 3.669e-11, 2.271e-11, 4.892e-11, 2.970e-11, 1.922e-11, 2.096e-11
@histw 1.141e+08, 3.246e+08, 5.350e+08, 7.455e+08, 9.559e+08, 1.166e+09, 1.377e+09, 1.587e+09, 1.798e+09, 2.008e+09, 2.219e+09, 2.429e+09, 2.850e+09, 3.060e+09, 4.533e+09, 5.165e+09, 6.638e+09, 7.059e+09
@type double
@label common shares outstanding from proxy
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====nominee=====

nominee:  for election at the current year      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1148      1148          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1572      1572          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}nominee {c |}{res}      2720    .5779412    .4939786          0          1
@mean     0.578
@sd     0.494
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1148, 1572
@type byte
@label for election at the current year annual meeting
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====nonempchr=====

nonempchr:  nonemployee serving as chairman     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2229      2229          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   43        43          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2272      2272          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  448
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}nonempchr {c |}{res}      2272    .0189261    .1362939          0          1
@mean     0.019
@sd     0.136
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2229, 43
@type byte
@label nonemployee serving as chairman
@class dummy
@N_unique 2
@N 2272
 
_@NOTES
 
=====othert=====
@example0 
@type str35
@label other title description (2003)
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====mtgmonth=====

mtgmonth:  month of meeting                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 2720      2720          -
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}.   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    11                      2720
  (11 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}mtgmonth {c |}{res}      2720    5.215074    1.858668          1         11
@mean     5.215
@sd     1.859
@min         1
@max        11
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"
@freq 34, 78, 53, 730, 1177, 291, 55, 78, 61, 66, 97
@type byte
@label month of meeting
@class category
@N_unique 11
@N 2720
 
_@NOTES
 
=====fullname=====
@example0 JOHN E ABELE
@type str32
@label director full name
@class string
@N_unique 2458
@N 2720
 
_@NOTES
 
=====president=====

president:  employment title- president         {txt}Number of Observations
{hline 39}     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2157      2157          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  563       563          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}president {c |}{res}      2720    .2069853    .4052194          0          1
@mean     0.207
@sd     0.405
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2157, 563
@type byte
@label employment title- president
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====chairman=====

chairman:  employment title -chairman           {txt}Number of Observations
{hline 37}       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2087      2087          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  633       633          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}chairman {c |}{res}      2720    .2327206    .4226433          0          1
@mean     0.233
@sd     0.423
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2087, 633
@type byte
@label employment title -chairman
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====vicechair=====

vicechair:  employment title-vicechair          {txt}Number of Observations
{hline 38}      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2644      2644          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   76        76          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}vicechair {c |}{res}      2720    .0279412    .1648346          0          1
@mean     0.028
@sd     0.165
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2644, 76
@type byte
@label employment title-vicechair
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====vp=====

vp:  employment title-vicepresident             {txt}Number of Observations
{hline 35}         {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2690      2690          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   30        30          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 10}vp {c |}{res}      2720    .0110294    .1044594          0          1
@mean     0.011
@sd     0.104
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2690, 30
@type byte
@label employment title-vicepresident
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====ceo=====

ceo:  CEO (0/1)                                 {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2446      2446          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  274       274          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}ceo {c |}{res}      2720    .1007353    .3010332          0          1
@mean     0.101
@sd     0.301
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2446, 274
@type byte
@label CEO (0/1) 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====cfo=====

cfo:  employment title -chief financial off     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2661      2661          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   59        59          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}cfo {c |}{res}      2720    .0216912    .1456999          0          1
@mean     0.022
@sd     0.146
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2661, 59
@type byte
@label employment title -chief financial officer
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====coo=====

coo:  employment title -chief operating off     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2642      2642          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   78        78          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}coo {c |}{res}      2720    .0286765    .1669263          0          1
@mean     0.029
@sd     0.167
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2642, 78
@type byte
@label employment title -chief operating officer
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====svp=====

svp:  employment title- senior vp               {txt}Number of Observations
{hline 33}           {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2681      2681          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   39        39          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}svp {c |}{res}      2720    .0143382    .1189027          0          1
@mean     0.014
@sd     0.119
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2681, 39
@type byte
@label employment title- senior vp
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====secty=====

secty:  employment title- secretary             {txt}Number of Observations
{hline 35}         {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2698      2698          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   22        22          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}secty {c |}{res}      2720    .0080882    .0895866          0          1
@mean     0.008
@sd     0.090
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2698, 22
@type byte
@label employment title- secretary
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====treas=====

treas:  employment title-treasurer              {txt}Number of Observations
{hline 34}          {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2258      2258          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   14        14          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2272      2272          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  448
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}treas {c |}{res}      2272     .006162    .0782732          0          1
@mean     0.006
@sd     0.078
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2258, 14
@type byte
@label employment title-treasurer
@class dummy
@N_unique 2
@N 2272
 
_@NOTES
 
=====evp=====

evp:  employment title -executive vicepresi     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2620      2620          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  100       100          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}evp {c |}{res}      2720    .0367647    .1882182          0          1
@mean     0.037
@sd     0.188
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2620, 100
@type byte
@label employment title -executive vicepresident
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====gender=====

gender:  gender (female=1)                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2333      2333          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  258       258          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2591      2591          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  129
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}gender {c |}{res}      2591    .0995755    .2994909          0          1
@mean     0.100
@sd     0.299
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2333, 258
@type byte
@label gender (female=1)
@class dummy
@N_unique 2
@N 2591
 
_@NOTES
 
=====nommbr=====

nommbr:  committee membership - nominating      {txt}Number of Observations
{hline 42}  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1667      1667          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  605       605          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2272      2272          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}  448
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}nommbr {c |}{res}      2272    .2662852    .4421125          0          1
@mean     0.266
@sd     0.442
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1667, 605
@type byte
@label committee membership - nominating
@class dummy
@N_unique 2
@N 2272
 
_@NOTES
 
=====compchair=====

compchair:  committee chair - compensation      {txt}Number of Observations
{hline 42}  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1792      1792          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  142       142          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1934      1934          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  786
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}compchair {c |}{res}      1934     .073423     .260897          0          1
@mean     0.073
@sd     0.261
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1792, 142
@type byte
@label committee chair - compensation
@class dummy
@N_unique 2
@N 1934
 
_@NOTES
 
=====compmbr=====

compmbr:  committee membership - compensati     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1461      1461          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  811       811          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2272      2272          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}  448
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}compmbr {c |}{res}      2272    .3569542    .4792066          0          1
@mean     0.357
@sd     0.479
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1461, 811
@type byte
@label committee membership - compensation
@class dummy
@N_unique 2
@N 2272
 
_@NOTES
 
=====auditchair=====

auditchair:  committee chair - audit            {txt}Number of Observations
{hline 36}        {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2224      2224          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  158       158          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2382      2382          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  338
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}auditchair {c |}{res}      2382    .0663308    .2489117          0          1
@mean     0.066
@sd     0.249
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2224, 158
@type byte
@label committee chair - audit
@class dummy
@N_unique 2
@N 2382
 
_@NOTES
 
=====auditmbr=====

auditmbr:  committee membership - audit         {txt}Number of Observations
{hline 39}     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1715      1715          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1005      1005          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}auditmbr {c |}{res}      2720    .3694853    .4827542          0          1
@mean     0.369
@sd     0.483
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1715, 1005
@type byte
@label committee membership - audit
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====corpgov=====

corpgov:  committee membership-corporate go     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1946      1946          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  326       326          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2272      2272          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}  448
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}corpgov {c |}{res}      2272    .1434859    .3506449          0          1
@mean     0.143
@sd     0.351
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1946, 326
@type byte
@label committee membership-corporate governance
@class dummy
@N_unique 2
@N 2272
 
_@NOTES
 
=====formeremp=====

formeremp:  former employee                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2589      2589          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  131       131          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}formeremp {c |}{res}      2720    .0481618    .2141473          0          1
@mean     0.048
@sd     0.214
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2589, 131
@type byte
@label former employee
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====charity=====

charity:  employment title -charity             {txt}Number of Observations
{hline 35}         {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2718      2718          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    2         2          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}charity {c |}{res}      2720    .0007353    .0271113          0          1
@mean     0.001
@sd     0.027
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2718, 2
@type byte
@label employment title -charity
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====supplier=====

supplier:  business transaction                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2633      2633          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   87        87          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}supplier {c |}{res}      2720    .0319853    .1759932          0          1
@mean     0.032
@sd     0.176
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2633, 87
@type byte
@label business transaction
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====relative=====

relative:  relative                             {txt}Number of Observations
{hline 19}                         {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2692      2692          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   28        28          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}relative {c |}{res}      2720    .0102941    .1009549          0          1
@mean     0.010
@sd     0.101
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2692, 28
@type byte
@label relative
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====interlock=====

interlock:  interlocking directorship           {txt}Number of Observations
{hline 37}       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2685      2685          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   35        35          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}interlock {c |}{res}      2720    .0128676    .1127242          0          1
@mean     0.013
@sd     0.113
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2685, 35
@type byte
@label interlocking directorship
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====otherlink=====

otherlink:  other affiliation                   {txt}Number of Observations
{hline 29}               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2716      2716          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    4         4          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}otherlink {c |}{res}      2720    .0014706    .0383271          0          1
@mean     0.001
@sd     0.038
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2716, 4
@type byte
@label other affiliation
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====attendance=====

attendance:  attended less than 75 percent      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2658      2658          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   62        62          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}attendance {c |}{res}      2720    .0227941     .149274          0          1
@mean     0.023
@sd     0.149
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2658, 62
@type byte
@label attended less than 75 percent of board/ committee meetings
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====grandfath=====

grandfath:  grandfathered on retirement age     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2266      2266          -
{txt}{c |}  {res}#                         {txt}Positive       {res}    6         6          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2272      2272          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  448
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}grandfath {c |}{res}      2272    .0026408    .0513326          0          1
@mean     0.003
@sd     0.051
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2266, 6
@type byte
@label grandfathered on retirement age/tenure policy
@class dummy
@N_unique 2
@N 2272
 
_@NOTES
 
=====priorserv=====

priorserv:  prior service on board              {txt}Number of Observations
{hline 34}          {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2245      2245          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   27        27          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2272      2272          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  448
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}priorserv {c |}{res}      2272    .0118838     .108387          0          1
@mean     0.012
@sd     0.108
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2245, 27
@type byte
@label prior service on board
@class dummy
@N_unique 2
@N 2272
 
_@NOTES
 
=====profsvcs=====

profsvcs:  compensation for profesional ser     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2549      2549          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  171       171          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}profsvcs {c |}{res}      2720    .0628676    .2427694          0          1
@mean     0.063
@sd     0.243
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2549, 171
@type byte
@label compensation for profesional services
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====ownless1=====

ownless1:  own less than 1 pct.                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  374       374          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2217      2217          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 2591      2591          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}  129
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}ownless1 {c |}{res}      2591    .8556542    .3515079          0          1
@mean     0.856
@sd     0.352
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 374, 2217
@type byte
@label own less than 1 pct.
@class dummy
@N_unique 2
@N 2591
 
_@NOTES
 
=====desigd=====

desigd:  designated director                    {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2657      2657          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   63        63          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}desigd {c |}{res}      2720    .0231618    .1504447          0          1
@mean     0.023
@sd     0.150
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2657, 63
@type byte
@label designated director
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====idx_code=====

idx_code:  s&p index code (e.g. s&p500=10,      {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2162      2162          -
{txt}{c |}  {res}#               #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#               #         {txt}Total          {res} 2162      2162          -
{txt}{c |}  {res}#   .   .   .   #         {txt}Missing        {res}  558
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}10                   92                      2720
   (6 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}idx_code {c |}{res}      2162     42.0629    37.39973         10         92
@mean    42.063
@sd    37.400
@min        10
@max        92
@values 10, 40, 49, 60, 91, 92
@names "10", "40", "49", "60", "91", "92"
@freq 1197, 15, 98, 140, 336, 376
@type byte
@label s&p index code (e.g. s&p500=10, midcaps=92,smallcaps=91)
@class category
@N_unique 6
@N 2162
 
_@NOTES
 
=====cusip=====
@example0 101137
@type str6
@label cusip
@class string
@N_unique 276
@N 2720
 
_@NOTES
 
=====profother=====
@freq 546, 2, 1, 1, 1, 1, 1
@values "0", "advertis", "aircraft", "construc", "consulti", "drug res", "supplier"
@type str8
@label other proffession
@class category
@N_unique 7
@N 553
 
_@NOTES
 
=====voting=====

voting:  total voting power                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2172      2103         69
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2172      2103         69
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}  548
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}8914835        7.16e+09                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}voting {c |}{res}      2172    4.09e+08    8.90e+08    8914835   7.16e+09
@mean  4.09e+08
@sd  8.90e+08
@min  8.91e+06
@max  7.16e+09
@example0 1.941e+08
@histh 3.011e-09, 7.835e-10, 1.635e-10, 1.019e-10, 1.168e-10, 4.459e-11, 9.768e-11, 7.220e-11, 1.911e-11, 5.521e-11, 2.548e-11, 1.486e-11, 2.973e-11, 2.760e-11, 2.336e-11, 2.548e-11
@histw 1.173e+08, 3.341e+08, 5.510e+08, 7.678e+08, 9.846e+08, 1.201e+09, 1.418e+09, 1.635e+09, 1.852e+09, 2.069e+09, 2.502e+09, 2.719e+09, 2.936e+09, 4.020e+09, 6.622e+09, 7.056e+09
@type double
@label total voting power
@class other
@N_unique .
@N 2172
 
_@NOTES
 
=====intercomp=====
@freq 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1
@values "Alexander", "Allaire", "American Exploration", "Ameritech", "Arison", "Armstrong", "Bell Atlantic", "Bradford R. Boss", "Burnham", "Catell", "Edward E. Crutchfield", "Harland C. Stonecipher", "Herbert M. Pearlman", "Istock", "Manoogian", "McCoy", "Medpartners", "NAI", "NYNEX", "North Carolina Trust", "Object Design", "Renal Care", "Rohde", "Sclavos", "Steven P. Jobs", "Thoman", "Thomas M. Ryan", "Walter"
@type str35
@label person with whom the directorship interlocks
@class category
@N_unique 28
@N 29
 
_@NOTES
 
=====insthold=====

insthold:  Institutional Holdings               {txt}Number of Observations
{hline 33}           {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero           {res}   41        41          -
{txt}{c |}          {res}#   #             {txt}Positive       {res} 2672       104       2568
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 2713       145       2568
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing        {res}    7
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 98.56                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}insthold {c |}{res}      2713    62.36337    20.20103          0      98.56
@mean    62.363
@sd    20.201
@min     0.000
@max    98.560
@example0 51.040001
@histh .00584906, .00127154, .00101723, .00127154, .0035603, .0054676, .00076292, .00991798, .00432322, .00457753, .00114438, .00648483, .00877359, .00851929, .00864644, .01144382, .02225187, .02276048, .01474981, .01856442, .02466779, .02009026, .02657509, .0197088, .01182528, .0142412, .02632078, .01309681, .00813783, .00750206, .00597622, .0054676
@histw 1.4494117, 4.3482351, 7.2470589, 15.943529, 18.842352, 21.741177, 24.639999, 27.538822, 30.437647, 33.336472, 36.235294, 39.134117, 42.03294, 44.931763, 47.830585, 50.729412, 53.628235, 56.527058, 59.42588, 62.324703, 65.223526, 68.122353, 71.021172, 73.919998, 76.818825, 79.717644, 82.61647, 85.515289, 88.414116, 91.312943, 94.211761, 97.110588
@type double
@label Institutional Holdings
@class other
@N_unique .
@N 2713
 
_@NOTES
 
=====subs=====

subs:  substitle                                {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2132      2132          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   40        40          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2172      2172          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  548
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}subs {c |}{res}      2172    .0184162    .1344819          0          1
@mean     0.018
@sd     0.134
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2132, 40
@type byte
@label substitle
@class dummy
@N_unique 2
@N 2172
 
_@NOTES
 
=====nomchair=====

nomchair:  committee chair  nominating         {txt}Number of Observations
{hline 39}     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1320      1320          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   66        66          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 1386      1386          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res} 1334
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}nomchair {c |}{res}      1386     .047619    .2130357          0          1
@mean     0.048
@sd     0.213
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1320, 66
@type byte
@label committee chair  nominating
@class dummy
@N_unique 2
@N 1386
 
_@NOTES
 
=====tier=====
@example0 
@type str2
@label tier
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====cusiph=====
@example0 101137
@type str6
@label header cusip identifier
@class string
@N_unique 275
@N 2720
 
_@NOTES
 
=====id_new=====

id_new:  new irrc company id                    {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2720      1824        896
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      1824        896
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}14.1            1015340                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}id_new {c |}{res}      2720    13823.66    78133.08       14.1    1015340
@mean 13823.659
@sd 78133.083
@min    14.100
@max  1.02e+06
@example0 5018
@histh .00003206, 9.849e-08, 1.133e-06, 1.970e-07
@histw 14945.364, 44807.895, 74670.422, 1000408.8
@type double
@label new irrc company id
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====did_new=====

did_new:  new irrc director id                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2720      1482       1238
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      1482       1238
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2              201632.1                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}did_new {c |}{res}      2720    22759.32    23063.86          2   201632.1
@mean 22759.316
@sd 23063.856
@min     2.000
@max  2.02e+05
@example0 4745
@histh .00006385, .00001711, 7.253e-06, 3.410e-06, 2.480e-07, .0000225, .00002244, .00001196, 8.555e-06, 4.464e-06, 3.782e-06, 2.294e-06, 7.439e-07
@histw 2967.1484, 8897.4453, 14827.742, 20758.039, 26688.336, 32618.635, 38548.93, 44479.227, 50409.523, 56339.82, 62270.117, 68200.414, 198666.95
@type double
@label new irrc director id
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====compname=====
@example0 BOSTON SCIENTIFIC CORP
@type str48
@label CompName
@class string
@N_unique 160
@N 1526
 
_@NOTES
 
=====partial=====

partial:  Partial                               {txt}Number of Observations
{hline 17}                           {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   65        65          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   65        65          -
{txt}{c |}  {res}#                         {txt}Missing        {res} 2655
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                                            2720
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}partial {c |}{res}        65           1           0          1          1
@mean         1
@sd     0.000
@min         1
@max         1
@values 1
@type byte
@label Partial
@class constant
@N_unique 1
@N 65
 
_@NOTES
 
=====full=====

full:  Full                                     {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   31        31          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   31        31          -
{txt}{c |}  {res}#                         {txt}Missing        {res} 2689
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                                            2720
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}full {c |}{res}        31           1           0          1          1
@mean         1
@sd     0.000
@min         1
@max         1
@values .
@type byte
@label Full
@class constant
@N_unique 1
@N 31
 
_@NOTES
 
=====prefflag=====

prefflag:  PrefFlag                             {txt}Number of Observations
{hline 19}                         {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   52        52          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}   52        52          -
{txt}{c |}  {res}#                         {txt}Missing        {res} 2668
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                                            2720
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}prefflag {c |}{res}        52           1           0          1          1
@mean         1
@sd     0.000
@min         1
@max         1
@values .
@type byte
@label PrefFlag
@class constant
@N_unique 1
@N 52
 
_@NOTES
 
=====sumblks=====

sumblks:  Blockholdings                         {txt}Number of Observations
{hline 23}                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  426       426          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2202       226       1976
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2628       652       1976
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing        {res}   92
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  98.7                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}sumblks {c |}{res}      2628    22.04493    19.05703          0       98.7
@mean    22.045
@sd    19.057
@min     0.000
@max    98.700
@example0 30.1
@histh .05584008, .01402556, .0235944, .01389448, .03316324, .02057956, .02909976, .01848228, .02071064, .02110388, .01520528, .01101072, .00734048, .0104864, .00432564, .013108, .0045878, .00314592, .00209728, .00288376, .00249052, .00367024, .003277, .00183512, .0006554, .0019662, .0026216, .003277
@histw 1.4514705, 4.3544116, 7.2573528, 10.160294, 13.063235, 15.966176, 18.869118, 21.772058, 24.674999, 27.57794, 30.480881, 33.383823, 36.286762, 39.189705, 42.092648, 44.995586, 47.898529, 50.801468, 53.704411, 56.607349, 59.510292, 62.413235, 65.316177, 71.122055, 74.024994, 76.92794, 79.830879, 97.248528
@type float
@label Blockholdings
@class other
@N_unique .
@N 2628
 
_@NOTES
 
=====numblks=====

numblks:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  426       426          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 2202      2202          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2628      2628          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing        {res}   92
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     8                      2720
   (9 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}numblks {c |}{res}      2628    2.179224     1.61108          0          8
@mean     2.179
@sd     1.611
@min         0
@max         8
@values 0, 1, 2, 3, 4, 5, 6, 7, 8
@names "0", "1", "2", "3", "4", "5", "6", "7", "8"
@freq 426, 493, 746, 496, 226, 146, 56, 28, 11
@type byte
@label 
@class category
@N_unique 9
@N 2628
 
_@NOTES
 
=====group2=====
@freq 224, 278, 227, 316, 419, 62
@values "G0000", "G0510", "G1015", "G1525", "G2550", "G5000"
@type str5
@label 
@class category
@N_unique 6
@N 1526
 
_@NOTES
 
=====sumaflin=====

sumaflin:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2414      2414          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  214         7        207
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2628      2421        207
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}   92
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  97.4                      2720
  (25 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}sumaflin {c |}{res}      2628    1.678185    8.689821          0       97.4
@mean     1.678
@sd     8.690
@min     0.000
@max    97.400
@values 0, 5.3000002, 5.5, 5.9099998, 6.4699998, 7.6999998, 8.1000004, 8.1999998, 8.3000002, 8.5, 9.4399996, 10.5, 10.9, 11.2, 13.8, 14.5, 15.9, 20.32, 22.700001, 24.5, 28.200001, 32.099998, 44.799999, 51, 97.400002
@names "0", "5.300000190734863", "5.5", "5.909999847412109", "6.46999979019165", "7.699999809265137", "8.100000381469727", "8.199999809265137", "8.300000190734863", "8.5", "9.439999580383301", "10.5", "10.89999961853027", "11.19999980926514", "13.80000019073486", "14.5", "15.89999961853027", "20.31999969482422", "22.70000076293945", "24.5", "28.20000076293945", "32.09999847412109", "44.79999923706055", "51", "97.40000152587891"
@freq 2414, 6, 14, 8, 15, 5, 12, 7, 4, 10, 8, 10, 8, 9, 16, 8, 9, 6, 9, 5, 8, 9, 7, 7, 14
@type float
@label 
@class category
@N_unique 25
@N 2628
 
_@NOTES
 
=====sumout=====

sumout:  Outside Blockholdings                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  784       784          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1844       143       1701
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2628       927       1701
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing        {res}   92
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  66.3                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}sumout {c |}{res}      2628    14.24821    13.97874          0       66.3
@mean    14.248
@sd    13.979
@min     0.000
@max    66.300
@example0 0
@histh .15298754, .02380674, .03610038, .01814776, .01775748, .03141708, .03005113, .01717207, .02809975, .01385474, .0152207, .02341646, .02146509, .01326933, .01151309, .00975686, .01034227, .0083909, .00097569, .00409788, .00292706, .00331733, .00117082, .00136596, .00722008, .0015611, .00409788, .00175623, .0015611
@histw .97500002, 4.875, 6.8250003, 8.7750006, 10.725, 12.675, 14.625001, 16.575001, 18.525002, 20.475, 22.425001, 24.375002, 26.325001, 28.275002, 30.225002, 32.175003, 34.125, 36.075001, 38.025002, 39.975002, 41.925003, 43.875004, 45.825001, 47.775002, 49.725002, 53.625004, 61.425003, 63.375004, 65.325005
@type float
@label Outside Blockholdings
@class other
@N_unique .
@N 2628
 
_@NOTES
 
=====sumesop=====

sumesop:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2456      2456          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  172        12        160
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2628      2468        160
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}   92
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 21.25                      2720
  (16 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}sumesop {c |}{res}      2628     .590723    2.427669          0      21.25
@mean     0.591
@sd     2.428
@min     0.000
@max    21.250
@values 0, 5.1700001, 5.1999998, 6.25, 6.5, 6.8000002, 7.2600002, 7.5599999, 7.6999998, 7.8000002, 8, 10.09, 10.2, 13.3, 13.6, 21.25
@names "0", "5.170000076293945", "5.199999809265137", "6.25", "6.5", "6.800000190734863", "7.260000228881836", "7.559999942779541", "7.699999809265137", "7.800000190734863", "8", "10.09000015258789", "10.19999980926514", "13.30000019073486", "13.60000038146973", "21.25"
@freq 2456, 8, 11, 13, 18, 10, 9, 8, 9, 13, 12, 11, 16, 9, 17, 8
@type float
@label 
@class category
@N_unique 16
@N 2628
 
_@NOTES
 
=====sumdir=====

sumdir:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2370      2370          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  258        35        223
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2628      2405        223
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}   92
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  67.7                      2720
  (30 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}sumdir {c |}{res}      2628    2.034056    8.255144          0       67.7
@mean     2.034
@sd     8.255
@min     0.000
@max    67.700
@example0 7.4000001
@histh .45291141, .00840848, .00936399, .00382204, .00229322, .00114661, .00267543, .00267543, .00267543, .00229322, .00305763, .00133771, .00210212, .00171992, .00191102, .00191102, .00191102
@histw .99558818, 4.977941, 6.9691172, 8.9602938, 10.95147, 12.942646, 16.924999, 18.916176, 20.907352, 26.88088, 30.863234, 34.845585, 36.836761, 44.801468, 50.774998, 54.757351, 66.704407
@type float
@label 
@class other
@N_unique 30
@N 2628
 
_@NOTES
 
=====sumoff=====

sumoff:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2192      2192          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  436        66        370
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2628      2258        370
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing        {res}   92
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 80.57                      2720
  (49 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}sumoff {c |}{res}      2628    3.493756      10.825          0      80.57
@mean     3.494
@sd    10.825
@min     0.000
@max    80.570
@example0 0
@histh .35198224, .01910852, .00449612, .00545958, .00802879, .00706534, .00240864, .00417497, .00224806, .00144518, .0006423, .00224806, .00545958, .00240864, .00096346, .00080288, .00144518, .00160576
@histw 1.184853, 5.9242649, 8.2939701, 10.663676, 13.033382, 17.772795, 20.1425, 22.512205, 24.881912, 29.621323, 31.99103, 34.360737, 43.839558, 50.948677, 55.688087, 65.166908, 67.536621, 79.385147
@type float
@label 
@class other
@N_unique 49
@N 2628
 
_@NOTES
 
=====numaflin=====

numaflin:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2414      2414          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  214       214          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2628      2628          -
{txt}{c |}  {res}#   .   .                 {txt}Missing        {res}   92
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     2                      2720
   (3 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}numaflin {c |}{res}      2628    .0955099    .3385109          0          2
@mean     0.096
@sd     0.339
@min         0
@max         2
@values 0, 1, 2
@names "0", "1", "2"
@freq 2414, 177, 37
@type byte
@label 
@class category
@N_unique 3
@N 2628
 
_@NOTES
 
=====numout=====

numout:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  784       784          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1844      1844          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 2628      2628          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing        {res}   92
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     7                      2720
   (8 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}numout {c |}{res}      2628    1.682648    1.549013          0          7
@mean     1.683
@sd     1.549
@min         0
@max         7
@values 0, 1, 2, 3, 4, 5, 6, 7
@names "0", "1", "2", "3", "4", "5", "6", "7"
@freq 784, 519, 606, 375, 234, 56, 28, 26
@type byte
@label 
@class category
@N_unique 8
@N 2628
 
_@NOTES
 
=====numesop=====

numesop:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2456      2456          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  172       172          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2628      2628          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}   92
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}numesop {c |}{res}      2628     .065449    .2473635          0          1
@mean     0.065
@sd     0.247
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2456, 172
@type byte
@label 
@class dummy
@N_unique 2
@N 2628
 
_@NOTES
 
=====numdir=====

numdir:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2370      2370          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  258       258          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2628      2628          -
{txt}{c |}  {res}#   .   .   .             {txt}Missing        {res}   92
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     3                      2720
   (4 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}numdir {c |}{res}      2628    .1229072    .4208593          0          3
@mean     0.123
@sd     0.421
@min         0
@max         3
@values 0, 1, 2, 3
@names "0", "1", "2", "3"
@freq 2370, 219, 13, 26
@type byte
@label 
@class category
@N_unique 4
@N 2628
 
_@NOTES
 
=====numoff=====

numoff:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2192      2192          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  436       436          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2628      2628          -
{txt}{c |}  {res}#   .   .   .             {txt}Missing        {res}   92
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     3                      2720
   (4 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}numoff {c |}{res}      2628    .2127093    .5336401          0          3
@mean     0.213
@sd     0.534
@min         0
@max         3
@values 0, 1, 2, 3
@names "0", "1", "2", "3"
@freq 2192, 344, 61, 31
@type byte
@label 
@class category
@N_unique 4
@N 2628
 
_@NOTES
 
=====firm_id=====

firm_id:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #           #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Positive       {res} 1526      1526          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res} 1526      1526          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing        {res} 1194
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}20                 7644                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}firm_id {c |}{res}      1526    3819.303    2383.622         20       7644
@mean  3819.303
@sd  2383.622
@min        20
@max      7644
@example0 6237
@histh .00018652, .00016254, .00012257, .00016787, .00015721, .00013056, .00007194, .00019984, .00015188, .00008527, .00020784, .00005063, .00011458, .00021583, .00005596, .0000373, .00011191, .00014122, .00006128, .00007461, .00005862, .00010125, .0001732, .00014389, .00015721, .00017853, .00008793, .00016787, .00011191, .0001279, .00025047
@histw 142.96774, 388.90323, 634.83868, 880.77417, 1126.7097, 1372.6451, 1618.5807, 1864.5161, 2110.4517, 2356.3872, 2602.3225, 2848.2581, 3094.1936, 3340.1292, 3586.0645, 3832, 4077.9355, 4323.8711, 4569.8066, 4815.7417, 5061.6772, 5307.6128, 5553.5483, 5799.4839, 6045.4194, 6291.355, 6537.2905, 6783.2256, 7029.1611, 7275.0967, 7521.0322
@type int
@label 
@class other
@N_unique .
@N 1526
 
_@NOTES
 
=====b_meeting_d=====

b_meeting_d:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2720
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2720
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}b_meeting_d {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type float
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====companyname=====
@example0 
@type str36
@label Company Name
@class string
@N_unique 117
@N 1102
 
_@NOTES
 
=====v17=====

v17:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2720
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2720
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v17 {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====v18=====

v18:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2720
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2720
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v18 {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====v19=====

v19:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2720
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2720
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v19 {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====v20=====

v20:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2720
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2720
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v20 {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====v21=====

v21:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                            Negative           {res}-         -          -
{txt}{c |}                            Zero               {res}-         -          -
{txt}{c |}                            Positive           {res}-         -          -
{txt}{c |}                                           {hline 5}     {hline 5}      {hline 5}
{c |}                            Total              {res}-         -          -
{txt}{c |}                            Missing        {res} 2720
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.             -9.0e+307                      2720
   (0 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}v21 {c |}{res}         0
@mean         .
@sd 
@min 
@max 
@example0 .
@type byte
@label 
@class empty
@N_unique 0
@N 0
 
_@NOTES
 
=====sumoutblock=====

sumoutblock:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  599       599          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2029       202       1827
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2628       801       1827
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing        {res}   92
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  98.7                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}sumoutblock {c |}{res}      2628    17.96045    17.66507          0       98.7
@mean    17.960
@sd    17.665
@min     0.000
@max    98.700
@example0 30.1
@histh .07851692, .01808904, .02792004, .01743364, .03761996, .01861336, .02503628, .013108, .02005524, .01743364, .01271476, .01415664, .00760264, .00380132, .0019662, .0072094, .0045878, .00314592, .00104864, .00091756, .0013108, .00367024, .003277, .0006554, .0013108, .003277
@histw 1.4514705, 4.3544116, 7.2573528, 10.160294, 13.063235, 15.966176, 18.869118, 21.772058, 24.674999, 27.57794, 30.480881, 33.383823, 36.286762, 39.189705, 42.092648, 44.995586, 47.898529, 50.801468, 53.704411, 56.607349, 59.510292, 62.413235, 65.316177, 74.024994, 79.830879, 97.248528
@type float
@label 
@class other
@N_unique .
@N 2628
 
_@NOTES
 
=====finst=====

finst:                                          {txt}Number of Observations
{hline 8}                                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2441      2441          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  279       279          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}finst {c |}{res}      2720    .1025735    .3034568          0          1
@mean     0.103
@sd     0.303
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2441, 279
@type byte
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====yeara=====

yeara:                                          {txt}Number of Observations
{hline 8}                                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2720      2720          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1996               2002                      2720
   (7 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}yeara {c |}{res}      2720    1999.918    1.734266       1996       2002
@mean  1999.918
@sd     1.734
@min      1996
@max      2002
@values 1996, 1997, 1998, 1999, 2000, 2001, 2002
@names "1996", "1997", "1998", "1999", "2000", "2001", "2002"
@freq 39, 287, 283, 511, 465, 398, 737
@type int
@label 
@class category
@N_unique 7
@N 2720
 
_@NOTES
 
=====year_reported=====

year_reported:  Year_Reported                   {txt}Number of Observations
{hline 29}               {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2720      2720          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1996               2002                      2720
   (7 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
year_repor~d {c |}{res}      2720    1999.915    1.731242       1996       2002
@mean  1999.915
@sd     1.731
@min      1996
@max      2002
@values 1996, 1997, 1998, 1999, 2000, 2001, 2002
@names "1996", "1997", "1998", "1999", "2000", "2001", "2002"
@freq 39, 287, 283, 511, 465, 407, 728
@type int
@label Year_Reported
@class category
@N_unique 7
@N 2720
 
_@NOTES
 
=====total_assets=====

total_assets:  Total_Assets                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2720       832       1888
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720       832       1888
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}17.5            1097190                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
total_assets {c |}{res}      2720    33877.48    114739.2       17.5    1097190
@mean 33877.477
@sd  1.15e+05
@min    17.500
@max  1.10e+06
@example0 3892.71
@histh .00002509, 3.486e-06, 6.266e-07, 3.304e-07, 1.253e-07, 4.557e-07, 2.393e-07, 1.481e-07, 1.253e-07, 1.709e-07, 1.937e-07
@histw 16152.39, 48422.168, 80691.945, 112961.73, 145231.5, 242040.84, 274310.63, 371119.97, 435659.53, 758357.31, 1081055.1
@type float
@label Total_Assets
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====GNPDEF=====

GNPDEF:  (mean) GNPDEF                          {txt}Number of Observations
{hline 22}                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#           #         {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#           #         {txt}Positive       {res} 2720         -       2720
{txt}{c |}      {res}#           #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #       #         {txt}Total          {res} 2720         -       2720
{txt}{c |}  {res}#   #   #   .   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}93.85725        104.176                      2720
   (7 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}GNPDEF {c |}{res}      2720    99.49805    3.299875   93.85725    104.176
@mean    99.498
@sd     3.300
@min    93.857
@max   104.176
@values 93.85725, 95.41575, 96.47025, 97.863, 99.9965, 102.3955, 104.176
@names "93.85724999999999", "95.41575", "96.47025000000001", "97.863", "99.9965", "102.3955", "104.176"
@freq 129, 319, 338, 562, 408, 416, 548
@type double
@label (mean) GNPDEF
@class category
@N_unique 7
@N 2720
 
_@NOTES
 
=====totassets=====

totassets:  Total Assets                        {txt}Number of Observations
{hline 24}                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2720        28       2692
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720        28       2692
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}17.0906         1053208                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}totassets {c |}{res}      2720     33454.3    111584.6    17.0906    1053208
@mean 33454.304
@sd  1.12e+05
@min    17.091
@max  1.05e+06
@example0 4035.1404
@histh .00002593, 3.834e-06, 4.747e-07, 5.222e-07, 1.306e-07, 1.543e-07, 5.697e-07, 1.543e-07, 1.306e-07, 1.780e-07, 2.018e-07
@histw 15505.192, 46481.395, 77457.602, 108433.8, 139410, 232338.61, 263314.81, 387219.63, 418195.84, 727957.88, 1037719.9
@type float
@label Total Assets
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====cara=====

cara:  Cumulative Abnormal Returns              {txt}Number of Observations
{hline 34}          {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative       {res} 1721         -       1721
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res}  999         -        999
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 2720         -       2720
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}-2.291043      3.981041                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}cara {c |}{res}      2720   -.2016032    .7987461  -2.291043   3.981041
@mean    -0.202
@sd     0.799
@min    -2.291
@max     3.981
@example0 -.38469008
@histh .03388029, .11559156, .07971832, .08171128, .18135917, .14747889, .29695073, .49624652, .5161761, .59390146, .66764092, .64970428, .41852117, .37467611, .22919017, .19530988, .0378662, .04982395, .08370423, .03388029, .02790141, .01793662, .01395071, .04185212, .00797183, .01594366, .01195775
@histw -2.1988068, -2.0143337, -1.8298607, -1.4609146, -1.2764416, -1.0919684, -.90749538, -.72302234, -.53854924, -.35407621, -.16960315, .01486992, .19934298, .38381603, .5682891, .7527622, .93723524, 1.1217083, 1.3061813, 1.4906545, 1.6751275, 1.8596005, 2.2285466, 2.4130197, 2.5974927, 2.966439, 3.8888042
@type double
@label Cumulative Abnormal Returns
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====defendant_PRI=====

defendant_PRI:  Named as Defendant (0/1)        {txt}Number of Observations
{hline 41}   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2062      2062          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  632       632          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2694      2694          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}   26
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
defendant_~I {c |}{res}      2694    .2345954    .4238243          0          1
@mean     0.235
@sd     0.424
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2062, 632
@type float
@label Named as Defendant (0/1) 
@class dummy
@N_unique 2
@N 2694
 
_@NOTES
 
=====ins_trade_PRI=====

ins_trade_PRI:  Insider trading alleged         {txt}Number of Observations
{hline 39}     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1891      1891          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  203       203          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2094      2094          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  626
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
ins_trade_~I {c |}{res}      2094    .0969436    .2959517          0          1
@mean     0.097
@sd     0.296
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1891, 203
@type float
@label Insider trading alleged
@class dummy
@N_unique 2
@N 2094
 
_@NOTES
 
=====defendant_ANY=====

defendant_ANY:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2030      2030          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  664       664          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2694      2694          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}   26
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
defendant_~Y {c |}{res}      2694    .2464736    .4310375          0          1
@mean     0.246
@sd     0.431
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2030, 664
@type float
@label 
@class dummy
@N_unique 2
@N 2694
 
_@NOTES
 
=====ins_trade_ANY=====

ins_trade_ANY:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1889      1889          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  210       210          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2099      2099          -
{txt}{c |}  {res}#   .                     {txt}Missing        {res}  621
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
ins_trade_~Y {c |}{res}      2099    .1000476     .300135          0          1
@mean     0.100
@sd     0.300
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1889, 210
@type float
@label 
@class dummy
@N_unique 2
@N 2099
 
_@NOTES
 
=====_merge=====

_merge:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2720      2720          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3                                            2720
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}_merge {c |}{res}      2720           3           0          3          3
@mean         3
@sd     0.000
@min         3
@max         3
@values 3
@type byte
@label 
@class constant
@N_unique 1
@N 2720
 
_@NOTES
 
=====last=====

last:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2441      2441          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  279       279          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}last {c |}{res}      2720    .1025735    .3034568          0          1
@mean     0.103
@sd     0.303
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2441, 279
@type float
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====length=====

length:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero           {res}  389       389          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2331      2331          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}                  {res}#         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     4                      2720
   (5 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}length {c |}{res}      2720    2.718015     1.52468          0          4
@mean     2.718
@sd     1.525
@min     0.000
@max     4.000
@values 0, 1, 2, 3, 4
@names "0", "1", "2", "3", "4"
@freq 389, 329, 331, 282, 1389
@type float
@label 
@class category
@N_unique 5
@N 2720
 
_@NOTES
 
=====survived=====

survived:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1158      1158          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1562      1562          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}survived {c |}{res}      2720    .5742647    .4945449          0          1
@mean     0.574
@sd     0.495
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1158, 1562
@type float
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====restate=====

restate:  Restatement of financials (0/1)       {txt}Number of Observations
{hline 42}  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2128      2128          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  592       592          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}restate {c |}{res}      2720    .2176471     .412722          0          1
@mean     0.218
@sd     0.413
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2128, 592
@type byte
@label Restatement of financials (0/1) 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====gaap=====

gaap:  Violation of GAAP                        {txt}Number of Observations
{hline 24}                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1484      1484          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1236      1236          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}gaap {c |}{res}      2720    .4544118    .4980089          0          1
@mean     0.454
@sd     0.498
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1484, 1236
@type byte
@label Violation of GAAP
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====pgaap=====

pgaap:  Other GAAP (0/1)                        {txt}Number of Observations
{hline 25}                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2030      2030          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  690       690          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}pgaap {c |}{res}      2720    .2536765    .4351946          0          1
@mean     0.254
@sd     0.435
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2030, 690
@type float
@label Other GAAP (0/1) 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====insider1=====

insider1:  Director Status                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1736      1736          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  984       984          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

      {txt}insider1 is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}insider1 {c |}{res}      2720    .3617647    .4805995          0          1
@mean     0.362
@sd     0.481
@min         0
@max         1
@values 0, 1
@names "Outside Directors", "Inside Directors"
@freq 1736, 984
@type byte
@label Director Status
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====insider2=====

insider2:  Director Status                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2016      2016          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  704       704          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

      {txt}insider2 is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}insider2 {c |}{res}      2720    .2588235     .438069          0          1
@mean     0.259
@sd     0.438
@min         0
@max         1
@values 0, 1
@names "Outside Directors", "Inside Directors"
@freq 2016, 704
@type byte
@label Director Status
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====insider=====

insider:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1736      1736          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  984       984          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}insider {c |}{res}      2720    .3617647    .4805995          0          1
@mean     0.362
@sd     0.481
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1736, 984
@type byte
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====employ=====

employ:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2431      2431          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  289       289          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}employ {c |}{res}      2720      .10625     .308214          0          1
@mean     0.106
@sd     0.308
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2431, 289
@type byte
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====othins=====

othins:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2299      2299          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  421       421          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}othins {c |}{res}      2720    .1547794    .3617608          0          1
@mean     0.155
@sd     0.362
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2299, 421
@type byte
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====iota=====

iota:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2720      2720          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                                            2720
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}iota {c |}{res}      2720           1           0          1          1
@mean         1
@sd     0.000
@min         1
@max         1
@values 1
@type byte
@label 
@class constant
@N_unique 1
@N 2720
 
_@NOTES
 
=====boardseats=====

boardseats:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2720      2720          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}4                    27                      2720
  (18 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}boardseats {c |}{res}      2720    10.81103    3.649748          4         27
@mean    10.811
@sd     3.650
@min     4.000
@max    27.000
@values 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 21, 22, 27
@names "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "21", "22", "27"
@freq 12, 35, 150, 266, 304, 396, 280, 319, 192, 143, 182, 255, 64, 34, 18, 21, 22, 27
@type float
@label 
@class category
@N_unique 18
@N 2720
 
_@NOTES
 
=====insideseats=====

insideseats:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 2720      2720          -
{txt}{c |}  {res}#   #   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    11                      2720
  (11 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}insideseats {c |}{res}      2720    3.824632    2.145785          1         11
@mean     3.825
@sd     2.146
@min     1.000
@max    11.000
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"
@freq 330, 551, 461, 526, 266, 290, 119, 73, 59, 29, 16
@type float
@label 
@class category
@N_unique 11
@N 2720
 
_@NOTES
 
=====outsideseats=====

outsideseats:                                   {txt}Number of Observations
{hline 15}                             {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2720      2720          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    19                      2720
  (17 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
outsideseats {c |}{res}      2720    6.986397    3.183172          1         19
@mean     6.986
@sd     3.183
@min     1.000
@max    19.000
@values 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 19
@names "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "19"
@freq 11, 139, 178, 286, 314, 433, 293, 273, 280, 162, 146, 71, 36, 33, 16, 22, 27
@type float
@label 
@class category
@N_unique 17
@N 2720
 
_@NOTES
 
=====outfrac=====

outfrac:  Proportion of Outside Directors       {txt}Number of Observations
{hline 41}   {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #   #         {txt}Positive       {res} 2720         -       2720
{txt}{c |}          {res}#   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #   #         {txt}Total          {res} 2720         -       2720
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.1666667          .9375                      2720
  (56 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}outfrac {c |}{res}      2720    .6382353    .1763205   .1666667      .9375
@mean     0.638
@sd     0.176
@min     0.167
@max     0.938
@example0 .22222222
@histh .0972973, .24324325, .2918919, .12972973, .95675677, .47027028, 1.4108108, .35675675, .51891893, .97297299, 1.5891892, 1.4108108, .45405406, 2.7243242, .92432433, 3.5027027, 2.3351352, 2.0108109, 1.2324325, 3.1621621, 1.7189189, 3.4864864, 2.0108109, 2.0270271, 1.945946, 1.2486486, 1.2810811, 1.4918919, 1.6378379, 1.3621621, 1.1027027
@histw .17800246, .20067403, .22334559, .24601716, .29136029, .31403187, .33670345, .359375, .38204658, .40471813, .42738971, .45006129, .47273284, .49540442, .54074752, .5634191, .60876226, .63143384, .65410537, .67677695, .69944853, .72212011, .74479169, .76746321, .79013479, .81280637, .83547795, .85814953, .88082105, .90349263, .92616421
@type float
@label Proportion of Outside Directors
@class other
@N_unique 56
@N 2720
 
_@NOTES
 
=====nceo=====

nceo:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}   41        41          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 2679      2679          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}.   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}nceo {c |}{res}      2720    .9849265    .1218679          0          1
@mean     0.985
@sd     0.122
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 41, 2679
@type float
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====audit=====

audit:  Member Audit Committee (0/1)            {txt}Number of Observations
{hline 37}       {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1715      1715          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1005      1005          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}audit {c |}{res}      2720    .3694853    .4827542          0          1
@mean     0.369
@sd     0.483
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1715, 1005
@type float
@label Member Audit Committee (0/1) 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====audithard=====

audithard:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2251      2251          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  469       469          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}audithard {c |}{res}      2720    .1724265    .3778201          0          1
@mean     0.172
@sd     0.378
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2251, 469
@type float
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====entrench=====

entrench:  Log(Board Tenure)                    {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero           {res}  133       133          -
{txt}{c |}          {res}#                 {txt}Positive       {res} 2587         -       2587
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #             {txt}Total          {res} 2720       133       2587
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0               3.89182                      2720
  (44 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}entrench {c |}{res}      2720    1.806807    .8225919          0    3.89182
@mean     1.807
@sd     0.823
@min     0.000
@max     3.892
@example0 2.9957323
@histh .427178, .90895772, .86077976, .88005096, .73872888, .67449158, .54601699, .47856784, .43038988, .72909331, .29227969, .27622038, .33403394, .3179746, .22804239, .13489832, .1638051, .10599153, .08350848, .05781357, .04817797, .00963559, .00963559
@histw .05723265, .74402446, 1.0874203, 1.4308163, 1.6597469, 1.7742121, 2.0031428, 2.1176081, 2.2320733, 2.3465385, 2.461004, 2.5754693, 2.6899345, 2.8043997, 2.9188652, 3.0333304, 3.1477957, 3.2622612, 3.3767264, 3.4911916, 3.6056569, 3.7201223, 3.8345876
@type float
@label Log(Board Tenure)
@class other
@N_unique 44
@N 2720
 
_@NOTES
 
=====tenure=====

tenure:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2720      2714          6
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2714          6
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                    49                      2720
  (44 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}tenure {c |}{res}      2720    8.335699    6.816938          1         49
@mean     8.336
@sd     6.817
@min     1.000
@max    49.000
@example0 20
@histh .10833333, .06979167, .13124999, .0546875, .08151042, .03645833, .03359375, .04921875, .02239583, .02708333, .01145833, .01432292, .01848958, .00546875, .00963542, .00442708, .0046875, .00677083, .00182292, .003125, .00364583, .00182292, .00208333, .00078125, .00208333, .00078125, .00104167, .00026042, .00052083, .00052083, .00026042
@histw 1.7058823, 3.1176472, 4.5294118, 5.9411764, 7.352941, 8.7647057, 10.176471, 11.588235, 13, 14.411765, 15.823529, 17.235294, 18.647058, 20.058823, 21.470589, 22.882353, 24.294117, 25.705883, 27.117647, 28.529411, 29.941177, 31.352942, 32.764706, 34.176472, 35.588234, 37, 38.411766, 39.823528, 42.64706, 45.470589, 48.294117
@type float
@label 
@class other
@N_unique 44
@N 2720
 
_@NOTES
 
=====dismissed=====

dismissed:  Suit dismissed                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1683      1683          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1037      1037          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}dismissed {c |}{res}      2720      .38125    .4857831          0          1
@mean     0.381
@sd     0.486
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 1683, 1037
@type float
@label Suit dismissed
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====ongoing=====

ongoing:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2420      2420          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  300       300          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}ongoing {c |}{res}      2720    .1102941    .3133136          0          1
@mean     0.110
@sd     0.313
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2420, 300
@type float
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====csettled=====

csettled:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Zero           {res} 1337      1337          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1383      1383          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

      {txt}csettled is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}csettled {c |}{res}      2720    .5084559    .5000204          0          1
@mean     0.508
@sd     0.500
@min     0.000
@max     1.000
@values 0, 1
@names "N", "Y"
@freq 1337, 1383
@type float
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====notdis=====

notdis:  Suit Settled/Ongoing                   {txt}Number of Observations
{hline 29}               {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res} 1037      1037          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 1683      1683          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

      {txt}notdis is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}notdis {c |}{res}      2720      .61875    .4857831          0          1
@mean     0.619
@sd     0.486
@min     0.000
@max     1.000
@values 0, 1
@names "N", "Y"
@freq 1037, 1683
@type float
@label Suit Settled/Ongoing
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====settledhard=====

settledhard:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1961      1961          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  759       759          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

      {txt}settledhard is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}settledhard {c |}{res}      2720    .2790441    .4486117          0          1
@mean     0.279
@sd     0.449
@min         0
@max         1
@values 0, 1
@names "N", "Y"
@freq 1961, 759
@type byte
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====dismissedhard=====

dismissedhard:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2331      2331          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  389       389          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

      {txt}dismissedhard is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
dismissedh~d {c |}{res}      2720    .1430147    .3501522          0          1
@mean     0.143
@sd     0.350
@min         0
@max         1
@values 0, 1
@names "N", "Y"
@freq 2331, 389
@type byte
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====settledres=====

settledres:                                     {txt}Number of Observations
{hline 13}                               {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2296      2296          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  424       424          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

      {txt}settledres is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}settledres {c |}{res}      2720    .1558824    .3628105          0          1
@mean     0.156
@sd     0.363
@min         0
@max         1
@values 0, 1
@names "N", "Y"
@freq 2296, 424
@type byte
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====dismissedres=====

dismissedres:                                   {txt}Number of Observations
{hline 15}                             {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2592      2592          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  128       128          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

      {txt}dismissedres is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
dismissedres {c |}{res}      2720    .0470588    .2118036          0          1
@mean     0.047
@sd     0.212
@min         0
@max         1
@values 0, 1
@names "N", "Y"
@freq 2592, 128
@type byte
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====settledgaap=====

settledgaap:                                    {txt}Number of Observations
{hline 14}                              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1984      1984          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  736       736          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

      {txt}settledgaap is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}settledgaap {c |}{res}      2720    .2705882    .4443454          0          1
@mean     0.271
@sd     0.444
@min         0
@max         1
@values 0, 1
@names "N", "Y"
@freq 1984, 736
@type byte
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====dismissedgaap=====

dismissedgaap:                                  {txt}Number of Observations
{hline 16}                            {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2345      2345          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  375       375          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

      {txt}dismissedgaap is labeled and all values are documented in the label.

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
dismissedg~p {c |}{res}      2720    .1378676    .3448244          0          1
@mean     0.138
@sd     0.345
@min         0
@max         1
@values 0, 1
@names "N", "Y"
@freq 2345, 375
@type byte
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====filing_y=====

filing_y:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}                  {res}#         {txt}Negative           {res}-         -          -
{txt}{c |}                  {res}#         {txt}Zero               {res}-         -          -
{txt}{c |}                  {res}#         {txt}Positive       {res} 2720      2720          -
{txt}{c |}                  {res}#                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1996               2002                      2720
   (7 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}filing_y {c |}{res}      2720    1999.925    1.729347       1996       2002
@mean  1999.925
@sd     1.729
@min      1996
@max      2002
@values 1996, 1997, 1998, 1999, 2000, 2001, 2002
@names "1996", "1997", "1998", "1999", "2000", "2001", "2002"
@freq 39, 279, 291, 502, 474, 398, 737
@type int
@label 
@class category
@N_unique 7
@N 2720
 
_@NOTES
 
=====FY1997=====

FY1997:  filing_y==  1997.0000                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2441      2441          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  279       279          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}FY1997 {c |}{res}      2720    .1025735    .3034568          0          1
@mean     0.103
@sd     0.303
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2441, 279
@type byte
@label filing_y==  1997.0000
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====FY1998=====

FY1998:  filing_y==  1998.0000                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2429      2429          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  291       291          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}FY1998 {c |}{res}      2720    .1069853    .3091514          0          1
@mean     0.107
@sd     0.309
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2429, 291
@type byte
@label filing_y==  1998.0000
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====FY1999=====

FY1999:  filing_y==  1999.0000                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2218      2218          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  502       502          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}FY1999 {c |}{res}      2720    .1845588    .3880106          0          1
@mean     0.185
@sd     0.388
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2218, 502
@type byte
@label filing_y==  1999.0000
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====FY2000=====

FY2000:  filing_y==  2000.0000                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2246      2246          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  474       474          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}FY2000 {c |}{res}      2720    .1742647    .3794067          0          1
@mean     0.174
@sd     0.379
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2246, 474
@type byte
@label filing_y==  2000.0000
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====FY2001=====

FY2001:  filing_y==  2001.0000                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2322      2322          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  398       398          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}FY2001 {c |}{res}      2720    .1463235    .3534953          0          1
@mean     0.146
@sd     0.353
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 2322, 398
@type byte
@label filing_y==  2001.0000
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====FY2002=====

FY2002:  filing_y==  2002.0000                  {txt}Number of Observations
{hline 30}              {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1983      1983          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  737       737          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}FY2002 {c |}{res}      2720    .2709559    .4445351          0          1
@mean     0.271
@sd     0.445
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1983, 737
@type byte
@label filing_y==  2002.0000
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====pcdamages=====

pcdamages:                                      {txt}Number of Observations
{hline 12}                                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1663      1663          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1057         -       1057
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      1663       1057
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0              3571.428                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}pcdamages {c |}{res}      2720    15.11327    216.1996          0   3571.428
@mean    15.113
@sd   216.200
@min     0.000
@max  3571.428
@example0 0
@histh .009485, .000035
@histw 52.521008, 3518.9075
@type float
@label 
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====damages=====

damages:                                        {txt}Number of Observations
{hline 10}                                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2503      2503          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  217       217          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}damages {c |}{res}      2720    .0797794    .2710012          0          1
@mean     0.080
@sd     0.271
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2503, 217
@type float
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====notdis_inst=====

notdis_inst:  Settled/Ongoing x Inst.Holdin     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1067      1067          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1646        79       1567
{txt}{c |}  {res}#           #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#       #   #             {txt}Total          {res} 2713      1146       1567
{txt}{c |}  {res}#   .   #   #   #         {txt}Missing        {res}    7
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 98.09                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}notdis_inst {c |}{res}      2713    37.85598    33.53085          0      98.09
@mean    37.856
@sd    33.531
@min     0.000
@max    98.090
@example0 0
@histh .1363229, .00127763, .00127763, .00255526, .00191644, .00485499, .00114987, .00408841, .00166092, .00523827, .00792129, .00472722, .00574933, .007538, .01392614, .01839784, .01239299, .01213747, .01252075, .0154593, .01022102, .01047655, .00728248, .00817682, .01622587, .00932668, .00383288, .00472722, .00293854, .00229973
@histw 1.4425, 4.3274999, 15.867499, 21.637499, 24.522499, 27.407499, 30.2925, 33.177498, 36.0625, 38.947498, 41.832497, 44.717499, 47.602497, 50.487499, 53.372498, 56.2575, 59.142498, 62.027496, 64.912498, 67.797501, 70.682495, 73.567497, 76.452499, 79.337494, 82.222496, 85.107498, 87.9925, 90.877495, 93.762497, 96.647499
@type float
@label Settled/Ongoing x Inst.Holdings 
@class other
@N_unique .
@N 2713
 
_@NOTES
 
=====notdis_block=====

notdis_block:  Settled/Ongoing x Blockholdi     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1553      1553          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1075        96        979
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2628      1649        979
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing        {res}   92
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                  66.3                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
notdis_block {c |}{res}      2628    8.537694     13.1626          0       66.3
@mean     8.538
@sd    13.163
@min     0.000
@max    66.300
@example0 0
@histh .30304801, .01073254, .01990399, .00975686, .01268392, .02107481, .02009913, .01151309, .01307419, .00780549, .00487843, .01287905, .01229364, .00624439, .00780549, .00702494, .00390274, .0052687, .00097569, .00253678, .00292706, .00331733, .00117082, .00136596, .0052687, .0015611, .00214651, .0015611
@histw .97500002, 4.875, 6.8250003, 8.7750006, 10.725, 12.675, 14.625001, 16.575001, 18.525002, 20.475, 22.425001, 24.375002, 26.325001, 28.275002, 30.225002, 32.175003, 34.125, 36.075001, 38.025002, 39.975002, 41.925003, 43.875004, 45.825001, 47.775002, 49.725002, 53.625004, 61.425003, 65.325005
@type float
@label Settled/Ongoing x Blockholdings 
@class other
@N_unique .
@N 2628
 
_@NOTES
 
=====notdis_outfrac=====

notdis_outfrac:  Settled/Ongoing x Prop. OD     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1037      1037          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 1683         -       1683
{txt}{c |}  {res}#           #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#       #   #   #         {txt}Total          {res} 2720      1037       1683
{txt}{c |}  {res}#   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 .9375                      2720
  (49 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
notdis_out~c {c |}{res}      2720    .3893382    .3371639          0      .9375
@mean     0.389
@sd     0.337
@min     0.000
@max     0.938
@example0 0
@histh 13.826667, .08, .2, .12, .10666667, .69333333, .38666666, .31999999, .50666666, .60000002, .72000003, 1.04, 1.52, .61333334, 2.1466668, .93333334, .70666665, .66666669, 1.76, .86666667, 1.4400001, 1.52, .60000002, 1.8133334, .56, .58666664, 1.2266667, .70666665
@histw .01378676, .17922795, .20680147, .234375, .26194853, .28952205, .31709558, .3446691, .37224266, .39981619, .42738971, .45496324, .51011032, .53768384, .56525737, .5928309, .62040442, .64797795, .67555147, .703125, .73069853, .75827205, .78584558, .8134191, .84099263, .86856616, .89613968, .92371321
@type float
@label Settled/Ongoing x Prop. OD
@class other
@N_unique 49
@N 2720
 
_@NOTES
 
=====notdis_audit=====

notdis_audit:  Settled/Ongoing x Audit Comm     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2102      2102          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  618       618          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
notdis_audit {c |}{res}      2720    .2272059    .4191037          0          1
@mean     0.227
@sd     0.419
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2102, 618
@type float
@label Settled/Ongoing x Audit Comm. (0/1) 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====notdis_defendant_PRI=====

notdis_defendant_PRI:  Settled/Ongoing x Na     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2269      2269          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  425       425          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2694      2694          -
{txt}{c |}  {res}#   #                     {txt}Missing        {res}   26
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
notdis_def~I {c |}{res}      2694     .157758    .3645816          0          1
@mean     0.158
@sd     0.365
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2269, 425
@type float
@label Settled/Ongoing x Named Def. (0/1) 
@class dummy
@N_unique 2
@N 2694
 
_@NOTES
 
=====age_61_65=====

age_61_65:  Age 61-65 (0/1)                     {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2157      2157          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  563       563          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}age_61_65 {c |}{res}      2720    .2069853    .4052194          0          1
@mean     0.207
@sd     0.405
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2157, 563
@type float
@label Age 61-65 (0/1) 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====age_66_70=====

age_66_70:  Age 66-70 (0/1)                     {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2347      2347          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  373       373          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}age_66_70 {c |}{res}      2720    .1371324    .3440503          0          1
@mean     0.137
@sd     0.344
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2347, 373
@type float
@label Age 66-70 (0/1) 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====age_gt_70=====

age_gt_70:  Age $>$70 (0/1)                     {txt}Number of Observations
{hline 28}                {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2533      2533          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  187       187          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 3}age_gt_70 {c |}{res}      2720      .06875    .2530751          0          1
@mean     0.069
@sd     0.253
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2533, 187
@type float
@label Age $>$70 (0/1) 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====departed=====

departed:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1562      1562          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res} 1158      1158          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}departed {c |}{res}      2720    .4257353    .4945449          0          1
@mean     0.426
@sd     0.495
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1562, 1158
@type byte
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====ceochair=====

ceochair:  CEO and Chairman (0/1)               {txt}Number of Observations
{hline 34}          {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 2531      2531          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  189       189          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   .                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}ceochair {c |}{res}      2720    .0694853    .2543243          0          1
@mean     0.069
@sd     0.254
@min     0.000
@max     1.000
@values 0, 1
@names "0", "1"
@freq 2531, 189
@type float
@label CEO and Chairman (0/1) 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====ltotass=====

ltotass:  Log(Total Assets)                     {txt}Number of Observations
{hline 27}                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Positive       {res} 2720         -       2720
{txt}{c |}      {res}#   #   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res} 2720         -       2720
{txt}{c |}  {res}.   #   #   #   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2.838528       13.86735                      2720
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}ltotass {c |}{res}      2720    8.475001    2.003574   2.838528   13.86735
@mean     8.475
@sd     2.004
@min     2.839
@max    13.867
@example0 8.3027964
@histh .00793376, .00566697, .01586751, .03966878, .01473412, .03966878, .02380127, .09633847, .13600726, .07480399, .1836098, .15300816, .20854446, .16660888, .22327858, .14167422, .16094193, .15300816, .11900635, .19607714, .10767242, .19154355, .19267695, .14734119, .07593738, .04533575, .01700091, .01246733, .06913702, .01473412, .01246733, .01700091, .0192677
@histw 3.0007169, 3.6494713, 3.9738483, 4.2982254, 4.6226029, 4.94698, 5.2713571, 5.5957341, 5.9201112, 6.2444887, 6.5688658, 6.8932428, 7.2176199, 7.541997, 7.866374, 8.1907511, 8.5151281, 8.8395061, 9.1638832, 9.4882603, 9.8126373, 10.137014, 10.461391, 10.785769, 11.110146, 11.434523, 11.7589, 12.083277, 12.407655, 12.732032, 13.056409, 13.380786, 13.705163
@type float
@label Log(Total Assets)
@class other
@N_unique .
@N 2720
 
_@NOTES
 
=====t5s=====

t5s:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero           {res}  984       984          -
{txt}{c |}      {res}#                     {txt}Positive       {res} 1736      1736          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}t5s {c |}{res}      2720    .6382353    .4805995          0          1
@mean     0.638
@sd     0.481
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 984, 1736
@type byte
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====t6s=====

t6s:                                            {txt}Number of Observations
{hline 6}                                      {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res} 1736      1736          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  984       984          -
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#   #                     {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                     1                      2720
   (2 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 9}t6s {c |}{res}      2720    .3617647    .4805995          0          1
@mean     0.362
@sd     0.481
@min         0
@max         1
@values 0, 1
@names "0", "1"
@freq 1736, 984
@type byte
@label 
@class dummy
@N_unique 2
@N 2720
 
_@NOTES
 
=====t56s=====

t56s:                                           {txt}Number of Observations
{hline 7}                                     {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res} 2720      2720          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res} 2720      2720          -
{txt}{c |}  {res}#                         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                                            2720
   (1 unique value)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}t56s {c |}{res}      2720           1           0          1          1
@mean         1
@sd     0.000
@min         1
@max         1
@values 1
@type byte
@label 
@class constant
@N_unique 1
@N 2720
 
_@NOTES
 
{com}. 
. // noi profiler report
. // profiler off
. {c )-}
{txt}
{com}. 
. exit, clear STATA
