{smcl}
{txt}{sf}{ul off}

{com}. /** 
>  * A do file to run the standard stats for a whole data set. 
>  *
>  * Note that you must delete the files in the derived directory
>  * for changes to be reflected in the output.
>  *
>  * @version 0.1
> */
. 
. // profiler on
. 
. cap noi {c -(}
. 
. use  "/Users/mas/Dropbox/Stata_conference_2015/itsp/mcas.dta"
. 
. describe, short

{txt}Contains data from {res}/Users/mas/Dropbox/Stata_conference_2015/itsp/mcas.dta
{txt}  obs:{res}           220                          
{txt} vars:{res}            17                          24 Jul 2008 12:02
{txt} size:{res}        24,200                          
{txt}Sorted by:  {res}municipa
{com}. 
. local N = r(N)
. local variables = r(k)
. 
. di "@N `N'"
{res}@N 220
{com}. di "@variables `variables'"
{res}@variables 17
{com}. 
. datasignature
  {res}220:17(64880):3724306845:3018721080
{com}. local datasig = "`r(datasignature)'"
. 
. di "@datasignature `datasig'"
{res}@datasignature 220:17(64880):3724306845:3018721080
{com}. 
. cap noi xtset
{err}panel variable not set; use {bf:xtset} {it:varname} ...
{com}. if ( !_rc ) {c -(}
.     di "@timevar `r(timevar)'"
.     di "@panelvar `r(panelvar)'"
. {c )-}
. 
. notes _dta
{res}{com}. 
. qui {c -(}
. 
. foreach var of varlist * {c -(}
{txt}  2{com}. 
. di "=====`var'====="
{txt}  3{com}. qui {c -(}
{txt}  4{com}. local category_cutoff = 30
{txt}  5{com}. 
. // this takes very long on large datasets (and does mostly the same as other things below)
. // codebook `var'
. 
. local isstr = ""
{txt}  6{com}. local unique = ""
{txt}  7{com}. local total = ""
{txt}  8{com}. local class = ""
{txt}  9{com}. 
. local type : type `var' 
{txt} 10{com}. local label : variable label `var' 
{txt} 11{com}. 
. local class = "other"
{txt} 12{com}. 
. // test for string
. capture confirm string variable `var'
{txt} 13{com}. if ( !_rc ) {c -(}
{txt} 14{com}.     // we now it is a string
.     local isstr = "YES"
{txt} 15{com}.     capture tab `var', matcell( freq )
{txt} 16{com}.     if ( !_rc ) {c -(}
{txt} 17{com}.     
.         // not too many obs
.         local total = `r(N)'
{txt} 18{com}.         local unique = r(r)
{txt} 19{com}. 
.         if ( `unique' < `category_cutoff' ) {c -(}
{txt} 20{com}.         forvalues i=1/`unique' {c -(}
{txt} 21{com}.             if ( `i' == 1 ) {c -(}
{txt} 22{com}.                 noi di "@freq " _continue
{txt} 23{com}.             {c )-}
{txt} 24{com}.             noi di freq[`i',1] _continue
{txt} 25{com}.             if ( `i' == `unique' ) {c -(}
{txt} 26{com}.                 noi di ""
{txt} 27{com}.             {c )-}
{txt} 28{com}.             else {c -(}
{txt} 29{com}.                 noi di ", " _continue
{txt} 30{com}.             {c )-}
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         levelsof `var', local(levels)
{txt} 33{com}.         local i = 1
{txt} 34{com}.         foreach l of local levels {c -(}
{txt} 35{com}.             if ( `i' == 1 ) {c -(}
{txt} 36{com}.                 noi di "@values " _continue
{txt} 37{com}.             {c )-}
{txt} 38{com}.             noi di `""`l'""' _continue
{txt} 39{com}.             if ( `i' == `unique' ) {c -(}
{txt} 40{com}.                 noi di ""
{txt} 41{com}.             {c )-}
{txt} 42{com}.             else {c -(}
{txt} 43{com}.                 noi di ", " _continue
{txt} 44{com}.             {c )-}
{txt} 45{com}.             local i = `i' + 1
{txt} 46{com}.         {c )-}
{txt} 47{com}.         {c )-}
{txt} 48{com}.         
.         if ( `total' == 0 ) {c -(}
{txt} 49{com}.             local class = "empty"
{txt} 50{com}.         {c )-}
{txt} 51{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 52{com}.             local class = "constant"
{txt} 53{com}.         {c )-}
{txt} 54{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 55{com}.             local class = "dummy"
{txt} 56{com}.         {c )-}
{txt} 57{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 58{com}.             local class = "category"
{txt} 59{com}.         {c )-}
{txt} 60{com}.         else if (`unique' == `total') {c -(}
{txt} 61{com}.             local class = "identifier"
{txt} 62{com}.         {c )-} 
{txt} 63{com}.         else {c -(}
{txt} 64{com}.             local class = "string"
{txt} 65{com}.         {c )-}        
{txt} 66{com}.     {c )-}
{txt} 67{com}.     else {c -(}
{txt} 68{com}.         // lots of observations, not sure what to do yet
.         // should get random samples here
.         noi di "@example0 " `var'[1]
{txt} 69{com}.     {c )-}
{txt} 70{com}. {c )-}
{txt} 71{com}. else {c -(}
{txt} 72{com}.     // else assume it is numeric
. 
.     noi inspect `var'
{txt} 73{com}. 
.     local total = r(N)
{txt} 74{com}.     local unique = r(N_unique)
{txt} 75{com}. 
.     if ( `unique' < `category_cutoff' ) {c -(}
{txt} 76{com}.         local cat = "YES"
{txt} 77{com}.     {c )-}
{txt} 78{com}. 
.     if ( "`unique'" != "." ) {c -(}
{txt} 79{com}.         if ( `total' == 0 ) {c -(}
{txt} 80{com}.             local class = "empty"
{txt} 81{com}.         {c )-}
{txt} 82{com}.         else if ( `unique' == 1 ) {c -(}
{txt} 83{com}.             local class = "constant"
{txt} 84{com}.         {c )-}
{txt} 85{com}.         else if ( `unique' == 2 ) {c -(}
{txt} 86{com}.             local class = "dummy"
{txt} 87{com}.         {c )-}
{txt} 88{com}.         else if ( `unique' < `category_cutoff' & `unique' < `total' ) {c -(}
{txt} 89{com}.             capture confirm string variable `var'
{txt} 90{com}.             if ( !_rc ) {c -(}
{txt} 91{com}.                 local class = "other"
{txt} 92{com}.             {c )-} 
{txt} 93{com}.             else {c -(}
{txt} 94{com}.                 local class = "category"
{txt} 95{com}.             {c )-}
{txt} 96{com}.         {c )-}
{txt} 97{com}.         else if (`r(N_unique)' == `r(N)') {c -(}
{txt} 98{com}.             local class = "identifier"
{txt} 99{com}.         {c )-}
{txt}100{com}.     {c )-}
{txt}101{com}. 
. // TODO this takes too long?   sum `var', detail
.     noi sum `var'
{txt}102{com}.     local min = r(min)
{txt}103{com}.     local max = r(max)
{txt}104{com}.     local nobs = r(N)
{txt}105{com}.     
.     // TODO maybe the precision should be handled later (vm?)
.     if ( ( "`type'" != "double" & "`type'" != "float" ) & "`class'" == "constant" ) {c -(}
{txt}106{com}.         noi di "@mean " %9.0f r(mean)
{txt}107{com}.     {c )-} 
{txt}108{com}.     else {c -(}
{txt}109{com}.         noi di "@mean " %9.3f r(mean)
{txt}110{com}.     {c )-}
{txt}111{com}.     noi di "@sd " %9.3f `r(sd)'
{txt}112{com}.     // noi di "@skewness " %9.3f `r(skewness)'
.     // noi di "@kurtosis " %9.3f `r(kurtosis)'
.     
.     if ( "`type'" == "double" | "`type'" == "float" ) {c -(}
{txt}113{com}.       noi di "@min " %9.3f `r(min)'
{txt}114{com}.       noi di "@max " %9.3f `r(max)'
{txt}115{com}.       // noi di "@p50 " %9.3f `r(p50)'
.     {c )-} 
{txt}116{com}.     else {c -(}
{txt}117{com}.       noi di "@min " %9.0f `r(min)'
{txt}118{com}.       noi di "@max " %9.0f `r(max)'
{txt}119{com}.       // noi di "@p50 " %9.0f `r(p50)'
.     {c )-}
{txt}120{com}. {c )-}
{txt}121{com}. 
. 
. if ( ( "`class'" == "constant" ) & ( "`isstr'"!= "YES" ) ) {c -(}
{txt}122{com}.     noi di "@values " `var'[1]
{txt}123{com}. {c )-}
{txt}124{com}. else if ( "`class'" == "category" | "`class'" == "dummy" ) {c -(}
{txt}125{com}.     cap noi {c -(}
{txt}126{com}.         if ( "`isstr'" != "YES" ) {c -(}
{txt}127{com}.             cap tab `var', matcell( freq ) matrow( name )
{txt}128{com}.             if ( _rc != 0 | ("`r(r)'" != "`unique'") ) {c -(}
{txt}129{com}.                 local class = "other"
{txt}130{com}.                 local unique = r(r)
{txt}131{com}.             {c )-}
{txt}132{com}.             else {c -(}
{txt}133{com}.                 forvalues i=1/`unique' {c -(}
{txt}134{com}.                     if ( `i' == 1 ) {c -(}
{txt}135{com}.                         noi di "@values " _continue
{txt}136{com}.                     {c )-}
{txt}137{com}.                     noi di name[`i',1] _continue
{txt}138{com}.                     if ( `i' == `unique' ) {c -(}
{txt}139{com}.                         noi di ""
{txt}140{com}.                     {c )-}
{txt}141{com}.                     else {c -(}
{txt}142{com}.                         noi di ", " _continue
{txt}143{com}.                     {c )-}
{txt}144{com}.                 {c )-}
{txt}145{com}.                 forvalues i=1/`unique' {c -(}
{txt}146{com}.                     if ( `i' == 1 ) {c -(}
{txt}147{com}.                         noi di "@names " _continue
{txt}148{com}.                     {c )-}
{txt}149{com}.                     local val = name[`i',1]
{txt}150{com}.                     local lab :label (`var') `val'
{txt}151{com}.                     noi di `""`lab'""' _continue
{txt}152{com}.                     if ( `i' == `unique' ) {c -(}
{txt}153{com}.                         noi di ""
{txt}154{com}.                     {c )-}
{txt}155{com}.                     else {c -(}
{txt}156{com}.                         noi di ", " _continue
{txt}157{com}.                     {c )-}
{txt}158{com}.                 {c )-}
{txt}159{com}.                 forvalues i=1/`unique' {c -(}
{txt}160{com}.                     if ( `i' == 1 ) {c -(}
{txt}161{com}.                         noi di "@freq " _continue
{txt}162{com}.                     {c )-}
{txt}163{com}.                     noi di freq[`i',1] _continue
{txt}164{com}.                     if ( `i' == `unique' ) {c -(}
{txt}165{com}.                         noi di ""
{txt}166{com}.                     {c )-}
{txt}167{com}.                     else {c -(}
{txt}168{com}.                         noi di ", " _continue
{txt}169{com}.                     {c )-}
{txt}170{com}.                 {c )-}
{txt}171{com}.             {c )-}
{txt}172{com}.         {c )-}
{txt}173{com}.     {c )-}
{txt}174{com}. {c )-}
{txt}175{com}. else {c -(}
{txt}176{com}.     noi di "@example0 " `var'[1]
{txt}177{com}. {c )-}
{txt}178{com}. 
. // histogram
. if ( "`isstr'" != "YES" & ("`class'" == "other" | "`class'" == "identifier") ) {c -(}
{txt}179{com}. cap noi {c -(}
{txt}180{com}.     tempvar h w
{txt}181{com}.     twoway__histogram_gen `var', gen( `h' `w' )
{txt}182{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}183{com}.         if ( `i' == 1 ) {c -(}
{txt}184{com}.             noi di "@histh " _continue
{txt}185{com}.         {c )-}
{txt}186{com}.         noi di `h'[`i'] _continue
{txt}187{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}188{com}.             noi di ""
{txt}189{com}.         {c )-}
{txt}190{com}.         else {c -(}
{txt}191{com}.             noi di ", " _continue
{txt}192{com}.         {c )-}
{txt}193{com}.     {c )-}
{txt}194{com}.     forvalues i=1/`=r(n_x)' {c -(}
{txt}195{com}.         if ( `i' == 1 ) {c -(}
{txt}196{com}.             noi di "@histw " _continue
{txt}197{com}.         {c )-}
{txt}198{com}.         noi di `w'[`i'] _continue
{txt}199{com}.         if ( `i' == `=r(n_x)' ) {c -(}
{txt}200{com}.             noi di ""
{txt}201{com}.         {c )-}
{txt}202{com}.         else {c -(}
{txt}203{com}.             noi di ", " _continue
{txt}204{com}.         {c )-}
{txt}205{com}.     {c )-}
{txt}206{com}.     {c )-}
{txt}207{com}. {c )-}
{txt}208{com}. 
. noi di "@type `type'"
{txt}209{com}. noi di "@label `label'"
{txt}210{com}. noi di "@class `class'"
{txt}211{com}. noi di "@N_unique `unique'"
{txt}212{com}. noi di "@N `total'"
{txt}213{com}. 
. noi di as res " "
{txt}214{com}. noi di "_@NOTES"
{txt}215{com}. 
. noi notes `var'
{txt}216{com}. 
. noi di as res " "
{txt}217{com}. {c )-}
{txt}218{com}. 
. 
. {c )-}
=====code=====

{res}code:  District Code (numerical)                {txt}Number of Observations
{hline 32}            {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#   #   #       #         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #   #       #         {txt}Positive       {res}  220       220          -
{txt}{c |}  {res}#   #   #   #   #                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #   #   #         {txt}Total          {res}  220       220          -
{txt}{c |}  {res}#   #   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}1                   350                       220
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}code {c |}{res}       220    170.9364    102.7883          1        350
@mean   170.936
@sd   102.788
@min         1
@max       350
@example0 1
@histh .00291743, .00346444, .00273509, .0032821, .00237041, .00309977, .0041938, .00255275, .00309977, .00072936, .00255275, .00309977, .00309977, .00291743
@histw 13.464286, 38.392857, 63.32143, 88.25, 113.17857, 138.10715, 163.03572, 187.96428, 212.89285, 237.82143, 262.75, 287.67856, 312.60715, 337.53571
@type int
@label District Code (numerical)
@class other
@N_unique .
@N 220
 
_@NOTES
 
=====municipa=====
@example0 ABINGTON
@type str29
@label Municipality (name)
@class identifier
@N_unique 220
@N 220
 
_@NOTES
 
=====district=====
@example0 Abington
@type str25
@label District Name
@class identifier
@N_unique 220
@N 220
 
_@NOTES
 
=====regday=====

regday:  Spending per pupil, regular            {txt}Number of Observations
{hline 36}        {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res}  220       220          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res}  220       220          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2905               8759                       220
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}regday {c |}{res}       220    4605.464    880.2524       2905       8759
@mean  4605.464
@sd   880.252
@min      2905
@max      8759
@example0 4201
@histh .00006522, .00020654, .00046743, .00064136, .00041308, .00025002, .00013045, .00008696, .00005435, .00004348, .00001087, .00001087, .00001087
@histw 3114.0715, 3532.2144, 3950.3572, 4368.5, 4786.6431, 5204.7856, 5622.9287, 6041.0713, 6459.2144, 6877.3569, 7713.6431, 8131.7856, 8549.9287
@type int
@label Spending per pupil, regular
@class other
@N_unique .
@N 220
 
_@NOTES
 
=====specneed=====

specneed:  Spending per pupil, special need     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  220         1        219
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  220         1        219
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3832.23        53569.24                       220
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}specneed {c |}{res}       220    8900.727    3511.696    3832.23   53569.24
@mean  8900.727
@sd  3511.696
@min  3832.230
@max 53569.238
@example0 7375.6899
@histh .00006141, .00018808, .00002815, 2.559e-06, 1.279e-06
@histw 5608.5518, 9161.1953, 12713.839, 16266.482, 51792.918
@type float
@label Spending per pupil, special needs
@class other
@N_unique .
@N 220
 
_@NOTES
 
=====bilingua=====

bilingua:  Spending per pupil, bilingual        {txt}Number of Observations
{hline 40}    {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  173       173          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   47        47          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  220       220          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                295140                       220
  (47 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}bilingua {c |}{res}       220    3037.309    20259.26          0     295140
@mean  3037.309
@sd 20259.258
@min         0
@max    295140
@example0 0
@histh .00004657, 6.468e-07, 2.156e-07
@histw 10540.714, 31622.143, 284599.28
@type long
@label Spending per pupil, bilingual
@class other
@N_unique 47
@N 220
 
_@NOTES
 
=====occupday=====

occupday:  Spending per pupil, occupational     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  180       180          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   40        40          -
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  220       220          -
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0                 15088                       220
  (40 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}occupday {c |}{res}       220    1104.209    2732.449          0      15088
@mean  1104.209
@sd  2732.449
@min         0
@max     15088
@example0 0
@histh .00077184, 8.435e-06, 8.435e-06, .00001265, .00003374, .00002531, .00001687, .00002109, 4.218e-06, 8.435e-06, .00001265, 4.218e-06
@histw 538.85712, 1616.5714, 2694.2856, 3772, 4849.7144, 5927.4287, 7005.1431, 8082.8569, 9160.5713, 10238.286, 11316, 14549.143
@type int
@label Spending per pupil, occupational
@class other
@N_unique 40
@N 220
 
_@NOTES
 
=====tot_day=====

tot_day:  Spending per pupil, Total             {txt}Number of Observations
{hline 35}         {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res}  220       220          -
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res}  220       220          -
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}3465               9868                       220
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}tot_day {c |}{res}       220     5370.25    977.0404       3465       9868
@mean  5370.250
@sd   977.040
@min      3465
@max      9868
@example0 4646
@histh .00004969, .00017889, .00046711, .00053668, .00037766, .00023852, .00011926, .00007951, .00005963, .00002982, .00001988, .00001988, 9.939e-06
@histw 3693.6785, 4151.0356, 4608.3931, 5065.75, 5523.1069, 5980.4644, 6437.8213, 6895.1787, 7352.5356, 7809.8931, 8267.25, 8724.6074, 9639.3213
@type int
@label Spending per pupil, Total
@class other
@N_unique .
@N 220
 
_@NOTES
 
=====s_p_c=====

s_p_c:  Students per Computer                   {txt}Number of Observations
{hline 29}               {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res}  211        19        192
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #   #                 {txt}Total          {res}  211        19        192
{txt}{c |}  {res}#   #   #   #   .         {txt}Missing        {res}    9
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}2.3                18.4                       220
  (93 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}s_p_c {c |}{res}       211    8.107109    2.835993        2.3       18.4
@mean     8.107
@sd     2.836
@min     2.300
@max    18.400
@example0 16.6
@histh .00824232, .05357511, .1318772, .11951371, .15660417, .12775603, .11539254, .05769627, .04533279, .01236349, .01648465, .01236349, .00824232, .00412116
@histw 2.875, 4.0250001, 5.1749997, 6.3249998, 7.4749999, 8.625, 9.7749996, 10.925, 12.075, 13.224999, 14.375, 15.525, 16.674999, 17.824999
@type float
@label Students per Computer
@class other
@N_unique 93
@N 211
 
_@NOTES
 
=====spec_ed=====

spec_ed:  % Special Education students          {txt}Number of Observations
{hline 38}      {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#                     {txt}Positive       {res}  220        21        199
{txt}{c |}      {res}#                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res}  220        21        199
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}8.1                34.3                       220
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}spec_ed {c |}{res}       220    15.96773       3.538        8.1       34.3
@mean    15.968
@sd     3.538
@min     8.100
@max    34.300
@example0 14.6
@histh .00728661, .05100625, .08986815, .12630118, .09715476, .07772381, .04857738, .01943095, .00485774, .00971548, .00242887
@histw 9.0357151, 10.907143, 12.778572, 14.65, 16.521429, 18.392857, 20.264286, 22.135714, 24.007143, 25.878571, 33.364285
@type float
@label % Special Education students
@class other
@N_unique .
@N 220
 
_@NOTES
 
=====lnch_pct=====

lnch_pct:  % Eligible for free/reduced pric     {txt}Number of Observations
{hline 43} {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#                         {txt}Positive       {res}  220        15        205
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  220        15        205
{txt}{c |}  {res}#   #   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}.4                 76.2                       220
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}lnch_pct {c |}{res}       220    15.31591    15.06007         .4       76.2
@mean    15.316
@sd    15.060
@min     0.400
@max    76.200
@example0 11.8
@histh .05456944, .04281602, .02938355, .01846966, .01427201, .00671624, .00251859, .00335812, .00251859, .00335812, .00167906, .00335812, .00167906
@histw 3.1071427, 8.5214281, 13.935714, 19.349998, 24.764284, 30.17857, 35.592857, 41.007141, 46.421425, 51.835712, 57.249996, 68.078568, 73.492851
@type float
@label % Eligible for free/reduced price lunch
@class other
@N_unique .
@N 220
 
_@NOTES
 
=====tchratio=====

tchratio:  Students per Teacher                 {txt}Number of Observations
{hline 31}             {hline 30}
                                            Total   Integers   Nonintegers
{c |}      {res}#                     {txt}Negative           {res}-         -          -
{txt}{c |}      {res}#                     {txt}Zero               {res}-         -          -
{txt}{c |}      {res}#   #                 {txt}Positive       {res}  220        27        193
{txt}{c |}      {res}#   #                                {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #                 {txt}Total          {res}  220        27        193
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}11.4                 27                       220
  (83 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}tchratio {c |}{res}       220    17.34409    2.276666       11.4         27
@mean    17.344
@sd     2.277
@min    11.400
@max    27.000
@example0 19
@histh .01223776, .03263403, .05710956, .12645687, .17540792, .18356644, .11421911, .11013985, .04895105, .02447552, .00815851, .00407925
@histw 11.957143, 13.071428, 14.185714, 15.299999, 16.414286, 17.528572, 18.642857, 19.757143, 20.871428, 21.985714, 23.1, 26.442858
@type float
@label Students per Teacher
@class other
@N_unique 83
@N 220
 
_@NOTES
 
=====percap=====

percap:  Per Capita Income                      {txt}Number of Observations
{hline 26}                  {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero               {res}-         -          -
{txt}{c |}  {res}#   #                     {txt}Positive       {res}  220         -        220
{txt}{c |}  {res}#   #                                    {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#   #                     {txt}Total          {res}  220         -        220
{txt}{c |}  {res}#   #   #   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}9.686            46.855                       220
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}percap {c |}{res}       220    18.74676    5.807637      9.686     46.855
@mean    18.747
@sd     5.808
@min     9.686
@max    46.855
@example0 16.379
@histh .01712082, .06677119, .12669404, .07019535, .0376658, .01027249, .01712082, .01369665, .00684833, .00342416, .00171208, .00171208, .00171208, .00171208
@histw 11.013464, 13.668393, 16.323322, 18.978251, 21.633179, 24.288107, 26.943035, 29.597963, 32.252892, 34.907822, 37.562752, 40.217678, 42.872608, 45.527534
@type double
@label Per Capita Income
@class other
@N_unique .
@N 220
 
_@NOTES
 
=====totsc4=====

totsc4:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}              {res}#             {txt}Negative           {res}-         -          -
{txt}{c |}              {res}#             {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#   #             {txt}Positive       {res}  220       220          -
{txt}{c |}          {res}#   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #   #         {txt}Total          {res}  220       220          -
{txt}{c |}  {res}.   .   #   #   #         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}658                 740                       220
  (63 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}totsc4 {c |}{res}       220    709.8273    15.12647        658        740
@mean   709.827
@sd    15.126
@min   658.000
@max   740.000
@example0 714
@histh .00077605, .00155211, .00155211, .00465632, .00232816, .0116408, .01319291, .02250554, .02560976, .03026607, .0232816, .01474501, .0116408, .00698448
@histw 660.92859, 666.78571, 672.64288, 678.5, 684.35712, 690.21429, 696.07141, 701.92859, 707.78571, 713.64288, 719.5, 725.35712, 731.21429, 737.07141
@type float
@label 
@class other
@N_unique 63
@N 220
 
_@NOTES
 
=====totsc8=====

totsc8:                                         {txt}Number of Observations
{hline 9}                                   {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res}  180       180          -
{txt}{c |}          {res}#   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}      {res}#   #   #             {txt}Total          {res}  180       180          -
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing        {res}   40
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}641                 747                       220
  (72 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 6}totsc8 {c |}{res}       180    698.4111    21.05268        641        747
@mean   698.411
@sd    21.053
@min   641.000
@max   747.000
@example0 691
@histh .00204403, .00340671, .00272537, .00613208, .00885744, .01567086, .02316562, .01703354, .01498952, .01226415, .01022013, .00272537, .00340671
@histw 645.0769, 653.23077, 661.38464, 669.53845, 677.69232, 685.84613, 694, 702.15387, 710.30768, 718.46155, 726.61536, 734.76923, 742.9231
@type float
@label 
@class other
@N_unique 72
@N 180
 
_@NOTES
 
=====avgsalry=====

avgsalry:                                       {txt}Number of Observations
{hline 11}                                 {hline 30}
                                            Total   Integers   Nonintegers
{c |}          {res}#                 {txt}Negative           {res}-         -          -
{txt}{c |}          {res}#                 {txt}Zero               {res}-         -          -
{txt}{c |}          {res}#                 {txt}Positive       {res}  195         -        195
{txt}{c |}          {res}#   #                            {txt}{hline 5}     {hline 5}      {hline 5}
{c |}          {res}#   #             {txt}Total          {res}  195         -        195
{txt}{c |}  {res}.   #   #   #   #         {txt}Missing        {res}   25
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}24.965           44.494                       220
(More than 99 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 4}avgsalry {c |}{res}       195     35.9927    3.190556     24.965     44.494
@mean    35.993
@sd     3.191
@min    24.965
@max    44.494
@example0 34.360001
@histh .00341373, .00341373, .00341373, .01024118, .06144708, .11265298, .1024118, .12630789, .10923926, .06144708, .03072354, .02730981, .01365491
@histw 25.716116, 27.218346, 28.720577, 30.222807, 31.725039, 33.227268, 34.7295, 36.231731, 37.733963, 39.236191, 40.738422, 42.240654, 43.742886
@type float
@label 
@class other
@N_unique .
@N 195
 
_@NOTES
 
=====pctel=====

pctel:                                          {txt}Number of Observations
{hline 8}                                    {hline 30}
                                            Total   Integers   Nonintegers
{c |}  {res}#                         {txt}Negative           {res}-         -          -
{txt}{c |}  {res}#                         {txt}Zero           {res}  129       129          -
{txt}{c |}  {res}#                         {txt}Positive       {res}   91         1         90
{txt}{c |}  {res}#                                        {txt}{hline 5}     {hline 5}      {hline 5}
{c |}  {res}#                         {txt}Total          {res}  220       130         90
{txt}{c |}  {res}#   .   .   .   .         {txt}Missing            {res}-
{txt}{c +}{hline 22}{col 45}{hline 5}
{res}0              24.49393                       220
  (92 unique values)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}pctel {c |}{res}       220    1.117676     2.90094          0   24.49393
@mean     1.118
@sd     2.901
@min     0.000
@max    24.494
@example0 0
@histh .49103081, .03377461, .01039219, .01299023, .00259805, .00519609, .00779414, .00259805, .00259805, .00259805
@histw .8747831, 2.6243494, 4.3739157, 6.1234818, 7.8730478, 9.6226139, 11.37218, 14.871313, 16.620878, 23.619144
@type float
@label 
@class other
@N_unique 92
@N 220
 
_@NOTES
 
{com}. 
. // noi profiler report
. // profiler off
. {c )-}
{txt}
{com}. 
. exit, clear STATA
